Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x393a (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0xd): GNU GIMPLE 10.2.0 -mabi=ilp32 -march=rv32imw -mtune=rvtt-b1 -march=rv32imw -mabi=ilp32 -march=rv32imw -mtune=rvtt-b1 -march=rv32imw -march=rv32imw -march=rv32imw -march=rv32imw -march=rv32imw -mwormhole -g -g -Os -Os -fno-openmp -fno-openacc -fno-pie -ffast-math -fno-tree-loop-distribute-patterns -frvtt-error-multdiv -fltrans
    <10>   DW_AT_language    : 4	(C++)
    <11>   DW_AT_name        : (indirect string, offset: 0x0): <artificial>
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x74a8): /proj_sw/user_dev/jnie/budabackend/src/firmware/riscv/targets/brisc
    <19>   DW_AT_ranges      : 0x1838
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
 <1><25>: Abbrev Number: 2 (DW_TAG_variable)
    <26>   DW_AT_abstract_origin: <0x7476>
    <2a>   DW_AT_const_value : 0x16004
 <1><2e>: Abbrev Number: 2 (DW_TAG_variable)
    <2f>   DW_AT_abstract_origin: <0x746a>
    <33>   DW_AT_const_value : 0x12004
 <1><37>: Abbrev Number: 3 (DW_TAG_variable)
    <38>   DW_AT_abstract_origin: <0x745e>
    <3c>   DW_AT_const_value : 53252
 <1><3e>: Abbrev Number: 4 (DW_TAG_subprogram)
    <3f>   DW_AT_abstract_origin: <0x541f>
    <43>   DW_AT_low_pc      : 0x1950

    <416f>   DW_AT_const_value : 46
 <1><4170>: Abbrev Number: 19 (DW_TAG_variable)
    <4171>   DW_AT_name        : R47
    <4175>   DW_AT_decl_file   : 8
    <4176>   DW_AT_decl_line   : 395
    <4178>   DW_AT_decl_column : 31
    <4179>   DW_AT_type        : <0x3a96>
    <417d>   DW_AT_const_expr  : 1
    <417d>   DW_AT_const_value : 47
 <1><417e>: Abbrev Number: 19 (DW_TAG_variable)
    <417f>   DW_AT_name        : R48
    <4183>   DW_AT_decl_file   : 8
    <4184>   DW_AT_decl_line   : 396
    <4186>   DW_AT_decl_column : 31
    <4187>   DW_AT_type        : <0x3a96>
    <418b>   DW_AT_const_expr  : 1
    <418b>   DW_AT_const_value : 48
 <1><418c>: Abbrev Number: 19 (DW_TAG_variable)
    <418d>   DW_AT_name        : R49
    <4191>   DW_AT_decl_file   : 8
    <4192>   DW_AT_decl_line   : 397
    <4194>   DW_AT_decl_column : 31
    <4195>   DW_AT_type        : <0x3a96>
    <4199>   DW_AT_const_expr  : 1
    <4199>   DW_AT_const_value : 49
 <1><419a>: Abbrev Number: 19 (DW_TAG_variable)
    <419b>   DW_AT_name        : R50
    <419f>   DW_AT_decl_file   : 8
    <41a0>   DW_AT_decl_line   : 398
    <41a2>   DW_AT_decl_column : 31
    <41a3>   DW_AT_type        : <0x3a96>
    <41a7>   DW_AT_const_expr  : 1
    <41a7>   DW_AT_const_value : 50
 <1><41a8>: Abbrev Number: 19 (DW_TAG_variable)
    <41a9>   DW_AT_name        : R51
    <41ad>   DW_AT_decl_file   : 8
    <41ae>   DW_AT_decl_line   : 399
    <41b0>   DW_AT_decl_column : 31
    <41b1>   DW_AT_type        : <0x3a96>
    <41b5>   DW_AT_const_expr  : 1
    <41b5>   DW_AT_const_value : 51
 <1><41b6>: Abbrev Number: 19 (DW_TAG_variable)
    <41b7>   DW_AT_name        : R52
    <41bb>   DW_AT_decl_file   : 8
    <41bc>   DW_AT_decl_line   : 400
    <41be>   DW_AT_decl_column : 31
    <41bf>   DW_AT_type        : <0x3a96>
    <41c3>   DW_AT_const_expr  : 1
    <41c3>   DW_AT_const_value : 52
 <1><41c4>: Abbrev Number: 19 (DW_TAG_variable)
    <41c5>   DW_AT_name        : R53
    <41c9>   DW_AT_decl_file   : 8
    <41ca>   DW_AT_decl_line   : 401
    <41cc>   DW_AT_decl_column : 31
    <41cd>   DW_AT_type        : <0x3a96>
    <41d1>   DW_AT_const_expr  : 1
    <41d1>   DW_AT_const_value : 53
 <1><41d2>: Abbrev Number: 19 (DW_TAG_variable)
    <41d3>   DW_AT_name        : R54
    <41d7>   DW_AT_decl_file   : 8
    <41d8>   DW_AT_decl_line   : 402
    <41da>   DW_AT_decl_column : 31
    <41db>   DW_AT_type        : <0x3a96>
    <41df>   DW_AT_const_expr  : 1
    <41df>   DW_AT_const_value : 54
 <1><41e0>: Abbrev Number: 19 (DW_TAG_variable)
    <41e1>   DW_AT_name        : R55
    <41e5>   DW_AT_decl_file   : 8
    <41e6>   DW_AT_decl_line   : 403
    <41e8>   DW_AT_decl_column : 31
    <41e9>   DW_AT_type        : <0x3a96>
    <41ed>   DW_AT_const_expr  : 1
    <41ed>   DW_AT_const_value : 55
 <1><41ee>: Abbrev Number: 19 (DW_TAG_variable)
    <41ef>   DW_AT_name        : R56
    <41f3>   DW_AT_decl_file   : 8
    <41f4>   DW_AT_decl_line   : 404
    <41f6>   DW_AT_decl_column : 31
    <41f7>   DW_AT_type        : <0x3a96>
    <41fb>   DW_AT_const_expr  : 1
    <41fb>   DW_AT_const_value : 56
 <1><41fc>: Abbrev Number: 19 (DW_TAG_variable)
    <41fd>   DW_AT_name        : R57
    <4201>   DW_AT_decl_file   : 8
    <4202>   DW_AT_decl_line   : 405
    <4204>   DW_AT_decl_column : 31
    <4205>   DW_AT_type        : <0x3a96>
    <4209>   DW_AT_const_expr  : 1
    <4209>   DW_AT_const_value : 57
 <1><420a>: Abbrev Number: 19 (DW_TAG_variable)
    <420b>   DW_AT_name        : R58
    <420f>   DW_AT_decl_file   : 8
    <4210>   DW_AT_decl_line   : 406
    <4212>   DW_AT_decl_column : 31
    <4213>   DW_AT_type        : <0x3a96>
    <4217>   DW_AT_const_expr  : 1
    <4217>   DW_AT_const_value : 58
 <1><4218>: Abbrev Number: 19 (DW_TAG_variable)
    <4219>   DW_AT_name        : R59
    <421d>   DW_AT_decl_file   : 8
    <421e>   DW_AT_decl_line   : 407
    <4220>   DW_AT_decl_column : 31
    <4221>   DW_AT_type        : <0x3a96>
    <4225>   DW_AT_const_expr  : 1
    <4225>   DW_AT_const_value : 59
 <1><4226>: Abbrev Number: 19 (DW_TAG_variable)
    <4227>   DW_AT_name        : R60
    <422b>   DW_AT_decl_file   : 8
    <422c>   DW_AT_decl_line   : 408
    <422e>   DW_AT_decl_column : 31
    <422f>   DW_AT_type        : <0x3a96>
    <4233>   DW_AT_const_expr  : 1
    <4233>   DW_AT_const_value : 60
 <1><4234>: Abbrev Number: 19 (DW_TAG_variable)
    <4235>   DW_AT_name        : R61
    <4239>   DW_AT_decl_file   : 8
    <423a>   DW_AT_decl_line   : 409
    <423c>   DW_AT_decl_column : 31
    <423d>   DW_AT_type        : <0x3a96>
    <4241>   DW_AT_const_expr  : 1
    <4241>   DW_AT_const_value : 61
 <1><4242>: Abbrev Number: 19 (DW_TAG_variable)
    <4243>   DW_AT_name        : R62
    <4247>   DW_AT_decl_file   : 8
    <4248>   DW_AT_decl_line   : 410
    <424a>   DW_AT_decl_column : 31
    <424b>   DW_AT_type        : <0x3a96>
    <424f>   DW_AT_const_expr  : 1
    <424f>   DW_AT_const_value : 62
 <1><4250>: Abbrev Number: 19 (DW_TAG_variable)
    <4251>   DW_AT_name        : R63
    <4255>   DW_AT_decl_file   : 8
    <4256>   DW_AT_decl_line   : 411
    <4258>   DW_AT_decl_column : 31
    <4259>   DW_AT_type        : <0x3a96>
    <425d>   DW_AT_const_expr  : 1
    <425d>   DW_AT_const_value : 63
 <1><425e>: Abbrev Number: 20 (DW_TAG_union_type)
    <425f>   DW_AT_name        : (indirect string, offset: 0x6707): tt_uint64_t
    <4263>   DW_AT_byte_size   : 8
    <4264>   DW_AT_decl_file   : 9
    <4265>   DW_AT_decl_line   : 9
    <4266>   DW_AT_decl_column : 7
    <4267>   DW_AT_sibling     : <0x429d>
 <2><426b>: Abbrev Number: 21 (DW_TAG_structure_type)
    <426c>   DW_AT_byte_size   : 8
    <426d>   DW_AT_decl_file   : 9
    <426e>   DW_AT_decl_line   : 11
    <426f>   DW_AT_decl_column : 12
    <4270>   DW_AT_sibling     : <0x428d>
 <3><4274>: Abbrev Number: 22 (DW_TAG_member)
    <4275>   DW_AT_name        : hi
    <4278>   DW_AT_decl_file   : 9
    <4279>   DW_AT_decl_line   : 12
    <427a>   DW_AT_decl_column : 18
    <427b>   DW_AT_type        : <0x3ae1>
    <427f>   DW_AT_data_member_location: 0
 <3><4280>: Abbrev Number: 22 (DW_TAG_member)
    <4281>   DW_AT_name        : lo
    <4284>   DW_AT_decl_file   : 9
    <4285>   DW_AT_decl_line   : 13
    <4286>   DW_AT_decl_column : 18
    <4287>   DW_AT_type        : <0x3ae1>
    <428b>   DW_AT_data_member_location: 4
 <3><428c>: Abbrev Number: 0
 <2><428d>: Abbrev Number: 23 (DW_TAG_member)
    <428e>   DW_AT_name        : v
    <4290>   DW_AT_decl_file   : 9
    <4291>   DW_AT_decl_line   : 10
    <4292>   DW_AT_decl_column : 14
    <4293>   DW_AT_type        : <0x3b03>
 <2><4297>: Abbrev Number: 24 (DW_TAG_member)
    <4298>   DW_AT_type        : <0x426b>
 <2><429c>: Abbrev Number: 0
 <1><429d>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <429e>   DW_AT_type        : <0x425e>
 <1><42a2>: Abbrev Number: 25 (DW_TAG_variable)
    <42a3>   DW_AT_name        : (indirect string, offset: 0xb39): STREAM_RESTART_CHECK_MASK
    <42a7>   DW_AT_decl_file   : 10
    <42a8>   DW_AT_decl_line   : 26
    <42a9>   DW_AT_decl_column : 16
    <42aa>   DW_AT_type        : <0x3aed>
    <42ae>   DW_AT_const_value : 7
 <1><42af>: Abbrev Number: 26 (DW_TAG_variable)
    <42b0>   DW_AT_name        : (indirect string, offset: 0x15cf): MAX_TILES_PER_PHASE
    <42b4>   DW_AT_decl_file   : 10
    <42b5>   DW_AT_decl_line   : 28
    <42b6>   DW_AT_decl_column : 16
    <42b7>   DW_AT_type        : <0x3aed>
    <42bb>   DW_AT_const_value : 2048
 <1><42bd>: Abbrev Number: 13 (DW_TAG_array_type)
    <42be>   DW_AT_type        : <0x3aa7>
    <42c2>   DW_AT_sibling     : <0x42cd>
 <2><42c6>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <42c7>   DW_AT_type        : <0x3a8f>
    <42cb>   DW_AT_upper_bound : 1
 <2><42cc>: Abbrev Number: 0
 <1><42cd>: Abbrev Number: 27 (DW_TAG_variable)
    <42ce>   DW_AT_name        : (indirect string, offset: 0x14cc): my_x
    <42d2>   DW_AT_decl_file   : 10
    <42d3>   DW_AT_decl_line   : 30
    <42d4>   DW_AT_decl_column : 16
    <42d5>   DW_AT_type        : <0x42bd>
    <42d9>   DW_AT_external    : 1
    <42d9>   DW_AT_declaration : 1
 <1><42d9>: Abbrev Number: 27 (DW_TAG_variable)
    <42da>   DW_AT_name        : (indirect string, offset: 0x16da): my_y
    <42de>   DW_AT_decl_file   : 10
    <42df>   DW_AT_decl_line   : 31
    <42e0>   DW_AT_decl_column : 16
    <42e1>   DW_AT_type        : <0x42bd>
    <42e5>   DW_AT_external    : 1
    <42e5>   DW_AT_declaration : 1
 <1><42e5>: Abbrev Number: 27 (DW_TAG_variable)
    <42e6>   DW_AT_name        : (indirect string, offset: 0x1a01): my_logical_x
    <42ea>   DW_AT_decl_file   : 10
    <42eb>   DW_AT_decl_line   : 32
    <42ec>   DW_AT_decl_column : 16
    <42ed>   DW_AT_type        : <0x42bd>
    <42f1>   DW_AT_external    : 1
    <42f1>   DW_AT_declaration : 1
 <1><42f1>: Abbrev Number: 27 (DW_TAG_variable)
    <42f2>   DW_AT_name        : (indirect string, offset: 0x1a0e): my_logical_y
    <42f6>   DW_AT_decl_file   : 10
    <42f7>   DW_AT_decl_line   : 33
    <42f8>   DW_AT_decl_column : 16
    <42f9>   DW_AT_type        : <0x42bd>
    <42fd>   DW_AT_external    : 1
    <42fd>   DW_AT_declaration : 1
 <1><42fd>: Abbrev Number: 27 (DW_TAG_variable)
    <42fe>   DW_AT_name        : (indirect string, offset: 0x1242): loading_noc
    <4302>   DW_AT_decl_file   : 10
    <4303>   DW_AT_decl_line   : 34
    <4304>   DW_AT_decl_column : 16
    <4305>   DW_AT_type        : <0x3aa7>
    <4309>   DW_AT_external    : 1
    <4309>   DW_AT_declaration : 1
 <1><4309>: Abbrev Number: 27 (DW_TAG_variable)
    <430a>   DW_AT_name        : (indirect string, offset: 0x1abf): noc_size_x
    <430e>   DW_AT_decl_file   : 10
    <430f>   DW_AT_decl_line   : 35
    <4310>   DW_AT_decl_column : 16
    <4311>   DW_AT_type        : <0x3aa7>
    <4315>   DW_AT_external    : 1
    <4315>   DW_AT_declaration : 1
 <1><4315>: Abbrev Number: 27 (DW_TAG_variable)
    <4316>   DW_AT_name        : (indirect string, offset: 0x1aca): noc_size_y
    <431a>   DW_AT_decl_file   : 10
    <431b>   DW_AT_decl_line   : 36
    <431c>   DW_AT_decl_column : 16
    <431d>   DW_AT_type        : <0x3aa7>
    <4321>   DW_AT_external    : 1
    <4321>   DW_AT_declaration : 1
 <1><4321>: Abbrev Number: 27 (DW_TAG_variable)
    <4322>   DW_AT_name        : (indirect string, offset: 0xcdc): noc_trans_table_en
    <4326>   DW_AT_decl_file   : 10
    <4327>   DW_AT_decl_line   : 37
    <4328>   DW_AT_decl_column : 16
    <4329>   DW_AT_type        : <0x3aa7>
    <432d>   DW_AT_external    : 1
    <432d>   DW_AT_declaration : 1
 <1><432d>: Abbrev Number: 25 (DW_TAG_variable)
    <432e>   DW_AT_name        : (indirect string, offset: 0xeee): NCRISC_WR_CMD_BUF
    <4332>   DW_AT_decl_file   : 11
    <4333>   DW_AT_decl_line   : 9
    <4334>   DW_AT_decl_column : 16
    <4335>   DW_AT_type        : <0x3aed>
    <4339>   DW_AT_const_value : 3
 <1><433a>: Abbrev Number: 25 (DW_TAG_variable)
    <433b>   DW_AT_name        : (indirect string, offset: 0xde9): NCRISC_WR_CMD_BUF_0
    <433f>   DW_AT_decl_file   : 11
    <4340>   DW_AT_decl_line   : 10
    <4341>   DW_AT_decl_column : 16
    <4342>   DW_AT_type        : <0x3aed>
    <4346>   DW_AT_const_value : 0
 <1><4347>: Abbrev Number: 25 (DW_TAG_variable)
    <4348>   DW_AT_name        : (indirect string, offset: 0x1900): NCRISC_WR_CMD_BUF_1
    <434c>   DW_AT_decl_file   : 11
    <434d>   DW_AT_decl_line   : 11
    <434e>   DW_AT_decl_column : 16
    <434f>   DW_AT_type        : <0x3aed>
    <4353>   DW_AT_const_value : 1
 <1><4354>: Abbrev Number: 25 (DW_TAG_variable)
    <4355>   DW_AT_name        : (indirect string, offset: 0x44d): NCRISC_SMALL_TXN_CMD_BUF
    <4359>   DW_AT_decl_file   : 11
    <435a>   DW_AT_decl_line   : 12
    <435b>   DW_AT_decl_column : 16
    <435c>   DW_AT_type        : <0x3aed>
    <4360>   DW_AT_const_value : 3
 <1><4361>: Abbrev Number: 25 (DW_TAG_variable)
    <4362>   DW_AT_name        : (indirect string, offset: 0x977): NCRISC_WR_DEF_TRID
    <4366>   DW_AT_decl_file   : 11
    <4367>   DW_AT_decl_line   : 21
    <4368>   DW_AT_decl_column : 16
    <4369>   DW_AT_type        : <0x3aed>
    <436d>   DW_AT_const_value : 0
 <1><436e>: Abbrev Number: 25 (DW_TAG_variable)
    <436f>   DW_AT_name        : (indirect string, offset: 0x199): NCRISC_WR_LOCAL_TRID
    <4373>   DW_AT_decl_file   : 11
    <4374>   DW_AT_decl_line   : 22
    <4375>   DW_AT_decl_column : 16
    <4376>   DW_AT_type        : <0x3aed>
    <437a>   DW_AT_const_value : 1
 <1><437b>: Abbrev Number: 25 (DW_TAG_variable)
    <437c>   DW_AT_name        : (indirect string, offset: 0x1a83): NCRISC_RD_DEF_TRID
    <4380>   DW_AT_decl_file   : 11
    <4381>   DW_AT_decl_line   : 23
    <4382>   DW_AT_decl_column : 16
    <4383>   DW_AT_type        : <0x3aed>
    <4387>   DW_AT_const_value : 2
 <1><4388>: Abbrev Number: 25 (DW_TAG_variable)
    <4389>   DW_AT_name        : (indirect string, offset: 0x1a6d): NCRISC_HEADER_RD_TRID
    <438d>   DW_AT_decl_file   : 11
    <438e>   DW_AT_decl_line   : 24
    <438f>   DW_AT_decl_column : 16
    <4390>   DW_AT_type        : <0x3aed>
    <4394>   DW_AT_const_value : 3
 <1><4395>: Abbrev Number: 25 (DW_TAG_variable)
    <4396>   DW_AT_name        : (indirect string, offset: 0x1b35): NCRISC_RD_START_TRID
    <439a>   DW_AT_decl_file   : 11
    <439b>   DW_AT_decl_line   : 25
    <439c>   DW_AT_decl_column : 16
    <439d>   DW_AT_type        : <0x3aed>
    <43a1>   DW_AT_const_value : 4
 <1><43a2>: Abbrev Number: 25 (DW_TAG_variable)
    <43a3>   DW_AT_name        : (indirect string, offset: 0x3aa): NCRISC_RD_END_TRID
    <43a7>   DW_AT_decl_file   : 11
    <43a8>   DW_AT_decl_line   : 26
    <43a9>   DW_AT_decl_column : 16
    <43aa>   DW_AT_type        : <0x3aed>
    <43ae>   DW_AT_const_value : 13
 <1><43af>: Abbrev Number: 25 (DW_TAG_variable)
    <43b0>   DW_AT_name        : (indirect string, offset: 0x1743): NCRISC_ETH_START_TRID
    <43b4>   DW_AT_decl_file   : 11
    <43b5>   DW_AT_decl_line   : 27
    <43b6>   DW_AT_decl_column : 16
    <43b7>   DW_AT_type        : <0x3aed>
    <43bb>   DW_AT_const_value : 14
 <1><43bc>: Abbrev Number: 25 (DW_TAG_variable)
    <43bd>   DW_AT_name        : (indirect string, offset: 0x1795): NCRISC_ETH_END_TRID
    <43c1>   DW_AT_decl_file   : 11
    <43c2>   DW_AT_decl_line   : 28
    <43c3>   DW_AT_decl_column : 16
    <43c4>   DW_AT_type        : <0x3aed>
    <43c8>   DW_AT_const_value : 15
 <1><43c9>: Abbrev Number: 28 (DW_TAG_namespace)
    <43ca>   DW_AT_name        : (indirect string, offset: 0xb76): l1_mem
    <43ce>   DW_AT_decl_file   : 12
    <43cf>   DW_AT_decl_line   : 5
    <43d0>   DW_AT_decl_column : 11
 <1><43d1>: Abbrev Number: 28 (DW_TAG_namespace)
    <43d2>   DW_AT_name        : (indirect string, offset: 0xb72): eth_l1_mem
    <43d6>   DW_AT_decl_file   : 13
    <43d7>   DW_AT_decl_line   : 5
    <43d8>   DW_AT_decl_column : 11
 <1><43d9>: Abbrev Number: 25 (DW_TAG_variable)
    <43da>   DW_AT_name        : (indirect string, offset: 0x9fb): MCAST_START_STREAM
    <43de>   DW_AT_decl_file   : 14
    <43df>   DW_AT_decl_line   : 16
    <43e0>   DW_AT_decl_column : 16
    <43e1>   DW_AT_type        : <0x3aed>
    <43e5>   DW_AT_const_value : 0
 <1><43e6>: Abbrev Number: 25 (DW_TAG_variable)
    <43e7>   DW_AT_name        : (indirect string, offset: 0xf58): MCAST_END_STREAM
    <43eb>   DW_AT_decl_file   : 14
    <43ec>   DW_AT_decl_line   : 17
    <43ed>   DW_AT_decl_column : 16
    <43ee>   DW_AT_type        : <0x3aed>
    <43f2>   DW_AT_const_value : 3
 <1><43f3>: Abbrev Number: 25 (DW_TAG_variable)
    <43f4>   DW_AT_name        : (indirect string, offset: 0x1c2e): OPERAND_START_STREAM
    <43f8>   DW_AT_decl_file   : 14
    <43f9>   DW_AT_decl_line   : 18
    <43fa>   DW_AT_decl_column : 16
    <43fb>   DW_AT_type        : <0x3aed>
    <43ff>   DW_AT_const_value : 4
 <1><4400>: Abbrev Number: 25 (DW_TAG_variable)
    <4401>   DW_AT_name        : (indirect string, offset: 0xa89): INPUT_START_STREAM_1
    <4405>   DW_AT_decl_file   : 14
    <4406>   DW_AT_decl_line   : 19
    <4407>   DW_AT_decl_column : 16
    <4408>   DW_AT_type        : <0x3aed>
    <440c>   DW_AT_const_value : 4
 <1><440d>: Abbrev Number: 25 (DW_TAG_variable)
    <440e>   DW_AT_name        : (indirect string, offset: 0x12cb): INPUT_START_STREAM_1_SIZE
    <4412>   DW_AT_decl_file   : 14
    <4413>   DW_AT_decl_line   : 20
    <4414>   DW_AT_decl_column : 16
    <4415>   DW_AT_type        : <0x3aed>
    <4419>   DW_AT_const_value : 2
 <1><441a>: Abbrev Number: 25 (DW_TAG_variable)
    <441b>   DW_AT_name        : (indirect string, offset: 0x1455): INPUT_START_STREAM_2
    <441f>   DW_AT_decl_file   : 14
    <4420>   DW_AT_decl_line   : 21
    <4421>   DW_AT_decl_column : 16
    <4422>   DW_AT_type        : <0x3aed>
    <4426>   DW_AT_const_value : 10
 <1><4427>: Abbrev Number: 25 (DW_TAG_variable)
    <4428>   DW_AT_name        : (indirect string, offset: 0x19b6): INPUT_PARAMS_START_STREAM
    <442c>   DW_AT_decl_file   : 14
    <442d>   DW_AT_decl_line   : 22
    <442e>   DW_AT_decl_column : 16
    <442f>   DW_AT_type        : <0x3aed>
    <4433>   DW_AT_const_value : 16
 <1><4434>: Abbrev Number: 25 (DW_TAG_variable)
    <4435>   DW_AT_name        : (indirect string, offset: 0xfb7): OUTPUT_START_STREAM
    <4439>   DW_AT_decl_file   : 14
    <443a>   DW_AT_decl_line   : 23
    <443b>   DW_AT_decl_column : 16
    <443c>   DW_AT_type        : <0x3aed>
    <4440>   DW_AT_const_value : 24
 <1><4441>: Abbrev Number: 25 (DW_TAG_variable)
    <4442>   DW_AT_name        : (indirect string, offset: 0x1077): INTERMEDIATES_START_STREAM
    <4446>   DW_AT_decl_file   : 14
    <4447>   DW_AT_decl_line   : 24
    <4448>   DW_AT_decl_column : 16
    <4449>   DW_AT_type        : <0x3aed>
    <444d>   DW_AT_const_value : 32
 <1><444e>: Abbrev Number: 25 (DW_TAG_variable)
    <444f>   DW_AT_name        : (indirect string, offset: 0x87f): END_IO_STREAM
    <4453>   DW_AT_decl_file   : 14
    <4454>   DW_AT_decl_line   : 25
    <4455>   DW_AT_decl_column : 16
    <4456>   DW_AT_type        : <0x3aed>
    <445a>   DW_AT_const_value : 39
 <1><445b>: Abbrev Number: 25 (DW_TAG_variable)
    <445c>   DW_AT_name        : (indirect string, offset: 0x4ba): OPERAND_INPUT_START_INDEX
    <4460>   DW_AT_decl_file   : 14
    <4461>   DW_AT_decl_line   : 27
    <4462>   DW_AT_decl_column : 11
    <4463>   DW_AT_type        : <0x3a7e>
    <4467>   DW_AT_const_value : 0
 <1><4468>: Abbrev Number: 25 (DW_TAG_variable)
    <4469>   DW_AT_name        : (indirect string, offset: 0x279): OPERAND_INPUT_PARAMS_START_INDEX
    <446d>   DW_AT_decl_file   : 14
    <446e>   DW_AT_decl_line   : 28
    <446f>   DW_AT_decl_column : 11
    <4470>   DW_AT_type        : <0x3a7e>
    <4474>   DW_AT_const_value : 8
 <1><4475>: Abbrev Number: 25 (DW_TAG_variable)
    <4476>   DW_AT_name        : (indirect string, offset: 0x1bae): OPERAND_OUTPUT_START_INDEX
    <447a>   DW_AT_decl_file   : 14
    <447b>   DW_AT_decl_line   : 29
    <447c>   DW_AT_decl_column : 11
    <447d>   DW_AT_type        : <0x3a7e>
    <4481>   DW_AT_const_value : 16
 <1><4482>: Abbrev Number: 25 (DW_TAG_variable)
    <4483>   DW_AT_name        : (indirect string, offset: 0x17d9): OPERAND_INTERMEDIATES_START_INDEX
    <4487>   DW_AT_decl_file   : 14
    <4488>   DW_AT_decl_line   : 30
    <4489>   DW_AT_decl_column : 11
    <448a>   DW_AT_type        : <0x3a7e>
    <448e>   DW_AT_const_value : 24
 <1><448f>: Abbrev Number: 25 (DW_TAG_variable)
    <4490>   DW_AT_name        : (indirect string, offset: 0x946): OPERAND_RELAY_START_INDEX
    <4494>   DW_AT_decl_file   : 14
    <4495>   DW_AT_decl_line   : 31
    <4496>   DW_AT_decl_column : 11
    <4497>   DW_AT_type        : <0x3a7e>
    <449b>   DW_AT_const_value : 32
 <1><449c>: Abbrev Number: 25 (DW_TAG_variable)
    <449d>   DW_AT_name        : (indirect string, offset: 0x9c3): MAX_NUM_OPERANDS
    <44a1>   DW_AT_decl_file   : 14
    <44a2>   DW_AT_decl_line   : 32
    <44a3>   DW_AT_decl_column : 11
    <44a4>   DW_AT_type        : <0x3a7e>
    <44a8>   DW_AT_const_value : 64
 <1><44a9>: Abbrev Number: 15 (DW_TAG_variable)
    <44aa>   DW_AT_name        : (indirect string, offset: 0x3d4): PERF_MAX_NUM_INPUTS
    <44ae>   DW_AT_decl_file   : 14
    <44af>   DW_AT_decl_line   : 116
    <44b0>   DW_AT_decl_column : 28
    <44b1>   DW_AT_type        : <0x3ab3>
    <44b5>   DW_AT_const_expr  : 1
    <44b5>   DW_AT_const_value : 8
 <1><44b6>: Abbrev Number: 15 (DW_TAG_variable)
    <44b7>   DW_AT_name        : (indirect string, offset: 0x11c0): PERF_MAX_NUM_OUTPUTS
    <44bb>   DW_AT_decl_file   : 14
    <44bc>   DW_AT_decl_line   : 117
    <44bd>   DW_AT_decl_column : 28
    <44be>   DW_AT_type        : <0x3ab3>
    <44c2>   DW_AT_const_expr  : 1
    <44c2>   DW_AT_const_value : 1
 <1><44c3>: Abbrev Number: 29 (DW_TAG_namespace)
    <44c4>   DW_AT_name        : (indirect string, offset: 0x441): epoch_queue
    <44c8>   DW_AT_decl_file   : 15
    <44c9>   DW_AT_decl_line   : 9
    <44ca>   DW_AT_decl_column : 11
    <44cb>   DW_AT_sibling     : <0x45cd>
 <2><44cf>: Abbrev Number: 30 (DW_TAG_variable)
    <44d0>   DW_AT_name        : (indirect string, offset: 0x1c43): EPOCH_Q_NUM_SLOTS
    <44d4>   DW_AT_decl_file   : 15
    <44d5>   DW_AT_decl_line   : 13
    <44d6>   DW_AT_decl_column : 35
    <44d7>   DW_AT_type        : <0x3adc>
    <44db>   DW_AT_declaration : 1
    <44db>   DW_AT_const_value : 256
    <44dd>   DW_AT_const_expr  : 1
 <2><44dd>: Abbrev Number: 31 (DW_TAG_variable)
    <44de>   DW_AT_name        : (indirect string, offset: 0x98a): EPOCH_Q_SLOT_SIZE
    <44e2>   DW_AT_decl_file   : 15
    <44e3>   DW_AT_decl_line   : 14
    <44e4>   DW_AT_decl_column : 35
    <44e5>   DW_AT_type        : <0x3adc>
    <44e9>   DW_AT_declaration : 1
    <44e9>   DW_AT_const_value : 32
    <44ea>   DW_AT_const_expr  : 1
 <2><44ea>: Abbrev Number: 31 (DW_TAG_variable)
    <44eb>   DW_AT_name        : (indirect string, offset: 0x1ab3): GridSizeRow
    <44ef>   DW_AT_decl_file   : 15
    <44f0>   DW_AT_decl_line   : 15
    <44f1>   DW_AT_decl_column : 35
    <44f2>   DW_AT_type        : <0x3adc>
    <44f6>   DW_AT_declaration : 1
    <44f6>   DW_AT_const_value : 12
    <44f7>   DW_AT_const_expr  : 1
 <2><44f7>: Abbrev Number: 31 (DW_TAG_variable)
    <44f8>   DW_AT_name        : (indirect string, offset: 0xebd): GridSizeCol
    <44fc>   DW_AT_decl_file   : 15
    <44fd>   DW_AT_decl_line   : 16
    <44fe>   DW_AT_decl_column : 35
    <44ff>   DW_AT_type        : <0x3adc>
    <4503>   DW_AT_declaration : 1
    <4503>   DW_AT_const_value : 10
    <4504>   DW_AT_const_expr  : 1
 <2><4504>: Abbrev Number: 32 (DW_TAG_variable)
    <4505>   DW_AT_name        : (indirect string, offset: 0x1914): EpochEndReached
    <4509>   DW_AT_decl_file   : 15
    <450a>   DW_AT_decl_line   : 17
    <450b>   DW_AT_decl_column : 35
    <450c>   DW_AT_type        : <0x3adc>
    <4510>   DW_AT_declaration : 1
    <4510>   DW_AT_const_value : -1
    <4511>   DW_AT_const_expr  : 1
 <2><4511>: Abbrev Number: 31 (DW_TAG_variable)
    <4512>   DW_AT_name        : (indirect string, offset: 0x1bdc): EPOCH_BIN_NUM_SLOTS
    <4516>   DW_AT_decl_file   : 15
    <4517>   DW_AT_decl_line   : 19
    <4518>   DW_AT_decl_column : 35
    <4519>   DW_AT_type        : <0x3adc>
    <451d>   DW_AT_declaration : 1
    <451d>   DW_AT_const_value : 32
    <451e>   DW_AT_const_expr  : 1
 <2><451e>: Abbrev Number: 33 (DW_TAG_variable)
    <451f>   DW_AT_name        : (indirect string, offset: 0x723): POLLING_EPOCH_QUEUE_TAG
    <4523>   DW_AT_decl_file   : 15
    <4524>   DW_AT_decl_line   : 20
    <4525>   DW_AT_decl_column : 36
    <4526>   DW_AT_type        : <0x3aed>
    <452a>   DW_AT_declaration : 1
    <452a>   DW_AT_const_value : 0xaca0cafe
    <452e>   DW_AT_const_expr  : 1
 <2><452e>: Abbrev Number: 31 (DW_TAG_variable)
    <452f>   DW_AT_name        : (indirect string, offset: 0xd7c): EPOCH_Q_WRPTR_OFFSET
    <4533>   DW_AT_decl_file   : 15
    <4534>   DW_AT_decl_line   : 98
    <4535>   DW_AT_decl_column : 35
    <4536>   DW_AT_type        : <0x3adc>
    <453a>   DW_AT_declaration : 1
    <453a>   DW_AT_const_value : 4
    <453b>   DW_AT_const_expr  : 1
 <2><453b>: Abbrev Number: 31 (DW_TAG_variable)
    <453c>   DW_AT_name        : (indirect string, offset: 0xec9): EPOCH_Q_RDPTR_OFFSET
    <4540>   DW_AT_decl_file   : 15
    <4541>   DW_AT_decl_line   : 99
    <4542>   DW_AT_decl_column : 35
    <4543>   DW_AT_type        : <0x3adc>
    <4547>   DW_AT_declaration : 1
    <4547>   DW_AT_const_value : 0
    <4548>   DW_AT_const_expr  : 1
 <2><4548>: Abbrev Number: 31 (DW_TAG_variable)
    <4549>   DW_AT_name        : (indirect string, offset: 0xf87): EPOCH_Q_SLOTS_OFFSET
    <454d>   DW_AT_decl_file   : 15
    <454e>   DW_AT_decl_line   : 100
    <454f>   DW_AT_decl_column : 35
    <4550>   DW_AT_type        : <0x3adc>
    <4554>   DW_AT_declaration : 1
    <4554>   DW_AT_const_value : 32
    <4555>   DW_AT_const_expr  : 1
 <2><4555>: Abbrev Number: 30 (DW_TAG_variable)
    <4556>   DW_AT_name        : (indirect string, offset: 0x11d5): EPOCH_TABLE_ENTRY_SIZE_BYTES
    <455a>   DW_AT_decl_file   : 15
    <455b>   DW_AT_decl_line   : 102
    <455c>   DW_AT_decl_column : 35
    <455d>   DW_AT_type        : <0x3adc>
    <4561>   DW_AT_declaration : 1
    <4561>   DW_AT_const_value : 8224
    <4563>   DW_AT_const_expr  : 1
 <2><4563>: Abbrev Number: 31 (DW_TAG_variable)
    <4564>   DW_AT_name        : (indirect string, offset: 0xbe1): QUEUE_UPDATE_BLOB_NUM_ENTRIES
    <4568>   DW_AT_decl_file   : 15
    <4569>   DW_AT_decl_line   : 103
    <456a>   DW_AT_decl_column : 35
    <456b>   DW_AT_type        : <0x3adc>
    <456f>   DW_AT_declaration : 1
    <456f>   DW_AT_const_value : 120
    <4570>   DW_AT_const_expr  : 1
 <2><4570>: Abbrev Number: 30 (DW_TAG_variable)
    <4571>   DW_AT_name        : (indirect string, offset: 0x11f2): QUEUE_UPDATE_BLOB_SIZE_BYTES
    <4575>   DW_AT_decl_file   : 15
    <4576>   DW_AT_decl_line   : 104
    <4577>   DW_AT_decl_column : 35
    <4578>   DW_AT_type        : <0x3adc>
    <457c>   DW_AT_declaration : 1
    <457c>   DW_AT_const_value : 960
    <457e>   DW_AT_const_expr  : 1
 <2><457e>: Abbrev Number: 33 (DW_TAG_variable)
    <457f>   DW_AT_name        : (indirect string, offset: 0x134e): DRAM_EPOCH_METADATA_BASE
    <4583>   DW_AT_decl_file   : 15
    <4584>   DW_AT_decl_line   : 106
    <4585>   DW_AT_decl_column : 35
    <4586>   DW_AT_type        : <0x3adc>
    <458a>   DW_AT_declaration : 1
    <458a>   DW_AT_const_value : 0x700000
    <458e>   DW_AT_const_expr  : 1
 <2><458e>: Abbrev Number: 33 (DW_TAG_variable)
    <458f>   DW_AT_name        : (indirect string, offset: 0xfe7): DRAM_EPOCH_METADATA_LIMIT
    <4593>   DW_AT_decl_file   : 15
    <4594>   DW_AT_decl_line   : 107
    <4595>   DW_AT_decl_column : 35
    <4596>   DW_AT_type        : <0x3adc>
    <459a>   DW_AT_declaration : 1
    <459a>   DW_AT_const_value : 0x800000
    <459e>   DW_AT_const_expr  : 1
 <2><459e>: Abbrev Number: 33 (DW_TAG_variable)
    <459f>   DW_AT_name        : (indirect string, offset: 0x15e3): EPOCH_TABLE_DRAM_ADDR
    <45a3>   DW_AT_decl_file   : 15
    <45a4>   DW_AT_decl_line   : 109
    <45a5>   DW_AT_decl_column : 35
    <45a6>   DW_AT_type        : <0x3adc>
    <45aa>   DW_AT_declaration : 1
    <45aa>   DW_AT_const_value : 0x70f100
    <45ae>   DW_AT_const_expr  : 1
 <2><45ae>: Abbrev Number: 30 (DW_TAG_variable)
    <45af>   DW_AT_name        : (indirect string, offset: 0x1971): EPOCH_ALLOC_QUEUE_SYNC_SLOTS
    <45b3>   DW_AT_decl_file   : 15
    <45b4>   DW_AT_decl_line   : 110
    <45b5>   DW_AT_decl_column : 35
    <45b6>   DW_AT_type        : <0x3adc>
    <45ba>   DW_AT_declaration : 1
    <45ba>   DW_AT_const_value : 256
    <45bc>   DW_AT_const_expr  : 1
 <2><45bc>: Abbrev Number: 33 (DW_TAG_variable)
    <45bd>   DW_AT_name        : (indirect string, offset: 0xb7d): EPOCH_ALLOC_QUEUE_SYNC_ADDR
    <45c1>   DW_AT_decl_file   : 15
    <45c2>   DW_AT_decl_line   : 111
    <45c3>   DW_AT_decl_column : 35
    <45c4>   DW_AT_type        : <0x3adc>
    <45c8>   DW_AT_declaration : 1
    <45c8>   DW_AT_const_value : 0x70d100
    <45cc>   DW_AT_const_expr  : 1
 <2><45cc>: Abbrev Number: 0
 <1><45cd>: Abbrev Number: 34 (DW_TAG_variable)
    <45ce>   DW_AT_specification: <0x44cf>
 <1><45d2>: Abbrev Number: 34 (DW_TAG_variable)
    <45d3>   DW_AT_specification: <0x44dd>
 <1><45d7>: Abbrev Number: 34 (DW_TAG_variable)
    <45d8>   DW_AT_specification: <0x44ea>
 <1><45dc>: Abbrev Number: 34 (DW_TAG_variable)
    <45dd>   DW_AT_specification: <0x44f7>
 <1><45e1>: Abbrev Number: 34 (DW_TAG_variable)
    <45e2>   DW_AT_specification: <0x4504>
 <1><45e6>: Abbrev Number: 34 (DW_TAG_variable)
    <45e7>   DW_AT_specification: <0x4511>
 <1><45eb>: Abbrev Number: 34 (DW_TAG_variable)
    <45ec>   DW_AT_specification: <0x451e>
 <1><45f0>: Abbrev Number: 13 (DW_TAG_array_type)
    <45f1>   DW_AT_type        : <0x3ae1>
    <45f5>   DW_AT_sibling     : <0x4600>
 <2><45f9>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <45fa>   DW_AT_type        : <0x3a8f>
    <45fe>   DW_AT_upper_bound : 4
 <2><45ff>: Abbrev Number: 0
 <1><4600>: Abbrev Number: 34 (DW_TAG_variable)
    <4601>   DW_AT_specification: <0x452e>
 <1><4605>: Abbrev Number: 34 (DW_TAG_variable)
    <4606>   DW_AT_specification: <0x453b>
 <1><460a>: Abbrev Number: 34 (DW_TAG_variable)
    <460b>   DW_AT_specification: <0x4548>
 <1><460f>: Abbrev Number: 34 (DW_TAG_variable)
    <4610>   DW_AT_specification: <0x4555>
 <1><4614>: Abbrev Number: 34 (DW_TAG_variable)
    <4615>   DW_AT_specification: <0x4563>
 <1><4619>: Abbrev Number: 34 (DW_TAG_variable)
    <461a>   DW_AT_specification: <0x4570>
 <1><461e>: Abbrev Number: 34 (DW_TAG_variable)
    <461f>   DW_AT_specification: <0x457e>
 <1><4623>: Abbrev Number: 34 (DW_TAG_variable)
    <4624>   DW_AT_specification: <0x458e>
 <1><4628>: Abbrev Number: 34 (DW_TAG_variable)
    <4629>   DW_AT_specification: <0x459e>
 <1><462d>: Abbrev Number: 34 (DW_TAG_variable)
    <462e>   DW_AT_specification: <0x45ae>
 <1><4632>: Abbrev Number: 34 (DW_TAG_variable)
    <4633>   DW_AT_specification: <0x45bc>
 <1><4637>: Abbrev Number: 18 (DW_TAG_variable)
    <4638>   DW_AT_name        : (indirect string, offset: 0xdac): EPOCH_INFO_ADDR
    <463c>   DW_AT_decl_file   : 16
    <463d>   DW_AT_decl_line   : 12
    <463e>   DW_AT_decl_column : 16
    <463f>   DW_AT_type        : <0x3aed>
    <4643>   DW_AT_const_value : 0x23080
 <1><4647>: Abbrev Number: 18 (DW_TAG_variable)
    <4648>   DW_AT_name        : (indirect string, offset: 0xda8): ETH_EPOCH_INFO_ADDR
    <464c>   DW_AT_decl_file   : 16
    <464d>   DW_AT_decl_line   : 15
    <464e>   DW_AT_decl_column : 16
    <464f>   DW_AT_type        : <0x3aed>
    <4653>   DW_AT_const_value : 0x20080
 <1><4657>: Abbrev Number: 26 (DW_TAG_variable)
    <4658>   DW_AT_name        : (indirect string, offset: 0x1b71): EPOCH_Q_BASE
    <465c>   DW_AT_decl_file   : 16
    <465d>   DW_AT_decl_line   : 21
    <465e>   DW_AT_decl_column : 16
    <465f>   DW_AT_type        : <0x3aed>
    <4663>   DW_AT_const_value : 28672
 <1><4665>: Abbrev Number: 26 (DW_TAG_variable)
    <4666>   DW_AT_name        : (indirect string, offset: 0x1b6d): ETH_EPOCH_Q_BASE
    <466a>   DW_AT_decl_file   : 16
    <466b>   DW_AT_decl_line   : 22
    <466c>   DW_AT_decl_column : 16
    <466d>   DW_AT_type        : <0x3aed>
    <4671>   DW_AT_const_value : 36864
 <1><4673>: Abbrev Number: 25 (DW_TAG_variable)
    <4674>   DW_AT_name        : (indirect string, offset: 0xd6b): EPOCH_MAX_INPUTS
    <4678>   DW_AT_decl_file   : 16
    <4679>   DW_AT_decl_line   : 28
    <467a>   DW_AT_decl_column : 16
    <467b>   DW_AT_type        : <0x3aed>
    <467f>   DW_AT_const_value : 24
 <1><4680>: Abbrev Number: 25 (DW_TAG_variable)
    <4681>   DW_AT_name        : (indirect string, offset: 0xf9c): EPOCH_MAX_OUTPUTS
    <4685>   DW_AT_decl_file   : 16
    <4686>   DW_AT_decl_line   : 29
    <4687>   DW_AT_decl_column : 16
    <4688>   DW_AT_type        : <0x3aed>
    <468c>   DW_AT_const_value : 16
 <1><468d>: Abbrev Number: 25 (DW_TAG_variable)
    <468e>   DW_AT_name        : (indirect string, offset: 0x598): EPOCH_MAX_OUTPUTS_ETH
    <4692>   DW_AT_decl_file   : 16
    <4693>   DW_AT_decl_line   : 30
    <4694>   DW_AT_decl_column : 16
    <4695>   DW_AT_type        : <0x3aed>
    <4699>   DW_AT_const_value : 24
 <1><469a>: Abbrev Number: 25 (DW_TAG_variable)
    <469b>   DW_AT_name        : (indirect string, offset: 0x13cd): EPOCH_MAX_OUTPUT_FORKS
    <469f>   DW_AT_decl_file   : 16
    <46a0>   DW_AT_decl_line   : 31
    <46a1>   DW_AT_decl_column : 16
    <46a2>   DW_AT_type        : <0x3aed>
    <46a6>   DW_AT_const_value : 16
 <1><46a7>: Abbrev Number: 25 (DW_TAG_variable)
    <46a8>   DW_AT_name        : (indirect string, offset: 0x1875): EPOCH_MAX_NUM_TILE_SIZES
    <46ac>   DW_AT_decl_file   : 16
    <46ad>   DW_AT_decl_line   : 32
    <46ae>   DW_AT_decl_column : 16
    <46af>   DW_AT_type        : <0x3aed>
    <46b3>   DW_AT_const_value : 8
 <1><46b4>: Abbrev Number: 35 (DW_TAG_enumeration_type)
    <46b5>   DW_AT_name        : (indirect string, offset: 0x199f): datacopy_stream_type_t
    <46b9>   DW_AT_encoding    : 7	(unsigned)
    <46ba>   DW_AT_byte_size   : 1
    <46bb>   DW_AT_type        : <0x3aa7>
    <46bf>   DW_AT_decl_file   : 16
    <46c0>   DW_AT_decl_line   : 34
    <46c1>   DW_AT_decl_column : 6
    <46c2>   DW_AT_sibling     : <0x46d9>
 <2><46c6>: Abbrev Number: 36 (DW_TAG_enumerator)
    <46c7>   DW_AT_name        : (indirect string, offset: 0x31b): NONE
    <46cb>   DW_AT_const_value : 0
 <2><46cc>: Abbrev Number: 36 (DW_TAG_enumerator)
    <46cd>   DW_AT_name        : (indirect string, offset: 0x1367): UNPACKER
    <46d1>   DW_AT_const_value : 1
 <2><46d2>: Abbrev Number: 36 (DW_TAG_enumerator)
    <46d3>   DW_AT_name        : (indirect string, offset: 0x1369): PACKER
    <46d7>   DW_AT_const_value : 2
 <2><46d8>: Abbrev Number: 0
 <1><46d9>: Abbrev Number: 26 (DW_TAG_variable)
    <46da>   DW_AT_name        : (indirect string, offset: 0x168b): DRAM_POLLING_CTRL_BASE
    <46de>   DW_AT_decl_file   : 16
    <46df>   DW_AT_decl_line   : 69
    <46e0>   DW_AT_decl_column : 16
    <46e1>   DW_AT_type        : <0x3aed>
    <46e5>   DW_AT_const_value : 20544
 <1><46e7>: Abbrev Number: 26 (DW_TAG_variable)
    <46e8>   DW_AT_name        : (indirect string, offset: 0x1687): ETH_DRAM_POLLING_CTRL_BASE
    <46ec>   DW_AT_decl_file   : 16
    <46ed>   DW_AT_decl_line   : 70
    <46ee>   DW_AT_decl_column : 16
    <46ef>   DW_AT_type        : <0x3aed>
    <46f3>   DW_AT_const_value : 36896
 <1><46f5>: Abbrev Number: 18 (DW_TAG_variable)
    <46f6>   DW_AT_name        : (indirect string, offset: 0x14b5): EPOCH_RUNTIME_CONFIG_B
    <46fa>   DW_AT_decl_file   : 16
    <46fb>   DW_AT_decl_line   : 78
    <46fc>   DW_AT_decl_column : 16
    <46fd>   DW_AT_type        : <0x3aed>
    <4701>   DW_AT_const_value : 0x23000
 <1><4705>: Abbrev Number: 18 (DW_TAG_variable)
    <4706>   DW_AT_name        : (indirect string, offset: 0x14b1): ETH_EPOCH_RUNTIME_CONFIG_B
    <470a>   DW_AT_decl_file   : 16
    <470b>   DW_AT_decl_line   : 79
    <470c>   DW_AT_decl_column : 16
    <470d>   DW_AT_type        : <0x3aed>
    <4711>   DW_AT_const_value : 0x20000
 <1><4715>: Abbrev Number: 37 (DW_TAG_structure_type)
    <4716>   DW_AT_name        : (indirect string, offset: 0xd2c): scatter_pipe_blob_t
    <471a>   DW_AT_byte_size   : 8
    <471b>   DW_AT_decl_file   : 16
    <471c>   DW_AT_decl_line   : 86
    <471d>   DW_AT_decl_column : 8
    <471e>   DW_AT_sibling     : <0x473d>
 <2><4722>: Abbrev Number: 38 (DW_TAG_member)
    <4723>   DW_AT_name        : (indirect string, offset: 0x17fb): scatter_blob_base_addr
    <4727>   DW_AT_decl_file   : 16
    <4728>   DW_AT_decl_line   : 87
    <4729>   DW_AT_decl_column : 14
    <472a>   DW_AT_type        : <0x3ae1>
    <472e>   DW_AT_data_member_location: 0
 <2><472f>: Abbrev Number: 38 (DW_TAG_member)
    <4730>   DW_AT_name        : (indirect string, offset: 0xa5b): start_scatter_blob_num_cfg_regs
    <4734>   DW_AT_decl_file   : 16
    <4735>   DW_AT_decl_line   : 88
    <4736>   DW_AT_decl_column : 14
    <4737>   DW_AT_type        : <0x3ae1>
    <473b>   DW_AT_data_member_location: 4
 <2><473c>: Abbrev Number: 0
 <1><473d>: Abbrev Number: 2 (DW_TAG_typedef)
    <473e>   DW_AT_name        : (indirect string, offset: 0xd2c): scatter_pipe_blob_t
    <4742>   DW_AT_decl_file   : 16
    <4743>   DW_AT_decl_line   : 91
    <4744>   DW_AT_decl_column : 36
    <4745>   DW_AT_type        : <0x4715>
 <1><4749>: Abbrev Number: 37 (DW_TAG_structure_type)
    <474a>   DW_AT_name        : (indirect string, offset: 0x906): scatter_pipe_state_t
    <474e>   DW_AT_byte_size   : 16
    <474f>   DW_AT_decl_file   : 16
    <4750>   DW_AT_decl_line   : 96
    <4751>   DW_AT_decl_column : 8
    <4752>   DW_AT_sibling     : <0x478b>
 <2><4756>: Abbrev Number: 38 (DW_TAG_member)
    <4757>   DW_AT_name        : (indirect string, offset: 0x1b4a): curr_unroll
    <475b>   DW_AT_decl_file   : 16
    <475c>   DW_AT_decl_line   : 97
    <475d>   DW_AT_decl_column : 12
    <475e>   DW_AT_type        : <0x3ae1>
    <4762>   DW_AT_data_member_location: 0
 <2><4763>: Abbrev Number: 38 (DW_TAG_member)
    <4764>   DW_AT_name        : (indirect string, offset: 0x19e3): max_unroll
    <4768>   DW_AT_decl_file   : 16
    <4769>   DW_AT_decl_line   : 98
    <476a>   DW_AT_decl_column : 12
    <476b>   DW_AT_type        : <0x3ae1>
    <476f>   DW_AT_data_member_location: 4
 <2><4770>: Abbrev Number: 38 (DW_TAG_member)
    <4771>   DW_AT_name        : (indirect string, offset: 0xf30): unused0
    <4775>   DW_AT_decl_file   : 16
    <4776>   DW_AT_decl_line   : 99
    <4777>   DW_AT_decl_column : 12
    <4778>   DW_AT_type        : <0x3ae1>
    <477c>   DW_AT_data_member_location: 8
 <2><477d>: Abbrev Number: 38 (DW_TAG_member)
    <477e>   DW_AT_name        : (indirect string, offset: 0x1483): unroll_blobs
    <4782>   DW_AT_decl_file   : 16
    <4783>   DW_AT_decl_line   : 100
    <4784>   DW_AT_decl_column : 35
    <4785>   DW_AT_type        : <0x478b>
    <4789>   DW_AT_data_member_location: 12
 <2><478a>: Abbrev Number: 0
 <1><478b>: Abbrev Number: 39 (DW_TAG_pointer_type)
    <478c>   DW_AT_byte_size   : 4
    <478d>   DW_AT_type        : <0x473d>
 <1><4791>: Abbrev Number: 2 (DW_TAG_typedef)
    <4792>   DW_AT_name        : (indirect string, offset: 0x906): scatter_pipe_state_t
    <4796>   DW_AT_decl_file   : 16
    <4797>   DW_AT_decl_line   : 103
    <4798>   DW_AT_decl_column : 37
    <4799>   DW_AT_type        : <0x4749>
 <1><479d>: Abbrev Number: 37 (DW_TAG_structure_type)
    <479e>   DW_AT_name        : (indirect string, offset: 0x181): dram_io_scatter_state_t
    <47a2>   DW_AT_byte_size   : 32
    <47a3>   DW_AT_decl_file   : 16
    <47a4>   DW_AT_decl_line   : 108
    <47a5>   DW_AT_decl_column : 8
    <47a6>   DW_AT_sibling     : <0x4813>
 <2><47aa>: Abbrev Number: 38 (DW_TAG_member)
    <47ab>   DW_AT_name        : (indirect string, offset: 0xf38): unused1
    <47af>   DW_AT_decl_file   : 16
    <47b0>   DW_AT_decl_line   : 109
    <47b1>   DW_AT_decl_column : 12
    <47b2>   DW_AT_type        : <0x3ae1>
    <47b6>   DW_AT_data_member_location: 0
 <2><47b7>: Abbrev Number: 38 (DW_TAG_member)
    <47b8>   DW_AT_name        : (indirect string, offset: 0x15ba): scatter_offsets_size
    <47bc>   DW_AT_decl_file   : 16
    <47bd>   DW_AT_decl_line   : 110
    <47be>   DW_AT_decl_column : 12
    <47bf>   DW_AT_type        : <0x3ae1>
    <47c3>   DW_AT_data_member_location: 4
 <2><47c4>: Abbrev Number: 38 (DW_TAG_member)
    <47c5>   DW_AT_name        : (indirect string, offset: 0x5a75): scatter_chunk_size_bytes
    <47c9>   DW_AT_decl_file   : 16
    <47ca>   DW_AT_decl_line   : 111
    <47cb>   DW_AT_decl_column : 12
    <47cc>   DW_AT_type        : <0x3ae1>
    <47d0>   DW_AT_data_member_location: 8
 <2><47d1>: Abbrev Number: 38 (DW_TAG_member)
    <47d2>   DW_AT_name        : (indirect string, offset: 0x1263): q_slot_size_bytes
    <47d6>   DW_AT_decl_file   : 16
    <47d7>   DW_AT_decl_line   : 112
    <47d8>   DW_AT_decl_column : 12
    <47d9>   DW_AT_type        : <0x3ae1>
    <47dd>   DW_AT_data_member_location: 12
 <2><47de>: Abbrev Number: 38 (DW_TAG_member)
    <47df>   DW_AT_name        : (indirect string, offset: 0x5f99): scatter_chunk_size_tiles
    <47e3>   DW_AT_decl_file   : 16
    <47e4>   DW_AT_decl_line   : 113
    <47e5>   DW_AT_decl_column : 12
    <47e6>   DW_AT_type        : <0x3ae1>
    <47ea>   DW_AT_data_member_location: 16
 <2><47eb>: Abbrev Number: 38 (DW_TAG_member)
    <47ec>   DW_AT_name        : (indirect string, offset: 0xf40): unused2
    <47f0>   DW_AT_decl_file   : 16
    <47f1>   DW_AT_decl_line   : 114
    <47f2>   DW_AT_decl_column : 12
    <47f3>   DW_AT_type        : <0x3ae1>
    <47f7>   DW_AT_data_member_location: 20
 <2><47f8>: Abbrev Number: 38 (DW_TAG_member)
    <47f9>   DW_AT_name        : (indirect string, offset: 0xf48): unused3
    <47fd>   DW_AT_decl_file   : 16
    <47fe>   DW_AT_decl_line   : 115
    <47ff>   DW_AT_decl_column : 12
    <4800>   DW_AT_type        : <0x3ae1>
    <4804>   DW_AT_data_member_location: 24
 <2><4805>: Abbrev Number: 38 (DW_TAG_member)
    <4806>   DW_AT_name        : (indirect string, offset: 0x5fea): scatter_offsets
    <480a>   DW_AT_decl_file   : 16
    <480b>   DW_AT_decl_line   : 116
    <480c>   DW_AT_decl_column : 36
    <480d>   DW_AT_type        : <0x4813>
    <4811>   DW_AT_data_member_location: 28
 <2><4812>: Abbrev Number: 0
 <1><4813>: Abbrev Number: 39 (DW_TAG_pointer_type)
    <4814>   DW_AT_byte_size   : 4
    <4815>   DW_AT_type        : <0x429d>
 <1><4819>: Abbrev Number: 37 (DW_TAG_structure_type)
    <481a>   DW_AT_name        : (indirect string, offset: 0xd1c): dram_io_state_t
    <481e>   DW_AT_byte_size   : 96
    <481f>   DW_AT_decl_file   : 16
    <4820>   DW_AT_decl_line   : 124
    <4821>   DW_AT_decl_column : 8
    <4822>   DW_AT_sibling     : <0x4a6a>
 <2><4826>: Abbrev Number: 40 (DW_TAG_union_type)
    <4827>   DW_AT_byte_size   : 8
    <4828>   DW_AT_decl_file   : 16
    <4829>   DW_AT_decl_line   : 151
    <482a>   DW_AT_decl_column : 9
    <482b>   DW_AT_sibling     : <0x488f>
 <3><482f>: Abbrev Number: 21 (DW_TAG_structure_type)
    <4830>   DW_AT_byte_size   : 8
    <4831>   DW_AT_decl_file   : 16
    <4832>   DW_AT_decl_line   : 152
    <4833>   DW_AT_decl_column : 12
    <4834>   DW_AT_sibling     : <0x486d>
 <4><4838>: Abbrev Number: 38 (DW_TAG_member)
    <4839>   DW_AT_name        : (indirect string, offset: 0x19d0): wr_lrd_ptr_autoinc
    <483d>   DW_AT_decl_file   : 16
    <483e>   DW_AT_decl_line   : 153
    <483f>   DW_AT_decl_column : 16
    <4840>   DW_AT_type        : <0x3ac4>
    <4844>   DW_AT_data_member_location: 0
 <4><4845>: Abbrev Number: 38 (DW_TAG_member)
    <4846>   DW_AT_name        : (indirect string, offset: 0xf40): unused2
    <484a>   DW_AT_decl_file   : 16
    <484b>   DW_AT_decl_line   : 154
    <484c>   DW_AT_decl_column : 16
    <484d>   DW_AT_type        : <0x3ac4>
    <4851>   DW_AT_data_member_location: 2
 <4><4852>: Abbrev Number: 38 (DW_TAG_member)
    <4853>   DW_AT_name        : (indirect string, offset: 0x13b6): wr_queue_update_stride
    <4857>   DW_AT_decl_file   : 16
    <4858>   DW_AT_decl_line   : 155
    <4859>   DW_AT_decl_column : 16
    <485a>   DW_AT_type        : <0x3ac4>
    <485e>   DW_AT_data_member_location: 4
 <4><485f>: Abbrev Number: 38 (DW_TAG_member)
    <4860>   DW_AT_name        : (indirect string, offset: 0xf48): unused3
    <4864>   DW_AT_decl_file   : 16
    <4865>   DW_AT_decl_line   : 156
    <4866>   DW_AT_decl_column : 16
    <4867>   DW_AT_type        : <0x3ac4>
    <486b>   DW_AT_data_member_location: 6
 <4><486c>: Abbrev Number: 0
 <3><486d>: Abbrev Number: 21 (DW_TAG_structure_type)
    <486e>   DW_AT_byte_size   : 8
    <486f>   DW_AT_decl_file   : 16
    <4870>   DW_AT_decl_line   : 158
    <4871>   DW_AT_decl_column : 12
    <4872>   DW_AT_sibling     : <0x4884>
 <4><4876>: Abbrev Number: 38 (DW_TAG_member)
    <4877>   DW_AT_name        : (indirect string, offset: 0xb99): dram_streaming_header_addr
    <487b>   DW_AT_decl_file   : 16
    <487c>   DW_AT_decl_line   : 159
    <487d>   DW_AT_decl_column : 19
    <487e>   DW_AT_type        : <0x425e>
    <4882>   DW_AT_data_member_location: 0
 <4><4883>: Abbrev Number: 0
 <3><4884>: Abbrev Number: 24 (DW_TAG_member)
    <4885>   DW_AT_type        : <0x482f>
 <3><4889>: Abbrev Number: 24 (DW_TAG_member)
    <488a>   DW_AT_type        : <0x486d>
 <3><488e>: Abbrev Number: 0
 <2><488f>: Abbrev Number: 38 (DW_TAG_member)
    <4890>   DW_AT_name        : (indirect string, offset: 0xb2b): rd_dram_rdptr
    <4894>   DW_AT_decl_file   : 16
    <4895>   DW_AT_decl_line   : 126
    <4896>   DW_AT_decl_column : 12
    <4897>   DW_AT_type        : <0x3ac4>
    <489b>   DW_AT_data_member_location: 0
 <2><489c>: Abbrev Number: 38 (DW_TAG_member)
    <489d>   DW_AT_name        : (indirect string, offset: 0xc44): rd_grd_ptr_autoinc
    <48a1>   DW_AT_decl_file   : 16
    <48a2>   DW_AT_decl_line   : 127
    <48a3>   DW_AT_decl_column : 12
    <48a4>   DW_AT_type        : <0x3ac4>
    <48a8>   DW_AT_data_member_location: 2
 <2><48a9>: Abbrev Number: 38 (DW_TAG_member)
    <48aa>   DW_AT_name        : (indirect string, offset: 0x1434): rd_dram_wrptr
    <48ae>   DW_AT_decl_file   : 16
    <48af>   DW_AT_decl_line   : 128
    <48b0>   DW_AT_decl_column : 12
    <48b1>   DW_AT_type        : <0x3ac4>
    <48b5>   DW_AT_data_member_location: 4
 <2><48b6>: Abbrev Number: 38 (DW_TAG_member)
    <48b7>   DW_AT_name        : (indirect string, offset: 0xcc9): rd_gwr_ptr_autoinc
    <48bb>   DW_AT_decl_file   : 16
    <48bc>   DW_AT_decl_line   : 129
    <48bd>   DW_AT_decl_column : 12
    <48be>   DW_AT_type        : <0x3ac4>
    <48c2>   DW_AT_data_member_location: 6
 <2><48c3>: Abbrev Number: 38 (DW_TAG_member)
    <48c4>   DW_AT_name        : (indirect string, offset: 0x1038): rd_dram_local_rdptr
    <48c8>   DW_AT_decl_file   : 16
    <48c9>   DW_AT_decl_line   : 130
    <48ca>   DW_AT_decl_column : 12
    <48cb>   DW_AT_type        : <0x3ac4>
    <48cf>   DW_AT_data_member_location: 8
 <2><48d0>: Abbrev Number: 38 (DW_TAG_member)
    <48d1>   DW_AT_name        : (indirect string, offset: 0x1a5d): rd_epoch_id_tag
    <48d5>   DW_AT_decl_file   : 16
    <48d6>   DW_AT_decl_line   : 131
    <48d7>   DW_AT_decl_column : 12
    <48d8>   DW_AT_type        : <0x3ac4>
    <48dc>   DW_AT_data_member_location: 10
 <2><48dd>: Abbrev Number: 38 (DW_TAG_member)
    <48de>   DW_AT_name        : (indirect string, offset: 0x9f1): rd_stride
    <48e2>   DW_AT_decl_file   : 16
    <48e3>   DW_AT_decl_line   : 132
    <48e4>   DW_AT_decl_column : 12
    <48e5>   DW_AT_type        : <0x3ac4>
    <48e9>   DW_AT_data_member_location: 12
 <2><48ea>: Abbrev Number: 38 (DW_TAG_member)
    <48eb>   DW_AT_name        : (indirect string, offset: 0xcef): rd_flags
    <48ef>   DW_AT_decl_file   : 16
    <48f0>   DW_AT_decl_line   : 133
    <48f1>   DW_AT_decl_column : 12
    <48f2>   DW_AT_type        : <0x3ac4>
    <48f6>   DW_AT_data_member_location: 14
 <2><48f7>: Abbrev Number: 38 (DW_TAG_member)
    <48f8>   DW_AT_name        : (indirect string, offset: 0x1cc): rd_lrd_ptr_autoinc
    <48fc>   DW_AT_decl_file   : 16
    <48fd>   DW_AT_decl_line   : 134
    <48fe>   DW_AT_decl_column : 12
    <48ff>   DW_AT_type        : <0x3ac4>
    <4903>   DW_AT_data_member_location: 16
 <2><4904>: Abbrev Number: 38 (DW_TAG_member)
    <4905>   DW_AT_name        : (indirect string, offset: 0xf30): unused0
    <4909>   DW_AT_decl_file   : 16
    <490a>   DW_AT_decl_line   : 135
    <490b>   DW_AT_decl_column : 12
    <490c>   DW_AT_type        : <0x3ac4>
    <4910>   DW_AT_data_member_location: 18
 <2><4911>: Abbrev Number: 38 (DW_TAG_member)
    <4912>   DW_AT_name        : (indirect string, offset: 0x3bd): rd_queue_update_stride
    <4916>   DW_AT_decl_file   : 16
    <4917>   DW_AT_decl_line   : 136
    <4918>   DW_AT_decl_column : 12
    <4919>   DW_AT_type        : <0x3ac4>
    <491d>   DW_AT_data_member_location: 20
 <2><491e>: Abbrev Number: 38 (DW_TAG_member)
    <491f>   DW_AT_name        : (indirect string, offset: 0xf38): unused1
    <4923>   DW_AT_decl_file   : 16
    <4924>   DW_AT_decl_line   : 137
    <4925>   DW_AT_decl_column : 12
    <4926>   DW_AT_type        : <0x3ac4>
    <492a>   DW_AT_data_member_location: 22
 <2><492b>: Abbrev Number: 38 (DW_TAG_member)
    <492c>   DW_AT_name        : (indirect string, offset: 0xbff): dram_streaming_epoch_id
    <4930>   DW_AT_decl_file   : 16
    <4931>   DW_AT_decl_line   : 138
    <4932>   DW_AT_decl_column : 12
    <4933>   DW_AT_type        : <0x3ae1>
    <4937>   DW_AT_data_member_location: 24
 <2><4938>: Abbrev Number: 38 (DW_TAG_member)
    <4939>   DW_AT_name        : (indirect string, offset: 0xc9e): dram_streaming_tag
    <493d>   DW_AT_decl_file   : 16
    <493e>   DW_AT_decl_line   : 139
    <493f>   DW_AT_decl_column : 12
    <4940>   DW_AT_type        : <0x3ae1>
    <4944>   DW_AT_data_member_location: 28
 <2><4945>: Abbrev Number: 38 (DW_TAG_member)
    <4946>   DW_AT_name        : (indirect string, offset: 0x1525): wr_dram_rdptr
    <494a>   DW_AT_decl_file   : 16
    <494b>   DW_AT_decl_line   : 142
    <494c>   DW_AT_decl_column : 12
    <494d>   DW_AT_type        : <0x3ac4>
    <4951>   DW_AT_data_member_location: 32
 <2><4952>: Abbrev Number: 38 (DW_TAG_member)
    <4953>   DW_AT_name        : (indirect string, offset: 0x6b9): wr_grd_ptr_autoinc
    <4957>   DW_AT_decl_file   : 16
    <4958>   DW_AT_decl_line   : 143
    <4959>   DW_AT_decl_column : 12
    <495a>   DW_AT_type        : <0x3ac4>
    <495e>   DW_AT_data_member_location: 34
 <2><495f>: Abbrev Number: 38 (DW_TAG_member)
    <4960>   DW_AT_name        : (indirect string, offset: 0x2ed): wr_dram_wrptr
    <4964>   DW_AT_decl_file   : 16
    <4965>   DW_AT_decl_line   : 144
    <4966>   DW_AT_decl_column : 12
    <4967>   DW_AT_type        : <0x3ac4>
    <496b>   DW_AT_data_member_location: 36
 <2><496c>: Abbrev Number: 38 (DW_TAG_member)
    <496d>   DW_AT_name        : (indirect string, offset: 0x1c55): wr_gwr_ptr_autoinc
    <4971>   DW_AT_decl_file   : 16
    <4972>   DW_AT_decl_line   : 145
    <4973>   DW_AT_decl_column : 12
    <4974>   DW_AT_type        : <0x3ac4>
    <4978>   DW_AT_data_member_location: 38
 <2><4979>: Abbrev Number: 38 (DW_TAG_member)
    <497a>   DW_AT_name        : (indirect string, offset: 0x34a): wr_dram_local_rdptr
    <497e>   DW_AT_decl_file   : 16
    <497f>   DW_AT_decl_line   : 146
    <4980>   DW_AT_decl_column : 12
    <4981>   DW_AT_type        : <0x3ac4>
    <4985>   DW_AT_data_member_location: 40
 <2><4986>: Abbrev Number: 38 (DW_TAG_member)
    <4987>   DW_AT_name        : (indirect string, offset: 0xd0c): wr_epoch_id_tag
    <498b>   DW_AT_decl_file   : 16
    <498c>   DW_AT_decl_line   : 147
    <498d>   DW_AT_decl_column : 12
    <498e>   DW_AT_type        : <0x3ac4>
    <4992>   DW_AT_data_member_location: 42
 <2><4993>: Abbrev Number: 38 (DW_TAG_member)
    <4994>   DW_AT_name        : (indirect string, offset: 0x1707): wr_stride
    <4998>   DW_AT_decl_file   : 16
    <4999>   DW_AT_decl_line   : 148
    <499a>   DW_AT_decl_column : 12
    <499b>   DW_AT_type        : <0x3ac4>
    <499f>   DW_AT_data_member_location: 44
 <2><49a0>: Abbrev Number: 38 (DW_TAG_member)
    <49a1>   DW_AT_name        : (indirect string, offset: 0x16df): wr_flags
    <49a5>   DW_AT_decl_file   : 16
    <49a6>   DW_AT_decl_line   : 149
    <49a7>   DW_AT_decl_column : 12
    <49a8>   DW_AT_type        : <0x3ac4>
    <49ac>   DW_AT_data_member_location: 46
 <2><49ad>: Abbrev Number: 41 (DW_TAG_member)
    <49ae>   DW_AT_type        : <0x4826>
    <49b2>   DW_AT_data_member_location: 48
 <2><49b3>: Abbrev Number: 38 (DW_TAG_member)
    <49b4>   DW_AT_name        : (indirect string, offset: 0xdbc): data_chunk_size_bytes
    <49b8>   DW_AT_decl_file   : 16
    <49b9>   DW_AT_decl_line   : 162
    <49ba>   DW_AT_decl_column : 12
    <49bb>   DW_AT_type        : <0x3ae1>
    <49bf>   DW_AT_data_member_location: 56
 <2><49c0>: Abbrev Number: 38 (DW_TAG_member)
    <49c1>   DW_AT_name        : (indirect string, offset: 0x5ae): data_chunk_size_tiles
    <49c5>   DW_AT_decl_file   : 16
    <49c6>   DW_AT_decl_line   : 163
    <49c7>   DW_AT_decl_column : 12
    <49c8>   DW_AT_type        : <0x3ac4>
    <49cc>   DW_AT_data_member_location: 60
 <2><49cd>: Abbrev Number: 38 (DW_TAG_member)
    <49ce>   DW_AT_name        : (indirect string, offset: 0x118f): dram_padding
    <49d2>   DW_AT_decl_file   : 16
    <49d3>   DW_AT_decl_line   : 164
    <49d4>   DW_AT_decl_column : 11
    <49d5>   DW_AT_type        : <0x3aa7>
    <49d9>   DW_AT_data_member_location: 62
 <2><49da>: Abbrev Number: 38 (DW_TAG_member)
    <49db>   DW_AT_name        : (indirect string, offset: 0xf50): unused4
    <49df>   DW_AT_decl_file   : 16
    <49e0>   DW_AT_decl_line   : 165
    <49e1>   DW_AT_decl_column : 11
    <49e2>   DW_AT_type        : <0x3aa7>
    <49e6>   DW_AT_data_member_location: 63
 <2><49e7>: Abbrev Number: 38 (DW_TAG_member)
    <49e8>   DW_AT_name        : (indirect string, offset: 0xb5e): dram_buf_size_bytes
    <49ec>   DW_AT_decl_file   : 16
    <49ed>   DW_AT_decl_line   : 169
    <49ee>   DW_AT_decl_column : 12
    <49ef>   DW_AT_type        : <0x3ae1>
    <49f3>   DW_AT_data_member_location: 64
 <2><49f4>: Abbrev Number: 38 (DW_TAG_member)
    <49f5>   DW_AT_name        : (indirect string, offset: 0x73b): dram_buf_size_q_slots
    <49f9>   DW_AT_decl_file   : 16
    <49fa>   DW_AT_decl_line   : 170
    <49fb>   DW_AT_decl_column : 12
    <49fc>   DW_AT_type        : <0x3ae1>
    <4a00>   DW_AT_data_member_location: 68
 <2><4a01>: Abbrev Number: 38 (DW_TAG_member)
    <4a02>   DW_AT_name        : (indirect string, offset: 0x181e): dram_buf_addr
    <4a06>   DW_AT_decl_file   : 16
    <4a07>   DW_AT_decl_line   : 171
    <4a08>   DW_AT_decl_column : 15
    <4a09>   DW_AT_type        : <0x425e>
    <4a0d>   DW_AT_data_member_location: 72
 <2><4a0e>: Abbrev Number: 38 (DW_TAG_member)
    <4a0f>   DW_AT_name        : (indirect string, offset: 0x1b56): dram_q_slot_size_tiles
    <4a13>   DW_AT_decl_file   : 16
    <4a14>   DW_AT_decl_line   : 172
    <4a15>   DW_AT_decl_column : 12
    <4a16>   DW_AT_type        : <0x3ae1>
    <4a1a>   DW_AT_data_member_location: 80
 <2><4a1b>: Abbrev Number: 38 (DW_TAG_member)
    <4a1c>   DW_AT_name        : (indirect string, offset: 0xbb4): reader_index
    <4a20>   DW_AT_decl_file   : 16
    <4a21>   DW_AT_decl_line   : 173
    <4a22>   DW_AT_decl_column : 11
    <4a23>   DW_AT_type        : <0x3aa7>
    <4a27>   DW_AT_data_member_location: 84
 <2><4a28>: Abbrev Number: 38 (DW_TAG_member)
    <4a29>   DW_AT_name        : (indirect string, offset: 0x1963): total_readers
    <4a2d>   DW_AT_decl_file   : 16
    <4a2e>   DW_AT_decl_line   : 174
    <4a2f>   DW_AT_decl_column : 11
    <4a30>   DW_AT_type        : <0x3aa7>
    <4a34>   DW_AT_data_member_location: 85
 <2><4a35>: Abbrev Number: 38 (DW_TAG_member)
    <4a36>   DW_AT_name        : (indirect string, offset: 0x7e5): dram_decoupled
    <4a3a>   DW_AT_decl_file   : 16
    <4a3b>   DW_AT_decl_line   : 175
    <4a3c>   DW_AT_decl_column : 11
    <4a3d>   DW_AT_type        : <0x3aa7>
    <4a41>   DW_AT_data_member_location: 86
 <2><4a42>: Abbrev Number: 38 (DW_TAG_member)
    <4a43>   DW_AT_name        : (indirect string, offset: 0x5a3a): stride_wrap
    <4a47>   DW_AT_decl_file   : 16
    <4a48>   DW_AT_decl_line   : 178
    <4a49>   DW_AT_decl_column : 11
    <4a4a>   DW_AT_type        : <0x3aa7>
    <4a4e>   DW_AT_data_member_location: 87
 <2><4a4f>: Abbrev Number: 38 (DW_TAG_member)
    <4a50>   DW_AT_name        : (indirect string, offset: 0x1061): dram_io_scatter_state
    <4a54>   DW_AT_decl_file   : 16
    <4a55>   DW_AT_decl_line   : 179
    <4a56>   DW_AT_decl_column : 46
    <4a57>   DW_AT_type        : <0x4a6a>
    <4a5b>   DW_AT_data_member_location: 88
 <2><4a5c>: Abbrev Number: 38 (DW_TAG_member)
    <4a5d>   DW_AT_name        : (indirect string, offset: 0x2fb): next
    <4a61>   DW_AT_decl_file   : 16
    <4a62>   DW_AT_decl_line   : 180
    <4a63>   DW_AT_decl_column : 38
    <4a64>   DW_AT_type        : <0x4a70>
    <4a68>   DW_AT_data_member_location: 92
 <2><4a69>: Abbrev Number: 0
 <1><4a6a>: Abbrev Number: 39 (DW_TAG_pointer_type)
    <4a6b>   DW_AT_byte_size   : 4
    <4a6c>   DW_AT_type        : <0x479d>
 <1><4a70>: Abbrev Number: 39 (DW_TAG_pointer_type)
    <4a71>   DW_AT_byte_size   : 4
    <4a72>   DW_AT_type        : <0x4819>
 <1><4a76>: Abbrev Number: 2 (DW_TAG_typedef)
    <4a77>   DW_AT_name        : (indirect string, offset: 0xd1c): dram_io_state_t
    <4a7b>   DW_AT_decl_file   : 16
    <4a7c>   DW_AT_decl_line   : 183
    <4a7d>   DW_AT_decl_column : 32
    <4a7e>   DW_AT_type        : <0x4819>
 <1><4a82>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <4a83>   DW_AT_type        : <0x4a76>
 <1><4a87>: Abbrev Number: 42 (DW_TAG_structure_type)
    <4a88>   DW_AT_byte_size   : 32
    <4a89>   DW_AT_decl_file   : 16
    <4a8a>   DW_AT_decl_line   : 189
    <4a8b>   DW_AT_decl_column : 16
    <4a8c>   DW_AT_linkage_name: (indirect string, offset: 0x1b7e): 27epoch_stream_dram_io_info_t
    <4a90>   DW_AT_sibling     : <0x4b81>
 <2><4a94>: Abbrev Number: 40 (DW_TAG_union_type)
    <4a95>   DW_AT_byte_size   : 2
    <4a96>   DW_AT_decl_file   : 16
    <4a97>   DW_AT_decl_line   : 196
    <4a98>   DW_AT_decl_column : 8
    <4a99>   DW_AT_sibling     : <0x4ab6>
 <3><4a9d>: Abbrev Number: 43 (DW_TAG_member)
    <4a9e>   DW_AT_name        : (indirect string, offset: 0x1849): scatter_list_indicies_per_tile
    <4aa2>   DW_AT_decl_file   : 16
    <4aa3>   DW_AT_decl_line   : 197
    <4aa4>   DW_AT_decl_column : 14
    <4aa5>   DW_AT_type        : <0x3ac4>
 <3><4aa9>: Abbrev Number: 43 (DW_TAG_member)
    <4aaa>   DW_AT_name        : (indirect string, offset: 0x1943): c_dim_loop_num_rows
    <4aae>   DW_AT_decl_file   : 16
    <4aaf>   DW_AT_decl_line   : 198
    <4ab0>   DW_AT_decl_column : 14
    <4ab1>   DW_AT_type        : <0x3ac4>
 <3><4ab5>: Abbrev Number: 0
 <2><4ab6>: Abbrev Number: 40 (DW_TAG_union_type)
    <4ab7>   DW_AT_byte_size   : 4
    <4ab8>   DW_AT_decl_file   : 16
    <4ab9>   DW_AT_decl_line   : 200
    <4aba>   DW_AT_decl_column : 8
    <4abb>   DW_AT_sibling     : <0x4ad8>
 <3><4abf>: Abbrev Number: 43 (DW_TAG_member)
    <4ac0>   DW_AT_name        : (indirect string, offset: 0x5c4): scatter_list_indicies_per_input
    <4ac4>   DW_AT_decl_file   : 16
    <4ac5>   DW_AT_decl_line   : 201
    <4ac6>   DW_AT_decl_column : 14
    <4ac7>   DW_AT_type        : <0x3ae1>
 <3><4acb>: Abbrev Number: 43 (DW_TAG_member)
    <4acc>   DW_AT_name        : (indirect string, offset: 0x1092): tilize_row_col_offset
    <4ad0>   DW_AT_decl_file   : 16
    <4ad1>   DW_AT_decl_line   : 202
    <4ad2>   DW_AT_decl_column : 14
    <4ad3>   DW_AT_type        : <0x3ae1>
 <3><4ad7>: Abbrev Number: 0
 <2><4ad8>: Abbrev Number: 38 (DW_TAG_member)
    <4ad9>   DW_AT_name        : (indirect string, offset: 0x125e): dram_q_slot_size_bytes
    <4add>   DW_AT_decl_file   : 16
    <4ade>   DW_AT_decl_line   : 190
    <4adf>   DW_AT_decl_column : 12
    <4ae0>   DW_AT_type        : <0x3ae1>
    <4ae4>   DW_AT_data_member_location: 0
 <2><4ae5>: Abbrev Number: 38 (DW_TAG_member)
    <4ae6>   DW_AT_name        : (indirect string, offset: 0x16e8): input_noc
    <4aea>   DW_AT_decl_file   : 16
    <4aeb>   DW_AT_decl_line   : 191
    <4aec>   DW_AT_decl_column : 11
    <4aed>   DW_AT_type        : <0x3aa7>
    <4af1>   DW_AT_data_member_location: 4
 <2><4af2>: Abbrev Number: 38 (DW_TAG_member)
    <4af3>   DW_AT_name        : (indirect string, offset: 0x66b4): output_noc
    <4af7>   DW_AT_decl_file   : 16
    <4af8>   DW_AT_decl_line   : 192
    <4af9>   DW_AT_decl_column : 11
    <4afa>   DW_AT_type        : <0x3aa7>
    <4afe>   DW_AT_data_member_location: 5
 <2><4aff>: Abbrev Number: 38 (DW_TAG_member)
    <4b00>   DW_AT_name        : (indirect string, offset: 0x1764): dram_output_no_push
    <4b04>   DW_AT_decl_file   : 16
    <4b05>   DW_AT_decl_line   : 193
    <4b06>   DW_AT_decl_column : 11
    <4b07>   DW_AT_type        : <0x3aa7>
    <4b0b>   DW_AT_data_member_location: 6
 <2><4b0c>: Abbrev Number: 38 (DW_TAG_member)
    <4b0d>   DW_AT_name        : (indirect string, offset: 0x1b9c): has_multi_readers
    <4b11>   DW_AT_decl_file   : 16
    <4b12>   DW_AT_decl_line   : 194
    <4b13>   DW_AT_decl_column : 11
    <4b14>   DW_AT_type        : <0x3aa7>
    <4b18>   DW_AT_data_member_location: 7
 <2><4b19>: Abbrev Number: 38 (DW_TAG_member)
    <4b1a>   DW_AT_name        : (indirect string, offset: 0x54b): scatter_list_stream_id
    <4b1e>   DW_AT_decl_file   : 16
    <4b1f>   DW_AT_decl_line   : 195
    <4b20>   DW_AT_decl_column : 12
    <4b21>   DW_AT_type        : <0x3ac4>
    <4b25>   DW_AT_data_member_location: 8
 <2><4b26>: Abbrev Number: 41 (DW_TAG_member)
    <4b27>   DW_AT_type        : <0x4a94>
    <4b2b>   DW_AT_data_member_location: 10
 <2><4b2c>: Abbrev Number: 41 (DW_TAG_member)
    <4b2d>   DW_AT_type        : <0x4ab6>
    <4b31>   DW_AT_data_member_location: 12
 <2><4b32>: Abbrev Number: 38 (DW_TAG_member)
    <4b33>   DW_AT_name        : (indirect string, offset: 0x16a2): dram_embeddings_row_shift
    <4b37>   DW_AT_decl_file   : 16
    <4b38>   DW_AT_decl_line   : 204
    <4b39>   DW_AT_decl_column : 12
    <4b3a>   DW_AT_type        : <0x3ae1>
    <4b3e>   DW_AT_data_member_location: 16
 <2><4b3f>: Abbrev Number: 38 (DW_TAG_member)
    <4b40>   DW_AT_name        : (indirect string, offset: 0x7a4): epoch_q_slots_remaining
    <4b44>   DW_AT_decl_file   : 16
    <4b45>   DW_AT_decl_line   : 205
    <4b46>   DW_AT_decl_column : 12
    <4b47>   DW_AT_type        : <0x3ae1>
    <4b4b>   DW_AT_data_member_location: 20
 <2><4b4c>: Abbrev Number: 38 (DW_TAG_member)
    <4b4d>   DW_AT_name        : (indirect string, offset: 0x4d4): dram_embeddings_row_tiles
    <4b51>   DW_AT_decl_file   : 16
    <4b52>   DW_AT_decl_line   : 206
    <4b53>   DW_AT_decl_column : 12
    <4b54>   DW_AT_type        : <0x3ac4>
    <4b58>   DW_AT_data_member_location: 24
 <2><4b59>: Abbrev Number: 38 (DW_TAG_member)
    <4b5a>   DW_AT_name        : (indirect string, offset: 0x65bc): dram_writes_with_cmd_buf
    <4b5e>   DW_AT_decl_file   : 16
    <4b5f>   DW_AT_decl_line   : 207
    <4b60>   DW_AT_decl_column : 11
    <4b61>   DW_AT_type        : <0x3aa7>
    <4b65>   DW_AT_data_member_location: 26
 <2><4b66>: Abbrev Number: 38 (DW_TAG_member)
    <4b67>   DW_AT_name        : (indirect string, offset: 0x153d): hw_tilize
    <4b6b>   DW_AT_decl_file   : 16
    <4b6c>   DW_AT_decl_line   : 208
    <4b6d>   DW_AT_decl_column : 11
    <4b6e>   DW_AT_type        : <0x3aa7>
    <4b72>   DW_AT_data_member_location: 27
 <2><4b73>: Abbrev Number: 38 (DW_TAG_member)
    <4b74>   DW_AT_name        : (indirect string, offset: 0x12f5): dram_io_state
    <4b78>   DW_AT_decl_file   : 16
    <4b79>   DW_AT_decl_line   : 209
    <4b7a>   DW_AT_decl_column : 39
    <4b7b>   DW_AT_type        : <0x4b81>
    <4b7f>   DW_AT_data_member_location: 28
 <2><4b80>: Abbrev Number: 0
 <1><4b81>: Abbrev Number: 39 (DW_TAG_pointer_type)
    <4b82>   DW_AT_byte_size   : 4
    <4b83>   DW_AT_type        : <0x4a82>
 <1><4b87>: Abbrev Number: 2 (DW_TAG_typedef)
    <4b88>   DW_AT_name        : (indirect string, offset: 0x1b80): epoch_stream_dram_io_info_t
    <4b8c>   DW_AT_decl_file   : 16
    <4b8d>   DW_AT_decl_line   : 210
    <4b8e>   DW_AT_decl_column : 3
    <4b8f>   DW_AT_type        : <0x4a87>
 <1><4b93>: Abbrev Number: 42 (DW_TAG_structure_type)
    <4b94>   DW_AT_byte_size   : 160
    <4b95>   DW_AT_decl_file   : 16
    <4b96>   DW_AT_decl_line   : 216
    <4b97>   DW_AT_decl_column : 16
    <4b98>   DW_AT_linkage_name: (indirect string, offset: 0x839): 19epoch_stream_info_t
    <4b9c>   DW_AT_sibling     : <0x4ecd>
 <2><4ba0>: Abbrev Number: 40 (DW_TAG_union_type)
    <4ba1>   DW_AT_byte_size   : 4
    <4ba2>   DW_AT_decl_file   : 16
    <4ba3>   DW_AT_decl_line   : 247
    <4ba4>   DW_AT_decl_column : 8
    <4ba5>   DW_AT_sibling     : <0x4bc2>
 <3><4ba9>: Abbrev Number: 43 (DW_TAG_member)
    <4baa>   DW_AT_name        : (indirect string, offset: 0x864): skip_col_bytes
    <4bae>   DW_AT_decl_file   : 16
    <4baf>   DW_AT_decl_line   : 248
    <4bb0>   DW_AT_decl_column : 14
    <4bb1>   DW_AT_type        : <0x3ae1>
 <3><4bb5>: Abbrev Number: 43 (DW_TAG_member)
    <4bb6>   DW_AT_name        : (indirect string, offset: 0x1ae): pipe_scatter_output_loop_size
    <4bba>   DW_AT_decl_file   : 16
    <4bbb>   DW_AT_decl_line   : 249
    <4bbc>   DW_AT_decl_column : 14
    <4bbd>   DW_AT_type        : <0x3ae1>
 <3><4bc1>: Abbrev Number: 0
 <2><4bc2>: Abbrev Number: 40 (DW_TAG_union_type)
    <4bc3>   DW_AT_byte_size   : 4
    <4bc4>   DW_AT_decl_file   : 16
    <4bc5>   DW_AT_decl_line   : 251
    <4bc6>   DW_AT_decl_column : 8
    <4bc7>   DW_AT_sibling     : <0x4be4>
 <3><4bcb>: Abbrev Number: 43 (DW_TAG_member)
    <4bcc>   DW_AT_name        : (indirect string, offset: 0xab7): skip_col_tile_row_bytes
    <4bd0>   DW_AT_decl_file   : 16
    <4bd1>   DW_AT_decl_line   : 252
    <4bd2>   DW_AT_decl_column : 14
    <4bd3>   DW_AT_type        : <0x3ae1>
 <3><4bd7>: Abbrev Number: 43 (DW_TAG_member)
    <4bd8>   DW_AT_name        : (indirect string, offset: 0x1bc9): scatter_pipe_state
    <4bdc>   DW_AT_decl_file   : 16
    <4bdd>   DW_AT_decl_line   : 253
    <4bde>   DW_AT_decl_column : 38
    <4bdf>   DW_AT_type        : <0x4ecd>
 <3><4be3>: Abbrev Number: 0
 <2><4be4>: Abbrev Number: 40 (DW_TAG_union_type)
    <4be5>   DW_AT_byte_size   : 4
    <4be6>   DW_AT_decl_file   : 16
    <4be7>   DW_AT_decl_line   : 255
    <4be8>   DW_AT_decl_column : 8
    <4be9>   DW_AT_sibling     : <0x4c08>
 <3><4bed>: Abbrev Number: 44 (DW_TAG_member)
    <4bee>   DW_AT_name        : (indirect string, offset: 0x18e4): skip_col_row_bytes
    <4bf2>   DW_AT_decl_file   : 16
    <4bf3>   DW_AT_decl_line   : 256
    <4bf5>   DW_AT_decl_column : 14
    <4bf6>   DW_AT_type        : <0x3ae1>
 <3><4bfa>: Abbrev Number: 44 (DW_TAG_member)
    <4bfb>   DW_AT_name        : (indirect string, offset: 0xfcb): scatter_idx
    <4bff>   DW_AT_decl_file   : 16
    <4c00>   DW_AT_decl_line   : 257
    <4c02>   DW_AT_decl_column : 14
    <4c03>   DW_AT_type        : <0x3ae1>
 <3><4c07>: Abbrev Number: 0
 <2><4c08>: Abbrev Number: 45 (DW_TAG_union_type)
    <4c09>   DW_AT_byte_size   : 4
    <4c0a>   DW_AT_decl_file   : 16
    <4c0b>   DW_AT_decl_line   : 259
    <4c0d>   DW_AT_decl_column : 8
    <4c0e>   DW_AT_sibling     : <0x4c2d>
 <3><4c12>: Abbrev Number: 44 (DW_TAG_member)
    <4c13>   DW_AT_name        : (indirect string, offset: 0x18ac): skip_zcol_bytes
    <4c17>   DW_AT_decl_file   : 16
    <4c18>   DW_AT_decl_line   : 260
    <4c1a>   DW_AT_decl_column : 14
    <4c1b>   DW_AT_type        : <0x3ae1>
 <3><4c1f>: Abbrev Number: 44 (DW_TAG_member)
    <4c20>   DW_AT_name        : (indirect string, offset: 0x1924): pipe_scatter_output_loop_count
    <4c24>   DW_AT_decl_file   : 16
    <4c25>   DW_AT_decl_line   : 261
    <4c27>   DW_AT_decl_column : 14
    <4c28>   DW_AT_type        : <0x3ae1>
 <3><4c2c>: Abbrev Number: 0
 <2><4c2d>: Abbrev Number: 45 (DW_TAG_union_type)
    <4c2e>   DW_AT_byte_size   : 4
    <4c2f>   DW_AT_decl_file   : 16
    <4c30>   DW_AT_decl_line   : 263
    <4c32>   DW_AT_decl_column : 8
    <4c33>   DW_AT_sibling     : <0x4c52>
 <3><4c37>: Abbrev Number: 44 (DW_TAG_member)
    <4c38>   DW_AT_name        : (indirect string, offset: 0x131a): skip_col_zrow_bytes
    <4c3c>   DW_AT_decl_file   : 16
    <4c3d>   DW_AT_decl_line   : 264
    <4c3f>   DW_AT_decl_column : 14
    <4c40>   DW_AT_type        : <0x3ae1>
 <3><4c44>: Abbrev Number: 44 (DW_TAG_member)
    <4c45>   DW_AT_name        : (indirect string, offset: 0x138a): num_iter_tiles
    <4c49>   DW_AT_decl_file   : 16
    <4c4a>   DW_AT_decl_line   : 265
    <4c4c>   DW_AT_decl_column : 14
    <4c4d>   DW_AT_type        : <0x3ae1>
 <3><4c51>: Abbrev Number: 0
 <2><4c52>: Abbrev Number: 38 (DW_TAG_member)
    <4c53>   DW_AT_name        : (indirect string, offset: 0x31e7): stream_id
    <4c57>   DW_AT_decl_file   : 16
    <4c58>   DW_AT_decl_line   : 220
    <4c59>   DW_AT_decl_column : 12
    <4c5a>   DW_AT_type        : <0x3ac4>
    <4c5e>   DW_AT_data_member_location: 0
 <2><4c5f>: Abbrev Number: 38 (DW_TAG_member)
    <4c60>   DW_AT_name        : (indirect string, offset: 0xf14): producer_epoch_id
    <4c64>   DW_AT_decl_file   : 16
    <4c65>   DW_AT_decl_line   : 221
    <4c66>   DW_AT_decl_column : 12
    <4c67>   DW_AT_type        : <0x3ac4>
    <4c6b>   DW_AT_data_member_location: 2
 <2><4c6c>: Abbrev Number: 38 (DW_TAG_member)
    <4c6d>   DW_AT_name        : (indirect string, offset: 0x7bc): epoch_start_phase
    <4c71>   DW_AT_decl_file   : 16
    <4c72>   DW_AT_decl_line   : 222
    <4c73>   DW_AT_decl_column : 12
    <4c74>   DW_AT_type        : <0x3ac4>
    <4c78>   DW_AT_data_member_location: 4
 <2><4c79>: Abbrev Number: 38 (DW_TAG_member)
    <4c7a>   DW_AT_name        : (indirect string, offset: 0x104c): datacopy_stream_type
    <4c7e>   DW_AT_decl_file   : 16
    <4c7f>   DW_AT_decl_line   : 223
    <4c80>   DW_AT_decl_column : 26
    <4c81>   DW_AT_type        : <0x46b4>
    <4c85>   DW_AT_data_member_location: 6
 <2><4c86>: Abbrev Number: 38 (DW_TAG_member)
    <4c87>   DW_AT_name        : (indirect string, offset: 0x6e4): datacopy_stream_id
    <4c8b>   DW_AT_decl_file   : 16
    <4c8c>   DW_AT_decl_line   : 224
    <4c8d>   DW_AT_decl_column : 12
    <4c8e>   DW_AT_type        : <0x3aa7>
    <4c92>   DW_AT_data_member_location: 7
 <2><4c93>: Abbrev Number: 38 (DW_TAG_member)
    <4c94>   DW_AT_name        : (indirect string, offset: 0x1515): epoch_num_tiles
    <4c98>   DW_AT_decl_file   : 16
    <4c99>   DW_AT_decl_line   : 225
    <4c9a>   DW_AT_decl_column : 12
    <4c9b>   DW_AT_type        : <0x3ae1>
    <4c9f>   DW_AT_data_member_location: 8
 <2><4ca0>: Abbrev Number: 38 (DW_TAG_member)
    <4ca1>   DW_AT_name        : (indirect string, offset: 0xbc1): tile_size_words
    <4ca5>   DW_AT_decl_file   : 16
    <4ca6>   DW_AT_decl_line   : 226
    <4ca7>   DW_AT_decl_column : 12
    <4ca8>   DW_AT_type        : <0x3ae1>
    <4cac>   DW_AT_data_member_location: 12
 <2><4cad>: Abbrev Number: 38 (DW_TAG_member)
    <4cae>   DW_AT_name        : (indirect string, offset: 0x18bc): buf_size_tiles
    <4cb2>   DW_AT_decl_file   : 16
    <4cb3>   DW_AT_decl_line   : 227
    <4cb4>   DW_AT_decl_column : 12
    <4cb5>   DW_AT_type        : <0x3ae1>
    <4cb9>   DW_AT_data_member_location: 16
 <2><4cba>: Abbrev Number: 38 (DW_TAG_member)
    <4cbb>   DW_AT_name        : (indirect string, offset: 0x1a49): buf_full_size_bytes
    <4cbf>   DW_AT_decl_file   : 16
    <4cc0>   DW_AT_decl_line   : 228
    <4cc1>   DW_AT_decl_column : 12
    <4cc2>   DW_AT_type        : <0x3ae1>
    <4cc6>   DW_AT_data_member_location: 20
 <2><4cc7>: Abbrev Number: 38 (DW_TAG_member)
    <4cc8>   DW_AT_name        : (indirect string, offset: 0xe74): buf_base_addr
    <4ccc>   DW_AT_decl_file   : 16
    <4ccd>   DW_AT_decl_line   : 229
    <4cce>   DW_AT_decl_column : 12
    <4ccf>   DW_AT_type        : <0x3ae1>
    <4cd3>   DW_AT_data_member_location: 24
 <2><4cd4>: Abbrev Number: 38 (DW_TAG_member)
    <4cd5>   DW_AT_name        : (indirect string, offset: 0x36b7): num_msgs_in_block
    <4cd9>   DW_AT_decl_file   : 16
    <4cda>   DW_AT_decl_line   : 230
    <4cdb>   DW_AT_decl_column : 12
    <4cdc>   DW_AT_type        : <0x3ac4>
    <4ce0>   DW_AT_data_member_location: 28
 <2><4ce1>: Abbrev Number: 38 (DW_TAG_member)
    <4ce2>   DW_AT_name        : (indirect string, offset: 0x1157): start_phase_num_cfg_regs
    <4ce6>   DW_AT_decl_file   : 16
    <4ce7>   DW_AT_decl_line   : 231
    <4ce8>   DW_AT_decl_column : 11
    <4ce9>   DW_AT_type        : <0x3aa7>
    <4ced>   DW_AT_data_member_location: 30
 <2><4cee>: Abbrev Number: 38 (DW_TAG_member)
    <4cef>   DW_AT_name        : (indirect string, offset: 0x15f9): packer_operand
    <4cf3>   DW_AT_decl_file   : 16
    <4cf4>   DW_AT_decl_line   : 232
    <4cf5>   DW_AT_decl_column : 11
    <4cf6>   DW_AT_type        : <0x3aa7>
    <4cfa>   DW_AT_data_member_location: 31
 <2><4cfb>: Abbrev Number: 38 (DW_TAG_member)
    <4cfc>   DW_AT_name        : (indirect string, offset: 0x120f): msg_info_buf_start
    <4d00>   DW_AT_decl_file   : 16
    <4d01>   DW_AT_decl_line   : 233
    <4d02>   DW_AT_decl_column : 12
    <4d03>   DW_AT_type        : <0x3ae1>
    <4d07>   DW_AT_data_member_location: 32
 <2><4d08>: Abbrev Number: 38 (DW_TAG_member)
    <4d09>   DW_AT_name        : (indirect string, offset: 0xede): blob_start_addr
    <4d0d>   DW_AT_decl_file   : 16
    <4d0e>   DW_AT_decl_line   : 234
    <4d0f>   DW_AT_decl_column : 12
    <4d10>   DW_AT_type        : <0x3ae1>
    <4d14>   DW_AT_data_member_location: 36
 <2><4d15>: Abbrev Number: 38 (DW_TAG_member)
    <4d16>   DW_AT_name        : (indirect string, offset: 0x1671): blob_size
    <4d1a>   DW_AT_decl_file   : 16
    <4d1b>   DW_AT_decl_line   : 235
    <4d1c>   DW_AT_decl_column : 12
    <4d1d>   DW_AT_type        : <0x3ae1>
    <4d21>   DW_AT_data_member_location: 40
 <2><4d22>: Abbrev Number: 38 (DW_TAG_member)
    <4d23>   DW_AT_name        : (indirect string, offset: 0x10c1): num_iters_in_epoch
    <4d27>   DW_AT_decl_file   : 16
    <4d28>   DW_AT_decl_line   : 236
    <4d29>   DW_AT_decl_column : 12
    <4d2a>   DW_AT_type        : <0x3ae1>
    <4d2e>   DW_AT_data_member_location: 44
 <2><4d2f>: Abbrev Number: 38 (DW_TAG_member)
    <4d30>   DW_AT_name        : (indirect string, offset: 0x8ae): epoch_iters_remaining
    <4d34>   DW_AT_decl_file   : 16
    <4d35>   DW_AT_decl_line   : 237
    <4d36>   DW_AT_decl_column : 12
    <4d37>   DW_AT_type        : <0x3ae1>
    <4d3b>   DW_AT_data_member_location: 48
 <2><4d3c>: Abbrev Number: 38 (DW_TAG_member)
    <4d3d>   DW_AT_name        : (indirect string, offset: 0xdd2): num_scatter_inner_loop
    <4d41>   DW_AT_decl_file   : 16
    <4d42>   DW_AT_decl_line   : 238
    <4d43>   DW_AT_decl_column : 12
    <4d44>   DW_AT_type        : <0x3ae1>
    <4d48>   DW_AT_data_member_location: 52
 <2><4d49>: Abbrev Number: 38 (DW_TAG_member)
    <4d4a>   DW_AT_name        : (indirect string, offset: 0x1812): legacy_pack
    <4d4e>   DW_AT_decl_file   : 16
    <4d4f>   DW_AT_decl_line   : 239
    <4d50>   DW_AT_decl_column : 11
    <4d51>   DW_AT_type        : <0x3aa7>
    <4d55>   DW_AT_data_member_location: 56
 <2><4d56>: Abbrev Number: 38 (DW_TAG_member)
    <4d57>   DW_AT_name        : (indirect string, offset: 0x1a31): eth_remote_fw_stream_id
    <4d5b>   DW_AT_decl_file   : 16
    <4d5c>   DW_AT_decl_line   : 240
    <4d5d>   DW_AT_decl_column : 11
    <4d5e>   DW_AT_type        : <0x3aa7>
    <4d62>   DW_AT_data_member_location: 57
 <2><4d63>: Abbrev Number: 38 (DW_TAG_member)
    <4d64>   DW_AT_name        : (indirect string, offset: 0x84f): num_mblock_buffering
    <4d68>   DW_AT_decl_file   : 16
    <4d69>   DW_AT_decl_line   : 241
    <4d6a>   DW_AT_decl_column : 12
    <4d6b>   DW_AT_type        : <0x3ac4>
    <4d6f>   DW_AT_data_member_location: 58
 <2><4d70>: Abbrev Number: 38 (DW_TAG_member)
    <4d71>   DW_AT_name        : (indirect string, offset: 0xcf2): flags
    <4d75>   DW_AT_decl_file   : 16
    <4d76>   DW_AT_decl_line   : 243
    <4d77>   DW_AT_decl_column : 12
    <4d78>   DW_AT_type        : <0x3ae1>
    <4d7c>   DW_AT_data_member_location: 60
 <2><4d7d>: Abbrev Number: 38 (DW_TAG_member)
    <4d7e>   DW_AT_name        : (indirect string, offset: 0x9f4): stride
    <4d82>   DW_AT_decl_file   : 16
    <4d83>   DW_AT_decl_line   : 244
    <4d84>   DW_AT_decl_column : 12
    <4d85>   DW_AT_type        : <0x3ac4>
    <4d89>   DW_AT_data_member_location: 64
 <2><4d8a>: Abbrev Number: 38 (DW_TAG_member)
    <4d8b>   DW_AT_name        : (indirect string, offset: 0x1149): total_strides
    <4d8f>   DW_AT_decl_file   : 16
    <4d90>   DW_AT_decl_line   : 245
    <4d91>   DW_AT_decl_column : 12
    <4d92>   DW_AT_type        : <0x3ac4>
    <4d96>   DW_AT_data_member_location: 66
 <2><4d97>: Abbrev Number: 38 (DW_TAG_member)
    <4d98>   DW_AT_name        : (indirect string, offset: 0xc6c): stride_offset_size_bytes
    <4d9c>   DW_AT_decl_file   : 16
    <4d9d>   DW_AT_decl_line   : 246
    <4d9e>   DW_AT_decl_column : 12
    <4d9f>   DW_AT_type        : <0x3ae1>
    <4da3>   DW_AT_data_member_location: 68
 <2><4da4>: Abbrev Number: 41 (DW_TAG_member)
    <4da5>   DW_AT_type        : <0x4ba0>
    <4da9>   DW_AT_data_member_location: 72
 <2><4daa>: Abbrev Number: 41 (DW_TAG_member)
    <4dab>   DW_AT_type        : <0x4bc2>
    <4daf>   DW_AT_data_member_location: 76
 <2><4db0>: Abbrev Number: 41 (DW_TAG_member)
    <4db1>   DW_AT_type        : <0x4be4>
    <4db5>   DW_AT_data_member_location: 80
 <2><4db6>: Abbrev Number: 41 (DW_TAG_member)
    <4db7>   DW_AT_type        : <0x4c08>
    <4dbb>   DW_AT_data_member_location: 84
 <2><4dbc>: Abbrev Number: 41 (DW_TAG_member)
    <4dbd>   DW_AT_type        : <0x4c2d>
    <4dc1>   DW_AT_data_member_location: 88
 <2><4dc2>: Abbrev Number: 46 (DW_TAG_member)
    <4dc3>   DW_AT_name        : (indirect string, offset: 0x874): c_dim_size
    <4dc7>   DW_AT_decl_file   : 16
    <4dc8>   DW_AT_decl_line   : 267
    <4dca>   DW_AT_decl_column : 12
    <4dcb>   DW_AT_type        : <0x3ac4>
    <4dcf>   DW_AT_data_member_location: 92
 <2><4dd0>: Abbrev Number: 46 (DW_TAG_member)
    <4dd1>   DW_AT_name        : (indirect string, offset: 0x167c): r_dim_size
    <4dd5>   DW_AT_decl_file   : 16
    <4dd6>   DW_AT_decl_line   : 268
    <4dd8>   DW_AT_decl_column : 12
    <4dd9>   DW_AT_type        : <0x3ac4>
    <4ddd>   DW_AT_data_member_location: 94
 <2><4dde>: Abbrev Number: 46 (DW_TAG_member)
    <4ddf>   DW_AT_name        : (indirect string, offset: 0x873): zc_dim_size
    <4de3>   DW_AT_decl_file   : 16
    <4de4>   DW_AT_decl_line   : 269
    <4de6>   DW_AT_decl_column : 12
    <4de7>   DW_AT_type        : <0x3ac4>
    <4deb>   DW_AT_data_member_location: 96
 <2><4dec>: Abbrev Number: 46 (DW_TAG_member)
    <4ded>   DW_AT_name        : (indirect string, offset: 0x167b): zr_dim_size
    <4df1>   DW_AT_decl_file   : 16
    <4df2>   DW_AT_decl_line   : 270
    <4df4>   DW_AT_decl_column : 12
    <4df5>   DW_AT_type        : <0x3ac4>
    <4df9>   DW_AT_data_member_location: 98
 <2><4dfa>: Abbrev Number: 46 (DW_TAG_member)
    <4dfb>   DW_AT_name        : (indirect string, offset: 0x1170): unused0_fw
    <4dff>   DW_AT_decl_file   : 16
    <4e00>   DW_AT_decl_line   : 273
    <4e02>   DW_AT_decl_column : 12
    <4e03>   DW_AT_type        : <0x3ae1>
    <4e07>   DW_AT_data_member_location: 100
 <2><4e08>: Abbrev Number: 46 (DW_TAG_member)
    <4e09>   DW_AT_name        : (indirect string, offset: 0x6f7): unused1_fw
    <4e0d>   DW_AT_decl_file   : 16
    <4e0e>   DW_AT_decl_line   : 274
    <4e10>   DW_AT_decl_column : 12
    <4e11>   DW_AT_type        : <0x3ae1>
    <4e15>   DW_AT_data_member_location: 104
 <2><4e16>: Abbrev Number: 46 (DW_TAG_member)
    <4e17>   DW_AT_name        : (indirect string, offset: 0x158f): unused2_fw
    <4e1b>   DW_AT_decl_file   : 16
    <4e1c>   DW_AT_decl_line   : 275
    <4e1e>   DW_AT_decl_column : 12
    <4e1f>   DW_AT_type        : <0x3ae1>
    <4e23>   DW_AT_data_member_location: 108
 <2><4e24>: Abbrev Number: 46 (DW_TAG_member)
    <4e25>   DW_AT_name        : (indirect string, offset: 0x1490): unused3_fw
    <4e29>   DW_AT_decl_file   : 16
    <4e2a>   DW_AT_decl_line   : 276
    <4e2c>   DW_AT_decl_column : 12
    <4e2d>   DW_AT_type        : <0x3ae1>
    <4e31>   DW_AT_data_member_location: 112
 <2><4e32>: Abbrev Number: 46 (DW_TAG_member)
    <4e33>   DW_AT_name        : (indirect string, offset: 0x1a26): unused4_fw
    <4e37>   DW_AT_decl_file   : 16
    <4e38>   DW_AT_decl_line   : 277
    <4e3a>   DW_AT_decl_column : 12
    <4e3b>   DW_AT_type        : <0x3ae1>
    <4e3f>   DW_AT_data_member_location: 116
 <2><4e40>: Abbrev Number: 46 (DW_TAG_member)
    <4e41>   DW_AT_name        : (indirect string, offset: 0xe2d): unused5_fw
    <4e45>   DW_AT_decl_file   : 16
    <4e46>   DW_AT_decl_line   : 278
    <4e48>   DW_AT_decl_column : 12
    <4e49>   DW_AT_type        : <0x3ae1>
    <4e4d>   DW_AT_data_member_location: 120
 <2><4e4e>: Abbrev Number: 46 (DW_TAG_member)
    <4e4f>   DW_AT_name        : (indirect string, offset: 0x1a1b): unused6_fw
    <4e53>   DW_AT_decl_file   : 16
    <4e54>   DW_AT_decl_line   : 279
    <4e56>   DW_AT_decl_column : 12
    <4e57>   DW_AT_type        : <0x3ae1>
    <4e5b>   DW_AT_data_member_location: 124
 <2><4e5c>: Abbrev Number: 46 (DW_TAG_member)
    <4e5d>   DW_AT_name        : (indirect string, offset: 0x1275): unused7_fw
    <4e61>   DW_AT_decl_file   : 16
    <4e62>   DW_AT_decl_line   : 280
    <4e64>   DW_AT_decl_column : 12
    <4e65>   DW_AT_type        : <0x3ae1>
    <4e69>   DW_AT_data_member_location: 128
 <2><4e6a>: Abbrev Number: 46 (DW_TAG_member)
    <4e6b>   DW_AT_name        : (indirect string, offset: 0xad6): untilize_copy_iters
    <4e6f>   DW_AT_decl_file   : 16
    <4e70>   DW_AT_decl_line   : 282
    <4e72>   DW_AT_decl_column : 11
    <4e73>   DW_AT_type        : <0x3aa7>
    <4e77>   DW_AT_data_member_location: 132
 <2><4e78>: Abbrev Number: 46 (DW_TAG_member)
    <4e79>   DW_AT_name        : (indirect string, offset: 0xacf): log_2x_untilize_copy_iters
    <4e7d>   DW_AT_decl_file   : 16
    <4e7e>   DW_AT_decl_line   : 283
    <4e80>   DW_AT_decl_column : 11
    <4e81>   DW_AT_type        : <0x3aa7>
    <4e85>   DW_AT_data_member_location: 133
 <2><4e86>: Abbrev Number: 46 (DW_TAG_member)
    <4e87>   DW_AT_name        : (indirect string, offset: 0x1b07): num_dram_io_bufs
    <4e8b>   DW_AT_decl_file   : 16
    <4e8c>   DW_AT_decl_line   : 284
    <4e8e>   DW_AT_decl_column : 12
    <4e8f>   DW_AT_type        : <0x3ac4>
    <4e93>   DW_AT_data_member_location: 134
 <2><4e94>: Abbrev Number: 46 (DW_TAG_member)
    <4e95>   DW_AT_name        : (indirect string, offset: 0x155): dram_io_info
    <4e99>   DW_AT_decl_file   : 16
    <4e9a>   DW_AT_decl_line   : 285
    <4e9c>   DW_AT_decl_column : 43
    <4e9d>   DW_AT_type        : <0x4ed3>
    <4ea1>   DW_AT_data_member_location: 136
 <2><4ea2>: Abbrev Number: 46 (DW_TAG_member)
    <4ea3>   DW_AT_name        : (indirect string, offset: 0xaea): num_fork_streams
    <4ea7>   DW_AT_decl_file   : 16
    <4ea8>   DW_AT_decl_line   : 286
    <4eaa>   DW_AT_decl_column : 12
    <4eab>   DW_AT_type        : <0x3ac4>
    <4eaf>   DW_AT_data_member_location: 140
 <2><4eb0>: Abbrev Number: 46 (DW_TAG_member)
    <4eb1>   DW_AT_name        : (indirect string, offset: 0xeaa): scatter_order_size
    <4eb5>   DW_AT_decl_file   : 16
    <4eb6>   DW_AT_decl_line   : 287
    <4eb8>   DW_AT_decl_column : 12
    <4eb9>   DW_AT_type        : <0x3ac4>
    <4ebd>   DW_AT_data_member_location: 142
 <2><4ebe>: Abbrev Number: 46 (DW_TAG_member)
    <4ebf>   DW_AT_name        : (indirect string, offset: 0x368): fork_idxs
    <4ec3>   DW_AT_decl_file   : 16
    <4ec4>   DW_AT_decl_line   : 288
    <4ec6>   DW_AT_decl_column : 11
    <4ec7>   DW_AT_type        : <0x4ed9>
    <4ecb>   DW_AT_data_member_location: 144
 <2><4ecc>: Abbrev Number: 0
 <1><4ecd>: Abbrev Number: 39 (DW_TAG_pointer_type)
    <4ece>   DW_AT_byte_size   : 4
    <4ecf>   DW_AT_type        : <0x4791>
 <1><4ed3>: Abbrev Number: 39 (DW_TAG_pointer_type)
    <4ed4>   DW_AT_byte_size   : 4
    <4ed5>   DW_AT_type        : <0x4b87>
 <1><4ed9>: Abbrev Number: 13 (DW_TAG_array_type)
    <4eda>   DW_AT_type        : <0x3aa7>
    <4ede>   DW_AT_sibling     : <0x4ee9>
 <2><4ee2>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <4ee3>   DW_AT_type        : <0x3a8f>
    <4ee7>   DW_AT_upper_bound : 15
 <2><4ee8>: Abbrev Number: 0
 <1><4ee9>: Abbrev Number: 47 (DW_TAG_typedef)
    <4eea>   DW_AT_name        : (indirect string, offset: 0x83b): epoch_stream_info_t
    <4eee>   DW_AT_decl_file   : 16
    <4eef>   DW_AT_decl_line   : 290
    <4ef1>   DW_AT_decl_column : 3
    <4ef2>   DW_AT_type        : <0x4b93>
 <1><4ef6>: Abbrev Number: 48 (DW_TAG_structure_type)
    <4ef7>   DW_AT_byte_size   : 384
    <4ef9>   DW_AT_decl_file   : 16
    <4efa>   DW_AT_decl_line   : 296
    <4efc>   DW_AT_decl_column : 16
    <4efd>   DW_AT_linkage_name: (indirect string, offset: 0x89a): 17tile_clear_blob_t
    <4f01>   DW_AT_sibling     : <0x4f14>
 <2><4f05>: Abbrev Number: 46 (DW_TAG_member)
    <4f06>   DW_AT_name        : (indirect string, offset: 0xb53): blob_words
    <4f0a>   DW_AT_decl_file   : 16
    <4f0b>   DW_AT_decl_line   : 297
    <4f0d>   DW_AT_decl_column : 12
    <4f0e>   DW_AT_type        : <0x4f14>
    <4f12>   DW_AT_data_member_location: 0
 <2><4f13>: Abbrev Number: 0
 <1><4f14>: Abbrev Number: 13 (DW_TAG_array_type)
    <4f15>   DW_AT_type        : <0x3ae1>
    <4f19>   DW_AT_sibling     : <0x4f2a>
 <2><4f1d>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <4f1e>   DW_AT_type        : <0x3a8f>
    <4f22>   DW_AT_upper_bound : 15
 <2><4f23>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <4f24>   DW_AT_type        : <0x3a8f>
    <4f28>   DW_AT_upper_bound : 5
 <2><4f29>: Abbrev Number: 0
 <1><4f2a>: Abbrev Number: 47 (DW_TAG_typedef)
    <4f2b>   DW_AT_name        : (indirect string, offset: 0x89c): tile_clear_blob_t
    <4f2f>   DW_AT_decl_file   : 16
    <4f30>   DW_AT_decl_line   : 298
    <4f32>   DW_AT_decl_column : 3
    <4f33>   DW_AT_type        : <0x4ef6>
 <1><4f37>: Abbrev Number: 48 (DW_TAG_structure_type)
    <4f38>   DW_AT_byte_size   : 1056
    <4f3a>   DW_AT_decl_file   : 16
    <4f3b>   DW_AT_decl_line   : 300
    <4f3d>   DW_AT_decl_column : 16
    <4f3e>   DW_AT_linkage_name: (indirect string, offset: 0xfae): 7epoch_t
    <4f42>   DW_AT_sibling     : <0x511b>
 <2><4f46>: Abbrev Number: 46 (DW_TAG_member)
    <4f47>   DW_AT_name        : (indirect string, offset: 0xb20): num_inputs
    <4f4b>   DW_AT_decl_file   : 16
    <4f4c>   DW_AT_decl_line   : 302
    <4f4e>   DW_AT_decl_column : 12
    <4f4f>   DW_AT_type        : <0x3ae1>
    <4f53>   DW_AT_data_member_location: 0
 <2><4f54>: Abbrev Number: 46 (DW_TAG_member)
    <4f55>   DW_AT_name        : (indirect string, offset: 0x9d4): num_outputs
    <4f59>   DW_AT_decl_file   : 16
    <4f5a>   DW_AT_decl_line   : 303
    <4f5c>   DW_AT_decl_column : 12
    <4f5d>   DW_AT_type        : <0x3ae1>
    <4f61>   DW_AT_data_member_location: 4
 <2><4f62>: Abbrev Number: 46 (DW_TAG_member)
    <4f63>   DW_AT_name        : (indirect string, offset: 0x1502): num_active_streams
    <4f67>   DW_AT_decl_file   : 16
    <4f68>   DW_AT_decl_line   : 304
    <4f6a>   DW_AT_decl_column : 12
    <4f6b>   DW_AT_type        : <0x3ae1>
    <4f6f>   DW_AT_data_member_location: 8
 <2><4f70>: Abbrev Number: 46 (DW_TAG_member)
    <4f71>   DW_AT_name        : (indirect string, offset: 0x17bc): epoch_valid
    <4f75>   DW_AT_decl_file   : 16
    <4f76>   DW_AT_decl_line   : 306
    <4f78>   DW_AT_decl_column : 12
    <4f79>   DW_AT_type        : <0x3aa7>
    <4f7d>   DW_AT_data_member_location: 12
 <2><4f7e>: Abbrev Number: 46 (DW_TAG_member)
    <4f7f>   DW_AT_name        : (indirect string, offset: 0x539): all_streams_ready
    <4f83>   DW_AT_decl_file   : 16
    <4f84>   DW_AT_decl_line   : 307
    <4f86>   DW_AT_decl_column : 12
    <4f87>   DW_AT_type        : <0x3aa7>
    <4f8b>   DW_AT_data_member_location: 13
 <2><4f8c>: Abbrev Number: 46 (DW_TAG_member)
    <4f8d>   DW_AT_name        : (indirect string, offset: 0x1bf0): all_streams_and_kernels_done
    <4f91>   DW_AT_decl_file   : 16
    <4f92>   DW_AT_decl_line   : 308
    <4f94>   DW_AT_decl_column : 12
    <4f95>   DW_AT_type        : <0x3aa7>
    <4f99>   DW_AT_data_member_location: 14
 <2><4f9a>: Abbrev Number: 46 (DW_TAG_member)
    <4f9b>   DW_AT_name        : (indirect string, offset: 0xe82): end_program
    <4f9f>   DW_AT_decl_file   : 16
    <4fa0>   DW_AT_decl_line   : 309
    <4fa2>   DW_AT_decl_column : 12
    <4fa3>   DW_AT_type        : <0x3aa7>
    <4fa7>   DW_AT_data_member_location: 15
 <2><4fa8>: Abbrev Number: 46 (DW_TAG_member)
    <4fa9>   DW_AT_name        : (indirect string, offset: 0x795): num_tile_sizes
    <4fad>   DW_AT_decl_file   : 16
    <4fae>   DW_AT_decl_line   : 311
    <4fb0>   DW_AT_decl_column : 12
    <4fb1>   DW_AT_type        : <0x3ae1>
    <4fb5>   DW_AT_data_member_location: 16
 <2><4fb6>: Abbrev Number: 46 (DW_TAG_member)
    <4fb7>   DW_AT_name        : (indirect string, offset: 0xbc1): tile_size_words
    <4fbb>   DW_AT_decl_file   : 16
    <4fbc>   DW_AT_decl_line   : 312
    <4fbe>   DW_AT_decl_column : 12
    <4fbf>   DW_AT_type        : <0x511b>
    <4fc3>   DW_AT_data_member_location: 20
 <2><4fc4>: Abbrev Number: 46 (DW_TAG_member)
    <4fc5>   DW_AT_name        : (indirect string, offset: 0x1370): tile_size_header_buf_addr
    <4fc9>   DW_AT_decl_file   : 16
    <4fca>   DW_AT_decl_line   : 313
    <4fcc>   DW_AT_decl_column : 12
    <4fcd>   DW_AT_type        : <0x511b>
    <4fd1>   DW_AT_data_member_location: 52
 <2><4fd2>: Abbrev Number: 46 (DW_TAG_member)
    <4fd3>   DW_AT_name        : (indirect string, offset: 0xb24): inputs
    <4fd7>   DW_AT_decl_file   : 16
    <4fd8>   DW_AT_decl_line   : 315
    <4fda>   DW_AT_decl_column : 45
    <4fdb>   DW_AT_type        : <0x512b>
    <4fdf>   DW_AT_data_member_location: 84
 <2><4fe0>: Abbrev Number: 46 (DW_TAG_member)
    <4fe1>   DW_AT_name        : (indirect string, offset: 0x9d8): outputs
    <4fe5>   DW_AT_decl_file   : 16
    <4fe6>   DW_AT_decl_line   : 316
    <4fe8>   DW_AT_decl_column : 45
    <4fe9>   DW_AT_type        : <0x512b>
    <4fed>   DW_AT_data_member_location: 180
 <2><4fee>: Abbrev Number: 49 (DW_TAG_member)
    <4fef>   DW_AT_name        : (indirect string, offset: 0x1506): active_streams
    <4ff3>   DW_AT_decl_file   : 16
    <4ff4>   DW_AT_decl_line   : 317
    <4ff6>   DW_AT_decl_column : 45
    <4ff7>   DW_AT_type        : <0x5141>
    <4ffb>   DW_AT_data_member_location: 276
 <2><4ffd>: Abbrev Number: 49 (DW_TAG_member)
    <4ffe>   DW_AT_name        : (indirect string, offset: 0x1711): perf_dram_copy_req
    <5002>   DW_AT_decl_file   : 16
    <5003>   DW_AT_decl_line   : 319
    <5005>   DW_AT_decl_column : 12
    <5006>   DW_AT_type        : <0x45f0>
    <500a>   DW_AT_data_member_location: 532
 <2><500c>: Abbrev Number: 49 (DW_TAG_member)
    <500d>   DW_AT_name        : (indirect string, offset: 0x1442): perf_dram_copy_ack
    <5011>   DW_AT_decl_file   : 16
    <5012>   DW_AT_decl_line   : 320
    <5014>   DW_AT_decl_column : 12
    <5015>   DW_AT_type        : <0x45f0>
    <5019>   DW_AT_data_member_location: 552
 <2><501b>: Abbrev Number: 49 (DW_TAG_member)
    <501c>   DW_AT_name        : (indirect string, offset: 0xf00): perf_dram_addr
    <5020>   DW_AT_decl_file   : 16
    <5021>   DW_AT_decl_line   : 321
    <5023>   DW_AT_decl_column : 15
    <5024>   DW_AT_type        : <0x5151>
    <5028>   DW_AT_data_member_location: 572
 <2><502a>: Abbrev Number: 49 (DW_TAG_member)
    <502b>   DW_AT_name        : (indirect string, offset: 0x11b3): perf_req_max
    <502f>   DW_AT_decl_file   : 16
    <5030>   DW_AT_decl_line   : 322
    <5032>   DW_AT_decl_column : 12
    <5033>   DW_AT_type        : <0x3d67>
    <5037>   DW_AT_data_member_location: 612
 <2><5039>: Abbrev Number: 49 (DW_TAG_member)
    <503a>   DW_AT_name        : (indirect string, offset: 0xf38): unused1
    <503e>   DW_AT_decl_file   : 16
    <503f>   DW_AT_decl_line   : 323
    <5041>   DW_AT_decl_column : 12
    <5042>   DW_AT_type        : <0x3d67>
    <5046>   DW_AT_data_member_location: 622
 <2><5048>: Abbrev Number: 49 (DW_TAG_member)
    <5049>   DW_AT_name        : (indirect string, offset: 0x6cc): extra_dram_q_state_addr
    <504d>   DW_AT_decl_file   : 16
    <504e>   DW_AT_decl_line   : 324
    <5050>   DW_AT_decl_column : 12
    <5051>   DW_AT_type        : <0x3ae1>
    <5055>   DW_AT_data_member_location: 632
 <2><5057>: Abbrev Number: 49 (DW_TAG_member)
    <5058>   DW_AT_name        : (indirect string, offset: 0x320): ublock_rt
    <505c>   DW_AT_decl_file   : 16
    <505d>   DW_AT_decl_line   : 326
    <505f>   DW_AT_decl_column : 12
    <5060>   DW_AT_type        : <0x3ac4>
    <5064>   DW_AT_data_member_location: 636
 <2><5066>: Abbrev Number: 49 (DW_TAG_member)
    <5067>   DW_AT_name        : (indirect string, offset: 0x35e): ublock_ct
    <506b>   DW_AT_decl_file   : 16
    <506c>   DW_AT_decl_line   : 327
    <506e>   DW_AT_decl_column : 12
    <506f>   DW_AT_type        : <0x3ac4>
    <5073>   DW_AT_data_member_location: 638
 <2><5075>: Abbrev Number: 49 (DW_TAG_member)
    <5076>   DW_AT_name        : (indirect string, offset: 0x760): mblock_m
    <507a>   DW_AT_decl_file   : 16
    <507b>   DW_AT_decl_line   : 328
    <507d>   DW_AT_decl_column : 12
    <507e>   DW_AT_type        : <0x3ac4>
    <5082>   DW_AT_data_member_location: 640
 <2><5084>: Abbrev Number: 49 (DW_TAG_member)
    <5085>   DW_AT_name        : (indirect string, offset: 0x769): mblock_n
    <5089>   DW_AT_decl_file   : 16
    <508a>   DW_AT_decl_line   : 329
    <508c>   DW_AT_decl_column : 12
    <508d>   DW_AT_type        : <0x3ac4>
    <5091>   DW_AT_data_member_location: 642
 <2><5093>: Abbrev Number: 49 (DW_TAG_member)
    <5094>   DW_AT_name        : (indirect string, offset: 0x751): mblock_k
    <5098>   DW_AT_decl_file   : 16
    <5099>   DW_AT_decl_line   : 330
    <509b>   DW_AT_decl_column : 12
    <509c>   DW_AT_type        : <0x3ac4>
    <50a0>   DW_AT_data_member_location: 644
 <2><50a2>: Abbrev Number: 49 (DW_TAG_member)
    <50a3>   DW_AT_name        : (indirect string, offset: 0x931): has_eth_stream_trans
    <50a7>   DW_AT_decl_file   : 16
    <50a8>   DW_AT_decl_line   : 331
    <50aa>   DW_AT_decl_column : 12
    <50ab>   DW_AT_type        : <0x3aa7>
    <50af>   DW_AT_data_member_location: 646
 <2><50b1>: Abbrev Number: 49 (DW_TAG_member)
    <50b2>   DW_AT_name        : (indirect string, offset: 0x4ee): has_packer_mcast_opt
    <50b6>   DW_AT_decl_file   : 16
    <50b7>   DW_AT_decl_line   : 332
    <50b9>   DW_AT_decl_column : 12
    <50ba>   DW_AT_type        : <0x3aa7>
    <50be>   DW_AT_data_member_location: 647
 <2><50c0>: Abbrev Number: 49 (DW_TAG_member)
    <50c1>   DW_AT_name        : (indirect string, offset: 0x1b27): overlay_valid
    <50c5>   DW_AT_decl_file   : 16
    <50c6>   DW_AT_decl_line   : 334
    <50c8>   DW_AT_decl_column : 12
    <50c9>   DW_AT_type        : <0x3ac4>
    <50cd>   DW_AT_data_member_location: 648
 <2><50cf>: Abbrev Number: 49 (DW_TAG_member)
    <50d0>   DW_AT_name        : (indirect string, offset: 0x88d): skip_kernels
    <50d4>   DW_AT_decl_file   : 16
    <50d5>   DW_AT_decl_line   : 335
    <50d7>   DW_AT_decl_column : 12
    <50d8>   DW_AT_type        : <0x3ac4>
    <50dc>   DW_AT_data_member_location: 650
 <2><50de>: Abbrev Number: 49 (DW_TAG_member)
    <50df>   DW_AT_name        : (indirect string, offset: 0x25f9): epoch_id
    <50e3>   DW_AT_decl_file   : 16
    <50e4>   DW_AT_decl_line   : 336
    <50e6>   DW_AT_decl_column : 12
    <50e7>   DW_AT_type        : <0x3ae1>
    <50eb>   DW_AT_data_member_location: 652
 <2><50ed>: Abbrev Number: 49 (DW_TAG_member)
    <50ee>   DW_AT_name        : (indirect string, offset: 0xbd1): tile_clear_blob
    <50f2>   DW_AT_decl_file   : 16
    <50f3>   DW_AT_decl_line   : 337
    <50f5>   DW_AT_decl_column : 21
    <50f6>   DW_AT_type        : <0x4f2a>
    <50fa>   DW_AT_data_member_location: 656
 <2><50fc>: Abbrev Number: 49 (DW_TAG_member)
    <50fd>   DW_AT_name        : (indirect string, offset: 0x702): dummy_phase_tile_header_and_data
    <5101>   DW_AT_decl_file   : 16
    <5102>   DW_AT_decl_line   : 338
    <5104>   DW_AT_decl_column : 12
    <5105>   DW_AT_type        : <0x5161>
    <5109>   DW_AT_data_member_location: 1040
 <2><510b>: Abbrev Number: 49 (DW_TAG_member)
    <510c>   DW_AT_name        : (indirect string, offset: 0x1104): overlay_blob_extra_size
    <5110>   DW_AT_decl_file   : 16
    <5111>   DW_AT_decl_line   : 339
    <5113>   DW_AT_decl_column : 12
    <5114>   DW_AT_type        : <0x3ae1>
    <5118>   DW_AT_data_member_location: 1052
 <2><511a>: Abbrev Number: 0
 <1><511b>: Abbrev Number: 13 (DW_TAG_array_type)
    <511c>   DW_AT_type        : <0x3ae1>
    <5120>   DW_AT_sibling     : <0x512b>
 <2><5124>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <5125>   DW_AT_type        : <0x3a8f>
    <5129>   DW_AT_upper_bound : 7
 <2><512a>: Abbrev Number: 0
 <1><512b>: Abbrev Number: 13 (DW_TAG_array_type)
    <512c>   DW_AT_type        : <0x513b>
    <5130>   DW_AT_sibling     : <0x513b>
 <2><5134>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <5135>   DW_AT_type        : <0x3a8f>
    <5139>   DW_AT_upper_bound : 23
 <2><513a>: Abbrev Number: 0
 <1><513b>: Abbrev Number: 39 (DW_TAG_pointer_type)
    <513c>   DW_AT_byte_size   : 4
    <513d>   DW_AT_type        : <0x4ee9>
 <1><5141>: Abbrev Number: 13 (DW_TAG_array_type)
    <5142>   DW_AT_type        : <0x513b>
    <5146>   DW_AT_sibling     : <0x5151>
 <2><514a>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <514b>   DW_AT_type        : <0x3a8f>
    <514f>   DW_AT_upper_bound : 63
 <2><5150>: Abbrev Number: 0
 <1><5151>: Abbrev Number: 13 (DW_TAG_array_type)
    <5152>   DW_AT_type        : <0x425e>
    <5156>   DW_AT_sibling     : <0x5161>
 <2><515a>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <515b>   DW_AT_type        : <0x3a8f>
    <515f>   DW_AT_upper_bound : 4
 <2><5160>: Abbrev Number: 0
 <1><5161>: Abbrev Number: 13 (DW_TAG_array_type)
    <5162>   DW_AT_type        : <0x3ae1>
    <5166>   DW_AT_sibling     : <0x5171>
 <2><516a>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <516b>   DW_AT_type        : <0x3a8f>
    <516f>   DW_AT_upper_bound : 2
 <2><5170>: Abbrev Number: 0
 <1><5171>: Abbrev Number: 47 (DW_TAG_typedef)
    <5172>   DW_AT_name        : (indirect string, offset: 0xfaf): epoch_t
    <5176>   DW_AT_decl_file   : 16
    <5177>   DW_AT_decl_line   : 341
    <5179>   DW_AT_decl_column : 3
    <517a>   DW_AT_type        : <0x4f37>
 <1><517e>: Abbrev Number: 25 (DW_TAG_variable)
    <517f>   DW_AT_name        : (indirect string, offset: 0xa46): TILE_CLEAR_STREAM_ID
    <5183>   DW_AT_decl_file   : 17
