Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0xabe6 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x11): GNU GIMPLE 10.2.0 -mabi=ilp32 -march=rv32imw -mtune=rvtt-b1 -march=rv32imw -mabi=ilp32 -march=rv32imw -mtune=rvtt-b1 -march=rv32imw -march=rv32imw -march=rv32imw -march=rv32imw -march=rv32imw -mwormhole -g -g -Os -Os -fno-openmp -fno-openacc -fno-pie -ffast-math -fno-tree-loop-distribute-patterns -fno-delete-null-pointer-checks -frvtt-error-multdiv -fltrans
    <10>   DW_AT_language    : 4	(C++)
    <11>   DW_AT_name        : (indirect string, offset: 0x1b2): <artificial>
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x7a60): /proj_sw/user_dev/jnie/budabackend/src/firmware/riscv/targets/ncrisc
    <19>   DW_AT_ranges      : 0x4020
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
 <1><25>: Abbrev Number: 2 (DW_TAG_base_type)
    <26>   DW_AT_byte_size   : 8
    <27>   DW_AT_encoding    : 7	(unsigned)
    <28>   DW_AT_name        : (indirect string, offset: 0x18d): long long unsigned int
 <1><2c>: Abbrev Number: 2 (DW_TAG_base_type)
    <2d>   DW_AT_byte_size   : 4
    <2e>   DW_AT_encoding    : 7	(unsigned)
    <2f>   DW_AT_name        : (indirect string, offset: 0x197): unsigned int
 <1><33>: Abbrev Number: 2 (DW_TAG_base_type)
    <34>   DW_AT_byte_size   : 1

    <add0>   DW_AT_name        : (indirect string, offset: 0x20c2): intmax_t
    <add4>   DW_AT_decl_file   : 2
    <add5>   DW_AT_decl_line   : 67
    <add6>   DW_AT_decl_column : 20
    <add7>   DW_AT_type        : <0xacff>
 <1><addb>: Abbrev Number: 2 (DW_TAG_typedef)
    <addc>   DW_AT_name        : (indirect string, offset: 0xb0f): uintmax_t
    <ade0>   DW_AT_decl_file   : 2
    <ade1>   DW_AT_decl_line   : 72
    <ade2>   DW_AT_decl_column : 21
    <ade3>   DW_AT_type        : <0xad0b>
 <1><ade7>: Abbrev Number: 2 (DW_TAG_typedef)
    <ade8>   DW_AT_name        : (indirect string, offset: 0xc65): intptr_t
    <adec>   DW_AT_decl_file   : 2
    <aded>   DW_AT_decl_line   : 77
    <adee>   DW_AT_decl_column : 20
    <adef>   DW_AT_type        : <0xad17>
 <1><adf3>: Abbrev Number: 2 (DW_TAG_typedef)
    <adf4>   DW_AT_name        : (indirect string, offset: 0x212d): uintptr_t
    <adf8>   DW_AT_decl_file   : 2
    <adf9>   DW_AT_decl_line   : 82
    <adfa>   DW_AT_decl_column : 21
    <adfb>   DW_AT_type        : <0xad2f>
 <1><adff>: Abbrev Number: 2 (DW_TAG_typedef)
    <ae00>   DW_AT_name        : (indirect string, offset: 0x1132): int_least8_t
    <ae04>   DW_AT_decl_file   : 3
    <ae05>   DW_AT_decl_line   : 21
    <ae06>   DW_AT_decl_column : 24
    <ae07>   DW_AT_type        : <0xac9f>
 <1><ae0b>: Abbrev Number: 2 (DW_TAG_typedef)
    <ae0c>   DW_AT_name        : (indirect string, offset: 0x1de7): uint_least8_t
    <ae10>   DW_AT_decl_file   : 3
    <ae11>   DW_AT_decl_line   : 22
    <ae12>   DW_AT_decl_column : 25
    <ae13>   DW_AT_type        : <0xacab>
 <1><ae17>: Abbrev Number: 2 (DW_TAG_typedef)
    <ae18>   DW_AT_name        : (indirect string, offset: 0x2488): int_least16_t
    <ae1c>   DW_AT_decl_file   : 3
    <ae1d>   DW_AT_decl_line   : 27
    <ae1e>   DW_AT_decl_column : 25
    <ae1f>   DW_AT_type        : <0xacb7>
 <1><ae23>: Abbrev Number: 2 (DW_TAG_typedef)
    <ae24>   DW_AT_name        : (indirect string, offset: 0x1c42): uint_least16_t
    <ae28>   DW_AT_decl_file   : 3
    <ae29>   DW_AT_decl_line   : 28
    <ae2a>   DW_AT_decl_column : 26
    <ae2b>   DW_AT_type        : <0xacc3>
 <1><ae2f>: Abbrev Number: 2 (DW_TAG_typedef)
    <ae30>   DW_AT_name        : (indirect string, offset: 0x13a7): int_least32_t
    <ae34>   DW_AT_decl_file   : 3
    <ae35>   DW_AT_decl_line   : 33
    <ae36>   DW_AT_decl_column : 25
    <ae37>   DW_AT_type        : <0xaccf>
 <1><ae3b>: Abbrev Number: 2 (DW_TAG_typedef)
    <ae3c>   DW_AT_name        : (indirect string, offset: 0x853): uint_least32_t
    <ae40>   DW_AT_decl_file   : 3
    <ae41>   DW_AT_decl_line   : 34
    <ae42>   DW_AT_decl_column : 26
    <ae43>   DW_AT_type        : <0xacdb>
 <1><ae47>: Abbrev Number: 2 (DW_TAG_typedef)
    <ae48>   DW_AT_name        : (indirect string, offset: 0x279): int_least64_t
    <ae4c>   DW_AT_decl_file   : 3
    <ae4d>   DW_AT_decl_line   : 39
    <ae4e>   DW_AT_decl_column : 25
    <ae4f>   DW_AT_type        : <0xace7>
 <1><ae53>: Abbrev Number: 2 (DW_TAG_typedef)
    <ae54>   DW_AT_name        : (indirect string, offset: 0x23b4): uint_least64_t
    <ae58>   DW_AT_decl_file   : 3
    <ae59>   DW_AT_decl_line   : 40
    <ae5a>   DW_AT_decl_column : 26
    <ae5b>   DW_AT_type        : <0xacf3>
 <1><ae5f>: Abbrev Number: 2 (DW_TAG_typedef)
    <ae60>   DW_AT_name        : (indirect string, offset: 0x2ea7): int_fast8_t
    <ae64>   DW_AT_decl_file   : 3
    <ae65>   DW_AT_decl_line   : 51
    <ae66>   DW_AT_decl_column : 30
    <ae67>   DW_AT_type        : <0xad23>
 <1><ae6b>: Abbrev Number: 2 (DW_TAG_typedef)
    <ae6c>   DW_AT_name        : (indirect string, offset: 0x2ea6): uint_fast8_t
    <ae70>   DW_AT_decl_file   : 3
    <ae71>   DW_AT_decl_line   : 52
    <ae72>   DW_AT_decl_column : 31
    <ae73>   DW_AT_type        : <0xad3b>
 <1><ae77>: Abbrev Number: 2 (DW_TAG_typedef)
    <ae78>   DW_AT_name        : (indirect string, offset: 0x19a9): int_fast16_t
    <ae7c>   DW_AT_decl_file   : 3
    <ae7d>   DW_AT_decl_line   : 61
    <ae7e>   DW_AT_decl_column : 31
    <ae7f>   DW_AT_type        : <0xad23>
 <1><ae83>: Abbrev Number: 2 (DW_TAG_typedef)
    <ae84>   DW_AT_name        : (indirect string, offset: 0x19a8): uint_fast16_t
    <ae88>   DW_AT_decl_file   : 3
    <ae89>   DW_AT_decl_line   : 62
    <ae8a>   DW_AT_decl_column : 32
    <ae8b>   DW_AT_type        : <0xad3b>
 <1><ae8f>: Abbrev Number: 2 (DW_TAG_typedef)
    <ae90>   DW_AT_name        : (indirect string, offset: 0x5cf): int_fast32_t
    <ae94>   DW_AT_decl_file   : 3
    <ae95>   DW_AT_decl_line   : 71
    <ae96>   DW_AT_decl_column : 31
    <ae97>   DW_AT_type        : <0xad23>
 <1><ae9b>: Abbrev Number: 2 (DW_TAG_typedef)
    <ae9c>   DW_AT_name        : (indirect string, offset: 0x5ce): uint_fast32_t
    <aea0>   DW_AT_decl_file   : 3
    <aea1>   DW_AT_decl_line   : 72
    <aea2>   DW_AT_decl_column : 32
    <aea3>   DW_AT_type        : <0xad3b>
 <1><aea7>: Abbrev Number: 2 (DW_TAG_typedef)
    <aea8>   DW_AT_name        : (indirect string, offset: 0x21f4): int_fast64_t
    <aeac>   DW_AT_decl_file   : 3
    <aead>   DW_AT_decl_line   : 81
    <aeae>   DW_AT_decl_column : 31
    <aeaf>   DW_AT_type        : <0xac85>
 <1><aeb3>: Abbrev Number: 2 (DW_TAG_typedef)
    <aeb4>   DW_AT_name        : (indirect string, offset: 0x21f3): uint_fast64_t
    <aeb8>   DW_AT_decl_file   : 3
    <aeb9>   DW_AT_decl_line   : 82
    <aeba>   DW_AT_decl_column : 32
    <aebb>   DW_AT_type        : <0xac98>
 <1><aebf>: Abbrev Number: 7 (DW_TAG_structure_type)
    <aec0>   DW_AT_name        : (indirect string, offset: 0x1e1d): active_stream_info_t
    <aec4>   DW_AT_byte_size   : 4
    <aec5>   DW_AT_decl_file   : 4
    <aec6>   DW_AT_decl_line   : 8
    <aec7>   DW_AT_decl_column : 16
    <aec8>   DW_AT_sibling     : <0xaef4>
 <2><aecc>: Abbrev Number: 8 (DW_TAG_member)
    <aecd>   DW_AT_name        : (indirect string, offset: 0x210c): stream_id
    <aed1>   DW_AT_decl_file   : 4
    <aed2>   DW_AT_decl_line   : 9
    <aed3>   DW_AT_decl_column : 12
    <aed4>   DW_AT_type        : <0xad53>
    <aed8>   DW_AT_data_member_location: 0
 <2><aed9>: Abbrev Number: 8 (DW_TAG_member)
    <aeda>   DW_AT_name        : (indirect string, offset: 0xf92): unused0
    <aede>   DW_AT_decl_file   : 4
    <aedf>   DW_AT_decl_line   : 10
    <aee0>   DW_AT_decl_column : 12
    <aee1>   DW_AT_type        : <0xad53>
    <aee5>   DW_AT_data_member_location: 1
 <2><aee6>: Abbrev Number: 8 (DW_TAG_member)
    <aee7>   DW_AT_name        : (indirect string, offset: 0x29b1): flags
    <aeeb>   DW_AT_decl_file   : 4
    <aeec>   DW_AT_decl_line   : 11
    <aeed>   DW_AT_decl_column : 12
    <aeee>   DW_AT_type        : <0xad75>
    <aef2>   DW_AT_data_member_location: 2
 <2><aef3>: Abbrev Number: 0
 <1><aef4>: Abbrev Number: 2 (DW_TAG_typedef)
    <aef5>   DW_AT_name        : (indirect string, offset: 0x1e1d): active_stream_info_t
    <aef9>   DW_AT_decl_file   : 4
    <aefa>   DW_AT_decl_line   : 12
    <aefb>   DW_AT_decl_column : 3
    <aefc>   DW_AT_type        : <0xaebf>
 <1><af00>: Abbrev Number: 9 (DW_TAG_namespace)
    <af01>   DW_AT_name        : std
    <af05>   DW_AT_decl_file   : 29
    <af06>   DW_AT_decl_line   : 0
    <af07>   DW_AT_sibling     : <0xb100>
 <2><af0b>: Abbrev Number: 10 (DW_TAG_namespace)
    <af0c>   DW_AT_name        : (indirect string, offset: 0x2e92): __cxx11
    <af10>   DW_AT_decl_file   : 8
    <af11>   DW_AT_decl_line   : 282
    <af13>   DW_AT_decl_column : 65
    <af14>   DW_AT_export_symbols: 1
 <2><af14>: Abbrev Number: 11 (DW_TAG_imported_module)
    <af15>   DW_AT_decl_file   : 8
    <af16>   DW_AT_decl_line   : 282
    <af18>   DW_AT_decl_column : 65
    <af19>   DW_AT_import      : <0xaf0b>	[Abbrev Number: 10 (DW_TAG_namespace)]
 <2><af1d>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <af1e>   DW_AT_decl_file   : 5
    <af1f>   DW_AT_decl_line   : 47
    <af20>   DW_AT_decl_column : 11
    <af21>   DW_AT_import      : <0xad47>	[Abbrev Number: 2 (DW_TAG_typedef)]
 <2><af25>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <af26>   DW_AT_decl_file   : 5
    <af27>   DW_AT_decl_line   : 48
    <af28>   DW_AT_decl_column : 11
    <af29>   DW_AT_import      : <0xad69>	[Abbrev Number: 2 (DW_TAG_typedef)]
 <2><af2d>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <af2e>   DW_AT_decl_file   : 5
    <af2f>   DW_AT_decl_line   : 49
    <af30>   DW_AT_decl_column : 11
    <af31>   DW_AT_import      : <0xad86>	[Abbrev Number: 2 (DW_TAG_typedef)]
 <2><af35>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <af36>   DW_AT_decl_file   : 5
    <af37>   DW_AT_decl_line   : 50
    <af38>   DW_AT_decl_column : 11
    <af39>   DW_AT_import      : <0xadad>	[Abbrev Number: 2 (DW_TAG_typedef)]
 <2><af3d>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <af3e>   DW_AT_decl_file   : 5
    <af3f>   DW_AT_decl_line   : 52
    <af40>   DW_AT_decl_column : 11
    <af41>   DW_AT_import      : <0xae5f>	[Abbrev Number: 2 (DW_TAG_typedef)]
 <2><af45>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <af46>   DW_AT_decl_file   : 5
    <af47>   DW_AT_decl_line   : 53
    <af48>   DW_AT_decl_column : 11
    <af49>   DW_AT_import      : <0xae77>	[Abbrev Number: 2 (DW_TAG_typedef)]
 <2><af4d>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <af4e>   DW_AT_decl_file   : 5
    <af4f>   DW_AT_decl_line   : 54
    <af50>   DW_AT_decl_column : 11
    <af51>   DW_AT_import      : <0xae8f>	[Abbrev Number: 2 (DW_TAG_typedef)]
 <2><af55>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <af56>   DW_AT_decl_file   : 5
    <af57>   DW_AT_decl_line   : 55
    <af58>   DW_AT_decl_column : 11
    <af59>   DW_AT_import      : <0xaea7>	[Abbrev Number: 2 (DW_TAG_typedef)]
 <2><af5d>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <af5e>   DW_AT_decl_file   : 5
    <af5f>   DW_AT_decl_line   : 57
    <af60>   DW_AT_decl_column : 11
    <af61>   DW_AT_import      : <0xadff>	[Abbrev Number: 2 (DW_TAG_typedef)]
 <2><af65>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <af66>   DW_AT_decl_file   : 5
    <af67>   DW_AT_decl_line   : 58
    <af68>   DW_AT_decl_column : 11
    <af69>   DW_AT_import      : <0xae17>	[Abbrev Number: 2 (DW_TAG_typedef)]
 <2><af6d>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <af6e>   DW_AT_decl_file   : 5
    <af6f>   DW_AT_decl_line   : 59
    <af70>   DW_AT_decl_column : 11
    <af71>   DW_AT_import      : <0xae2f>	[Abbrev Number: 2 (DW_TAG_typedef)]
 <2><af75>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <af76>   DW_AT_decl_file   : 5
    <af77>   DW_AT_decl_line   : 60
    <af78>   DW_AT_decl_column : 11
    <af79>   DW_AT_import      : <0xae47>	[Abbrev Number: 2 (DW_TAG_typedef)]
 <2><af7d>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <af7e>   DW_AT_decl_file   : 5
    <af7f>   DW_AT_decl_line   : 62
    <af80>   DW_AT_decl_column : 11
    <af81>   DW_AT_import      : <0xadcf>	[Abbrev Number: 2 (DW_TAG_typedef)]
 <2><af85>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <af86>   DW_AT_decl_file   : 5
    <af87>   DW_AT_decl_line   : 63
    <af88>   DW_AT_decl_column : 11
    <af89>   DW_AT_import      : <0xade7>	[Abbrev Number: 2 (DW_TAG_typedef)]
 <2><af8d>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <af8e>   DW_AT_decl_file   : 5
    <af8f>   DW_AT_decl_line   : 65
    <af90>   DW_AT_decl_column : 11
    <af91>   DW_AT_import      : <0xad53>	[Abbrev Number: 2 (DW_TAG_typedef)]
 <2><af95>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <af96>   DW_AT_decl_file   : 5
    <af97>   DW_AT_decl_line   : 66
    <af98>   DW_AT_decl_column : 11
    <af99>   DW_AT_import      : <0xad75>	[Abbrev Number: 2 (DW_TAG_typedef)]
 <2><af9d>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <af9e>   DW_AT_decl_file   : 5
    <af9f>   DW_AT_decl_line   : 67
    <afa0>   DW_AT_decl_column : 11
    <afa1>   DW_AT_import      : <0xad97>	[Abbrev Number: 2 (DW_TAG_typedef)]
 <2><afa5>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <afa6>   DW_AT_decl_file   : 5
    <afa7>   DW_AT_decl_line   : 68
    <afa8>   DW_AT_decl_column : 11
    <afa9>   DW_AT_import      : <0xadb9>	[Abbrev Number: 2 (DW_TAG_typedef)]
 <2><afad>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <afae>   DW_AT_decl_file   : 5
    <afaf>   DW_AT_decl_line   : 70
    <afb0>   DW_AT_decl_column : 11
    <afb1>   DW_AT_import      : <0xae6b>	[Abbrev Number: 2 (DW_TAG_typedef)]
 <2><afb5>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <afb6>   DW_AT_decl_file   : 5
    <afb7>   DW_AT_decl_line   : 71
    <afb8>   DW_AT_decl_column : 11
    <afb9>   DW_AT_import      : <0xae83>	[Abbrev Number: 2 (DW_TAG_typedef)]
 <2><afbd>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <afbe>   DW_AT_decl_file   : 5
    <afbf>   DW_AT_decl_line   : 72
    <afc0>   DW_AT_decl_column : 11
    <afc1>   DW_AT_import      : <0xae9b>	[Abbrev Number: 2 (DW_TAG_typedef)]
 <2><afc5>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <afc6>   DW_AT_decl_file   : 5
    <afc7>   DW_AT_decl_line   : 73
    <afc8>   DW_AT_decl_column : 11
    <afc9>   DW_AT_import      : <0xaeb3>	[Abbrev Number: 2 (DW_TAG_typedef)]
 <2><afcd>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <afce>   DW_AT_decl_file   : 5
    <afcf>   DW_AT_decl_line   : 75
    <afd0>   DW_AT_decl_column : 11
    <afd1>   DW_AT_import      : <0xae0b>	[Abbrev Number: 2 (DW_TAG_typedef)]
 <2><afd5>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <afd6>   DW_AT_decl_file   : 5
    <afd7>   DW_AT_decl_line   : 76
    <afd8>   DW_AT_decl_column : 11
    <afd9>   DW_AT_import      : <0xae23>	[Abbrev Number: 2 (DW_TAG_typedef)]
 <2><afdd>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <afde>   DW_AT_decl_file   : 5
    <afdf>   DW_AT_decl_line   : 77
    <afe0>   DW_AT_decl_column : 11
    <afe1>   DW_AT_import      : <0xae3b>	[Abbrev Number: 2 (DW_TAG_typedef)]
 <2><afe5>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <afe6>   DW_AT_decl_file   : 5
    <afe7>   DW_AT_decl_line   : 78
    <afe8>   DW_AT_decl_column : 11
    <afe9>   DW_AT_import      : <0xae53>	[Abbrev Number: 2 (DW_TAG_typedef)]
 <2><afed>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <afee>   DW_AT_decl_file   : 5
    <afef>   DW_AT_decl_line   : 80
    <aff0>   DW_AT_decl_column : 11
    <aff1>   DW_AT_import      : <0xaddb>	[Abbrev Number: 2 (DW_TAG_typedef)]
 <2><aff5>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <aff6>   DW_AT_decl_file   : 5
    <aff7>   DW_AT_decl_line   : 81
    <aff8>   DW_AT_decl_column : 11
    <aff9>   DW_AT_import      : <0xadf3>	[Abbrev Number: 2 (DW_TAG_typedef)]
 <2><affd>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <affe>   DW_AT_decl_file   : 6
    <afff>   DW_AT_decl_line   : 127
    <b000>   DW_AT_decl_column : 11
    <b001>   DW_AT_import      : <0xc7b3>	[Abbrev Number: 2 (DW_TAG_typedef)]
 <2><b005>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b006>   DW_AT_decl_file   : 6
    <b007>   DW_AT_decl_line   : 128
    <b008>   DW_AT_decl_column : 11
    <b009>   DW_AT_import      : <0xc7e7>	[Abbrev Number: 2 (DW_TAG_typedef)]
 <2><b00d>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b00e>   DW_AT_decl_file   : 6
    <b00f>   DW_AT_decl_line   : 134
    <b010>   DW_AT_decl_column : 11
    <b011>   DW_AT_import      : <0xc854>	[Abbrev Number: 59 (DW_TAG_subprogram)]
 <2><b015>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b016>   DW_AT_decl_file   : 6
    <b017>   DW_AT_decl_line   : 140
    <b018>   DW_AT_decl_column : 11
    <b019>   DW_AT_import      : <0xc86a>	[Abbrev Number: 59 (DW_TAG_subprogram)]
 <2><b01d>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b01e>   DW_AT_decl_file   : 6
    <b01f>   DW_AT_decl_line   : 141
    <b020>   DW_AT_decl_column : 11
    <b021>   DW_AT_import      : <0xc887>	[Abbrev Number: 59 (DW_TAG_subprogram)]
 <2><b025>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b026>   DW_AT_decl_file   : 6
    <b027>   DW_AT_decl_line   : 142
    <b028>   DW_AT_decl_column : 11
    <b029>   DW_AT_import      : <0xc89d>	[Abbrev Number: 59 (DW_TAG_subprogram)]
 <2><b02d>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b02e>   DW_AT_decl_file   : 6
    <b02f>   DW_AT_decl_line   : 143
    <b030>   DW_AT_decl_column : 11
    <b031>   DW_AT_import      : <0xc8b3>	[Abbrev Number: 59 (DW_TAG_subprogram)]
 <2><b035>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b036>   DW_AT_decl_file   : 6
    <b037>   DW_AT_decl_line   : 145
    <b038>   DW_AT_decl_column : 11
    <b039>   DW_AT_import      : <0xc8dd>	[Abbrev Number: 60 (DW_TAG_subprogram)]
 <2><b03d>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b03e>   DW_AT_decl_file   : 6
    <b03f>   DW_AT_decl_line   : 148
    <b040>   DW_AT_decl_column : 11
    <b041>   DW_AT_import      : <0xc8f8>	[Abbrev Number: 59 (DW_TAG_subprogram)]
 <2><b045>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b046>   DW_AT_decl_file   : 6
    <b047>   DW_AT_decl_line   : 150
    <b048>   DW_AT_decl_column : 11
    <b049>   DW_AT_import      : <0xc90e>	[Abbrev Number: 59 (DW_TAG_subprogram)]
 <2><b04d>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b04e>   DW_AT_decl_file   : 6
    <b04f>   DW_AT_decl_line   : 153
    <b050>   DW_AT_decl_column : 11
    <b051>   DW_AT_import      : <0xc929>	[Abbrev Number: 59 (DW_TAG_subprogram)]
 <2><b055>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b056>   DW_AT_decl_file   : 6
    <b057>   DW_AT_decl_line   : 154
    <b058>   DW_AT_decl_column : 11
    <b059>   DW_AT_import      : <0xc944>	[Abbrev Number: 59 (DW_TAG_subprogram)]
 <2><b05d>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b05e>   DW_AT_decl_file   : 6
    <b05f>   DW_AT_decl_line   : 155
    <b060>   DW_AT_decl_column : 11
    <b061>   DW_AT_import      : <0xc976>	[Abbrev Number: 59 (DW_TAG_subprogram)]
 <2><b065>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b066>   DW_AT_decl_file   : 6
    <b067>   DW_AT_decl_line   : 157
    <b068>   DW_AT_decl_column : 11
    <b069>   DW_AT_import      : <0xc996>	[Abbrev Number: 61 (DW_TAG_subprogram)]
 <2><b06d>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b06e>   DW_AT_decl_file   : 6
    <b06f>   DW_AT_decl_line   : 163
    <b070>   DW_AT_decl_column : 11
    <b071>   DW_AT_import      : <0xc9b7>	[Abbrev Number: 62 (DW_TAG_subprogram)]
 <2><b075>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b076>   DW_AT_decl_file   : 6
    <b077>   DW_AT_decl_line   : 165
    <b078>   DW_AT_decl_column : 11
    <b079>   DW_AT_import      : <0xc9c3>	[Abbrev Number: 61 (DW_TAG_subprogram)]
 <2><b07d>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b07e>   DW_AT_decl_file   : 6
    <b07f>   DW_AT_decl_line   : 166
    <b080>   DW_AT_decl_column : 11
    <b081>   DW_AT_import      : <0xc9d5>	[Abbrev Number: 59 (DW_TAG_subprogram)]
 <2><b085>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b086>   DW_AT_decl_file   : 6
    <b087>   DW_AT_decl_line   : 167
    <b088>   DW_AT_decl_column : 11
    <b089>   DW_AT_import      : <0xc9f6>	[Abbrev Number: 59 (DW_TAG_subprogram)]
 <2><b08d>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b08e>   DW_AT_decl_file   : 6
    <b08f>   DW_AT_decl_line   : 168
    <b090>   DW_AT_decl_column : 11
    <b091>   DW_AT_import      : <0xca16>	[Abbrev Number: 59 (DW_TAG_subprogram)]
 <2><b095>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b096>   DW_AT_decl_file   : 6
    <b097>   DW_AT_decl_line   : 169
    <b098>   DW_AT_decl_column : 11
    <b099>   DW_AT_import      : <0xca36>	[Abbrev Number: 59 (DW_TAG_subprogram)]
 <2><b09d>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b09e>   DW_AT_decl_file   : 6
    <b09f>   DW_AT_decl_line   : 171
    <b0a0>   DW_AT_decl_column : 11
    <b0a1>   DW_AT_import      : <0xca4c>	[Abbrev Number: 59 (DW_TAG_subprogram)]
 <2><b0a5>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b0a6>   DW_AT_decl_file   : 6
    <b0a7>   DW_AT_decl_line   : 172
    <b0a8>   DW_AT_decl_column : 11
    <b0a9>   DW_AT_import      : <0xca72>	[Abbrev Number: 59 (DW_TAG_subprogram)]
 <2><b0ad>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b0ae>   DW_AT_decl_file   : 6
    <b0af>   DW_AT_decl_line   : 240
    <b0b0>   DW_AT_decl_column : 22
    <b0b1>   DW_AT_import      : <0xc81b>	[Abbrev Number: 2 (DW_TAG_typedef)]
 <2><b0b5>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b0b6>   DW_AT_decl_file   : 6
    <b0b7>   DW_AT_decl_line   : 245
    <b0b8>   DW_AT_decl_column : 22
    <b0b9>   DW_AT_import      : <0xb157>	[Abbrev Number: 15 (DW_TAG_subprogram)]
 <2><b0bd>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b0be>   DW_AT_decl_file   : 6
    <b0bf>   DW_AT_decl_line   : 246
    <b0c0>   DW_AT_decl_column : 22
    <b0c1>   DW_AT_import      : <0xca8d>	[Abbrev Number: 63 (DW_TAG_subprogram)]
 <2><b0c5>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b0c6>   DW_AT_decl_file   : 6
    <b0c7>   DW_AT_decl_line   : 248
    <b0c8>   DW_AT_decl_column : 22
    <b0c9>   DW_AT_import      : <0xcaa9>	[Abbrev Number: 63 (DW_TAG_subprogram)]
 <2><b0cd>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b0ce>   DW_AT_decl_file   : 6
    <b0cf>   DW_AT_decl_line   : 249
    <b0d0>   DW_AT_decl_column : 22
    <b0d1>   DW_AT_import      : <0xcb02>	[Abbrev Number: 59 (DW_TAG_subprogram)]
 <2><b0d5>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b0d6>   DW_AT_decl_file   : 6
    <b0d7>   DW_AT_decl_line   : 250
    <b0d8>   DW_AT_decl_column : 22
    <b0d9>   DW_AT_import      : <0xcac0>	[Abbrev Number: 63 (DW_TAG_subprogram)]
 <2><b0dd>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b0de>   DW_AT_decl_file   : 6
    <b0df>   DW_AT_decl_line   : 251
    <b0e0>   DW_AT_decl_column : 22
    <b0e1>   DW_AT_import      : <0xcae1>	[Abbrev Number: 63 (DW_TAG_subprogram)]
 <2><b0e5>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b0e6>   DW_AT_decl_file   : 6
    <b0e7>   DW_AT_decl_line   : 252
    <b0e8>   DW_AT_decl_column : 22
    <b0e9>   DW_AT_import      : <0xcb24>	[Abbrev Number: 63 (DW_TAG_subprogram)]
 <2><b0ed>: Abbrev Number: 13 (DW_TAG_namespace)
    <b0ee>   DW_AT_name        : (indirect string, offset: 0x124c): __swappable_details
    <b0f2>   DW_AT_decl_file   : 7
    <b0f3>   DW_AT_decl_line   : 2664
    <b0f5>   DW_AT_decl_column : 13
 <2><b0f6>: Abbrev Number: 13 (DW_TAG_namespace)
    <b0f7>   DW_AT_name        : (indirect string, offset: 0x234d): __swappable_with_details
    <b0fb>   DW_AT_decl_file   : 7
    <b0fc>   DW_AT_decl_line   : 2748
    <b0fe>   DW_AT_decl_column : 13
 <2><b0ff>: Abbrev Number: 0
 <1><b100>: Abbrev Number: 14 (DW_TAG_namespace)
    <b101>   DW_AT_name        : (indirect string, offset: 0x49a): __gnu_cxx
    <b105>   DW_AT_decl_file   : 8
    <b106>   DW_AT_decl_line   : 284
    <b108>   DW_AT_decl_column : 11
    <b109>   DW_AT_sibling     : <0xb173>
 <2><b10d>: Abbrev Number: 10 (DW_TAG_namespace)
    <b10e>   DW_AT_name        : (indirect string, offset: 0x2e92): __cxx11
    <b112>   DW_AT_decl_file   : 8
    <b113>   DW_AT_decl_line   : 286
    <b115>   DW_AT_decl_column : 65
    <b116>   DW_AT_export_symbols: 1
 <2><b116>: Abbrev Number: 11 (DW_TAG_imported_module)
    <b117>   DW_AT_decl_file   : 8
    <b118>   DW_AT_decl_line   : 286
    <b11a>   DW_AT_decl_column : 65
    <b11b>   DW_AT_import      : <0xb10d>	[Abbrev Number: 10 (DW_TAG_namespace)]
 <2><b11f>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b120>   DW_AT_decl_file   : 6
    <b121>   DW_AT_decl_line   : 200
    <b122>   DW_AT_decl_column : 11
    <b123>   DW_AT_import      : <0xc81b>	[Abbrev Number: 2 (DW_TAG_typedef)]
 <2><b127>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b128>   DW_AT_decl_file   : 6
    <b129>   DW_AT_decl_line   : 216
    <b12a>   DW_AT_decl_column : 11
    <b12b>   DW_AT_import      : <0xca8d>	[Abbrev Number: 63 (DW_TAG_subprogram)]
 <2><b12f>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b130>   DW_AT_decl_file   : 6
    <b131>   DW_AT_decl_line   : 227
    <b132>   DW_AT_decl_column : 11
    <b133>   DW_AT_import      : <0xcaa9>	[Abbrev Number: 63 (DW_TAG_subprogram)]
 <2><b137>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b138>   DW_AT_decl_file   : 6
    <b139>   DW_AT_decl_line   : 228
    <b13a>   DW_AT_decl_column : 11
    <b13b>   DW_AT_import      : <0xcac0>	[Abbrev Number: 63 (DW_TAG_subprogram)]
 <2><b13f>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b140>   DW_AT_decl_file   : 6
    <b141>   DW_AT_decl_line   : 229
    <b142>   DW_AT_decl_column : 11
    <b143>   DW_AT_import      : <0xcae1>	[Abbrev Number: 63 (DW_TAG_subprogram)]
 <2><b147>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b148>   DW_AT_decl_file   : 6
    <b149>   DW_AT_decl_line   : 231
    <b14a>   DW_AT_decl_column : 11
    <b14b>   DW_AT_import      : <0xcb02>	[Abbrev Number: 59 (DW_TAG_subprogram)]
 <2><b14f>: Abbrev Number: 12 (DW_TAG_imported_declaration)
    <b150>   DW_AT_decl_file   : 6
    <b151>   DW_AT_decl_line   : 232
    <b152>   DW_AT_decl_column : 11
    <b153>   DW_AT_import      : <0xcb24>	[Abbrev Number: 63 (DW_TAG_subprogram)]
 <2><b157>: Abbrev Number: 15 (DW_TAG_subprogram)
    <b158>   DW_AT_external    : 1
    <b158>   DW_AT_name        : div
    <b15c>   DW_AT_decl_file   : 6
    <b15d>   DW_AT_decl_line   : 213
    <b15e>   DW_AT_decl_column : 3
    <b15f>   DW_AT_linkage_name: (indirect string, offset: 0x2c32): _ZN9__gnu_cxx3divExx
    <b163>   DW_AT_type        : <0xc81b>
    <b167>   DW_AT_declaration : 1
 <3><b167>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <b168>   DW_AT_type        : <0xac85>
 <3><b16c>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <b16d>   DW_AT_type        : <0xac85>
 <3><b171>: Abbrev Number: 0
 <2><b172>: Abbrev Number: 0
 <1><b173>: Abbrev Number: 17 (DW_TAG_namespace)
    <b174>   DW_AT_name        : (indirect string, offset: 0x2679): l1_mem
    <b178>   DW_AT_decl_file   : 9
    <b179>   DW_AT_decl_line   : 5
    <b17a>   DW_AT_decl_column : 11
 <1><b17b>: Abbrev Number: 17 (DW_TAG_namespace)
    <b17c>   DW_AT_name        : (indirect string, offset: 0x2675): eth_l1_mem
    <b180>   DW_AT_decl_file   : 10
    <b181>   DW_AT_decl_line   : 5
    <b182>   DW_AT_decl_column : 11
 <1><b183>: Abbrev Number: 3 (DW_TAG_base_type)
    <b184>   DW_AT_byte_size   : 1
    <b185>   DW_AT_encoding    : 2	(boolean)
    <b186>   DW_AT_name        : (indirect string, offset: 0x6bd): bool
 <1><b18a>: Abbrev Number: 18 (DW_TAG_variable)
    <b18b>   DW_AT_name        : (indirect string, offset: 0x8fe): MCAST_START_STREAM
    <b18f>   DW_AT_decl_file   : 11
    <b190>   DW_AT_decl_line   : 16
    <b191>   DW_AT_decl_column : 16
    <b192>   DW_AT_type        : <0xada3>
    <b196>   DW_AT_const_value : 0
 <1><b197>: Abbrev Number: 18 (DW_TAG_variable)
    <b198>   DW_AT_name        : (indirect string, offset: 0xc40): MCAST_END_STREAM
    <b19c>   DW_AT_decl_file   : 11
    <b19d>   DW_AT_decl_line   : 17
    <b19e>   DW_AT_decl_column : 16
    <b19f>   DW_AT_type        : <0xada3>
    <b1a3>   DW_AT_const_value : 3
 <1><b1a4>: Abbrev Number: 18 (DW_TAG_variable)
    <b1a5>   DW_AT_name        : (indirect string, offset: 0x275b): OPERAND_START_STREAM
    <b1a9>   DW_AT_decl_file   : 11
    <b1aa>   DW_AT_decl_line   : 18
    <b1ab>   DW_AT_decl_column : 16
    <b1ac>   DW_AT_type        : <0xada3>
    <b1b0>   DW_AT_const_value : 4
 <1><b1b1>: Abbrev Number: 18 (DW_TAG_variable)
    <b1b2>   DW_AT_name        : (indirect string, offset: 0x190e): INPUT_START_STREAM_1
    <b1b6>   DW_AT_decl_file   : 11
    <b1b7>   DW_AT_decl_line   : 19
    <b1b8>   DW_AT_decl_column : 16
    <b1b9>   DW_AT_type        : <0xada3>
    <b1bd>   DW_AT_const_value : 4
 <1><b1be>: Abbrev Number: 18 (DW_TAG_variable)
    <b1bf>   DW_AT_name        : (indirect string, offset: 0x25d): INPUT_START_STREAM_1_SIZE
    <b1c3>   DW_AT_decl_file   : 11
    <b1c4>   DW_AT_decl_line   : 20
    <b1c5>   DW_AT_decl_column : 16
    <b1c6>   DW_AT_type        : <0xada3>
    <b1ca>   DW_AT_const_value : 2
 <1><b1cb>: Abbrev Number: 18 (DW_TAG_variable)
    <b1cc>   DW_AT_name        : (indirect string, offset: 0x1923): INPUT_START_STREAM_2
    <b1d0>   DW_AT_decl_file   : 11
    <b1d1>   DW_AT_decl_line   : 21
    <b1d2>   DW_AT_decl_column : 16
    <b1d3>   DW_AT_type        : <0xada3>
    <b1d7>   DW_AT_const_value : 10
 <1><b1d8>: Abbrev Number: 18 (DW_TAG_variable)
    <b1d9>   DW_AT_name        : (indirect string, offset: 0x2643): INPUT_PARAMS_START_STREAM
    <b1dd>   DW_AT_decl_file   : 11
    <b1de>   DW_AT_decl_line   : 22
    <b1df>   DW_AT_decl_column : 16
    <b1e0>   DW_AT_type        : <0xada3>
    <b1e4>   DW_AT_const_value : 16
 <1><b1e5>: Abbrev Number: 18 (DW_TAG_variable)
    <b1e6>   DW_AT_name        : (indirect string, offset: 0xa05): OUTPUT_START_STREAM
    <b1ea>   DW_AT_decl_file   : 11
    <b1eb>   DW_AT_decl_line   : 23
    <b1ec>   DW_AT_decl_column : 16
    <b1ed>   DW_AT_type        : <0xada3>
    <b1f1>   DW_AT_const_value : 24
 <1><b1f2>: Abbrev Number: 18 (DW_TAG_variable)
    <b1f3>   DW_AT_name        : (indirect string, offset: 0x1eca): INTERMEDIATES_START_STREAM
    <b1f7>   DW_AT_decl_file   : 11
    <b1f8>   DW_AT_decl_line   : 24
    <b1f9>   DW_AT_decl_column : 16
    <b1fa>   DW_AT_type        : <0xada3>
    <b1fe>   DW_AT_const_value : 32
 <1><b1ff>: Abbrev Number: 18 (DW_TAG_variable)
    <b200>   DW_AT_name        : (indirect string, offset: 0x2fe9): END_IO_STREAM
    <b204>   DW_AT_decl_file   : 11
    <b205>   DW_AT_decl_line   : 25
    <b206>   DW_AT_decl_column : 16
    <b207>   DW_AT_type        : <0xada3>
    <b20b>   DW_AT_const_value : 39
 <1><b20c>: Abbrev Number: 18 (DW_TAG_variable)
    <b20d>   DW_AT_name        : (indirect string, offset: 0x1a4d): OPERAND_INPUT_START_INDEX
    <b211>   DW_AT_decl_file   : 11
    <b212>   DW_AT_decl_line   : 27
    <b213>   DW_AT_decl_column : 11
    <b214>   DW_AT_type        : <0xad2a>
    <b218>   DW_AT_const_value : 0
 <1><b219>: Abbrev Number: 18 (DW_TAG_variable)
    <b21a>   DW_AT_name        : (indirect string, offset: 0xe3c): OPERAND_INPUT_PARAMS_START_INDEX
    <b21e>   DW_AT_decl_file   : 11
    <b21f>   DW_AT_decl_line   : 28
    <b220>   DW_AT_decl_column : 11
    <b221>   DW_AT_type        : <0xad2a>
    <b225>   DW_AT_const_value : 8
 <1><b226>: Abbrev Number: 18 (DW_TAG_variable)
    <b227>   DW_AT_name        : (indirect string, offset: 0x1abc): OPERAND_OUTPUT_START_INDEX
    <b22b>   DW_AT_decl_file   : 11
    <b22c>   DW_AT_decl_line   : 29
    <b22d>   DW_AT_decl_column : 11
    <b22e>   DW_AT_type        : <0xad2a>
    <b232>   DW_AT_const_value : 16
 <1><b233>: Abbrev Number: 18 (DW_TAG_variable)
    <b234>   DW_AT_name        : (indirect string, offset: 0x17e5): OPERAND_INTERMEDIATES_START_INDEX
    <b238>   DW_AT_decl_file   : 11
    <b239>   DW_AT_decl_line   : 30
    <b23a>   DW_AT_decl_column : 11
    <b23b>   DW_AT_type        : <0xad2a>
    <b23f>   DW_AT_const_value : 24
 <1><b240>: Abbrev Number: 18 (DW_TAG_variable)
    <b241>   DW_AT_name        : (indirect string, offset: 0x4ff): OPERAND_RELAY_START_INDEX
    <b245>   DW_AT_decl_file   : 11
    <b246>   DW_AT_decl_line   : 31
    <b247>   DW_AT_decl_column : 11
    <b248>   DW_AT_type        : <0xad2a>
    <b24c>   DW_AT_const_value : 32
 <1><b24d>: Abbrev Number: 18 (DW_TAG_variable)
    <b24e>   DW_AT_name        : (indirect string, offset: 0x1c79): MAX_NUM_OPERANDS
    <b252>   DW_AT_decl_file   : 11
    <b253>   DW_AT_decl_line   : 32
    <b254>   DW_AT_decl_column : 11
    <b255>   DW_AT_type        : <0xad2a>
    <b259>   DW_AT_const_value : 64
 <1><b25a>: Abbrev Number: 19 (DW_TAG_union_type)
    <b25b>   DW_AT_name        : (indirect string, offset: 0x325e): tt_uint64_t
    <b25f>   DW_AT_byte_size   : 8
    <b260>   DW_AT_decl_file   : 12
    <b261>   DW_AT_decl_line   : 9
    <b262>   DW_AT_decl_column : 7
    <b263>   DW_AT_sibling     : <0xb299>
 <2><b267>: Abbrev Number: 20 (DW_TAG_structure_type)
    <b268>   DW_AT_byte_size   : 8
    <b269>   DW_AT_decl_file   : 12
    <b26a>   DW_AT_decl_line   : 11
    <b26b>   DW_AT_decl_column : 12
    <b26c>   DW_AT_sibling     : <0xb289>
 <3><b270>: Abbrev Number: 21 (DW_TAG_member)
    <b271>   DW_AT_name        : hi
    <b274>   DW_AT_decl_file   : 12
    <b275>   DW_AT_decl_line   : 12
    <b276>   DW_AT_decl_column : 18
    <b277>   DW_AT_type        : <0xad97>
    <b27b>   DW_AT_data_member_location: 0
 <3><b27c>: Abbrev Number: 21 (DW_TAG_member)
    <b27d>   DW_AT_name        : lo
    <b280>   DW_AT_decl_file   : 12
    <b281>   DW_AT_decl_line   : 13
    <b282>   DW_AT_decl_column : 18
    <b283>   DW_AT_type        : <0xad97>
    <b287>   DW_AT_data_member_location: 4
 <3><b288>: Abbrev Number: 0
 <2><b289>: Abbrev Number: 22 (DW_TAG_member)
    <b28a>   DW_AT_name        : v
    <b28c>   DW_AT_decl_file   : 12
    <b28d>   DW_AT_decl_line   : 10
    <b28e>   DW_AT_decl_column : 14
    <b28f>   DW_AT_type        : <0xadb9>
 <2><b293>: Abbrev Number: 23 (DW_TAG_member)
    <b294>   DW_AT_type        : <0xb267>
 <2><b298>: Abbrev Number: 0
 <1><b299>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <b29a>   DW_AT_type        : <0xb25a>
 <1><b29e>: Abbrev Number: 24 (DW_TAG_variable)
    <b29f>   DW_AT_name        : (indirect string, offset: 0x1c2c): PERF_MAX_NUM_INPUTS
    <b2a3>   DW_AT_decl_file   : 11
    <b2a4>   DW_AT_decl_line   : 116
    <b2a5>   DW_AT_decl_column : 28
    <b2a6>   DW_AT_type        : <0xad5f>
    <b2aa>   DW_AT_const_expr  : 1
    <b2aa>   DW_AT_const_value : 8
 <1><b2ab>: Abbrev Number: 24 (DW_TAG_variable)
    <b2ac>   DW_AT_name        : (indirect string, offset: 0x1092): PERF_MAX_NUM_OUTPUTS
    <b2b0>   DW_AT_decl_file   : 11
    <b2b1>   DW_AT_decl_line   : 117
    <b2b2>   DW_AT_decl_column : 28
    <b2b3>   DW_AT_type        : <0xad5f>
    <b2b7>   DW_AT_const_expr  : 1
    <b2b7>   DW_AT_const_value : 1
 <1><b2b8>: Abbrev Number: 25 (DW_TAG_namespace)
    <b2b9>   DW_AT_name        : (indirect string, offset: 0x7f9): epoch_queue
    <b2bd>   DW_AT_decl_file   : 13
    <b2be>   DW_AT_decl_line   : 9
    <b2bf>   DW_AT_decl_column : 11
    <b2c0>   DW_AT_sibling     : <0xb3ff>
 <2><b2c4>: Abbrev Number: 26 (DW_TAG_variable)
    <b2c5>   DW_AT_name        : (indirect string, offset: 0x114d): EPOCH_Q_NUM_SLOTS
    <b2c9>   DW_AT_decl_file   : 13
    <b2ca>   DW_AT_decl_line   : 13
    <b2cb>   DW_AT_decl_column : 35
    <b2cc>   DW_AT_type        : <0xad92>
    <b2d0>   DW_AT_declaration : 1
    <b2d0>   DW_AT_const_value : 256
    <b2d2>   DW_AT_const_expr  : 1
 <2><b2d2>: Abbrev Number: 27 (DW_TAG_variable)
    <b2d3>   DW_AT_name        : (indirect string, offset: 0x1dbb): EPOCH_Q_SLOT_SIZE
    <b2d7>   DW_AT_decl_file   : 13
    <b2d8>   DW_AT_decl_line   : 14
    <b2d9>   DW_AT_decl_column : 35
    <b2da>   DW_AT_type        : <0xad92>
    <b2de>   DW_AT_declaration : 1
    <b2de>   DW_AT_const_value : 32
    <b2df>   DW_AT_const_expr  : 1
 <2><b2df>: Abbrev Number: 27 (DW_TAG_variable)
    <b2e0>   DW_AT_name        : (indirect string, offset: 0x2271): GridSizeRow
    <b2e4>   DW_AT_decl_file   : 13
    <b2e5>   DW_AT_decl_line   : 15
    <b2e6>   DW_AT_decl_column : 35
    <b2e7>   DW_AT_type        : <0xad92>
    <b2eb>   DW_AT_declaration : 1
    <b2eb>   DW_AT_const_value : 12
    <b2ec>   DW_AT_const_expr  : 1
 <2><b2ec>: Abbrev Number: 27 (DW_TAG_variable)
    <b2ed>   DW_AT_name        : (indirect string, offset: 0xf50): GridSizeCol
    <b2f1>   DW_AT_decl_file   : 13
    <b2f2>   DW_AT_decl_line   : 16
    <b2f3>   DW_AT_decl_column : 35
    <b2f4>   DW_AT_type        : <0xad92>
    <b2f8>   DW_AT_declaration : 1
    <b2f8>   DW_AT_const_value : 10
    <b2f9>   DW_AT_const_expr  : 1
 <2><b2f9>: Abbrev Number: 28 (DW_TAG_variable)
    <b2fa>   DW_AT_name        : (indirect string, offset: 0x3cc): EpochEndReached
    <b2fe>   DW_AT_decl_file   : 13
    <b2ff>   DW_AT_decl_line   : 17
    <b300>   DW_AT_decl_column : 35
    <b301>   DW_AT_type        : <0xad92>
    <b305>   DW_AT_declaration : 1
    <b305>   DW_AT_const_value : -1
    <b306>   DW_AT_const_expr  : 1
 <2><b306>: Abbrev Number: 27 (DW_TAG_variable)
    <b307>   DW_AT_name        : (indirect string, offset: 0x14d5): EPOCH_BIN_NUM_SLOTS
    <b30b>   DW_AT_decl_file   : 13
    <b30c>   DW_AT_decl_line   : 19
    <b30d>   DW_AT_decl_column : 35
    <b30e>   DW_AT_type        : <0xad92>
    <b312>   DW_AT_declaration : 1
    <b312>   DW_AT_const_value : 32
    <b313>   DW_AT_const_expr  : 1
 <2><b313>: Abbrev Number: 29 (DW_TAG_variable)
    <b314>   DW_AT_name        : (indirect string, offset: 0x15f5): POLLING_EPOCH_QUEUE_TAG
    <b318>   DW_AT_decl_file   : 13
    <b319>   DW_AT_decl_line   : 20
    <b31a>   DW_AT_decl_column : 36
    <b31b>   DW_AT_type        : <0xada3>
    <b31f>   DW_AT_declaration : 1
    <b31f>   DW_AT_const_value : 0xaca0cafe
    <b323>   DW_AT_const_expr  : 1
 <2><b323>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <b324>   DW_AT_name        : (indirect string, offset: 0x113f): EpochQueueCmd
    <b328>   DW_AT_encoding    : 7	(unsigned)
    <b329>   DW_AT_byte_size   : 4
    <b32a>   DW_AT_type        : <0xad97>
    <b32e>   DW_AT_decl_file   : 13
    <b32f>   DW_AT_decl_line   : 25
    <b330>   DW_AT_decl_column : 10
    <b331>   DW_AT_sibling     : <0xb360>
 <3><b335>: Abbrev Number: 31 (DW_TAG_enumerator)
    <b336>   DW_AT_name        : (indirect string, offset: 0x20cb): EpochCmdValid
    <b33a>   DW_AT_const_value : 1
 <3><b33b>: Abbrev Number: 31 (DW_TAG_enumerator)
    <b33c>   DW_AT_name        : (indirect string, offset: 0x165d): EpochCmdNotValid
    <b340>   DW_AT_const_value : 2
 <3><b341>: Abbrev Number: 31 (DW_TAG_enumerator)
    <b342>   DW_AT_name        : (indirect string, offset: 0x68b): EpochCmdIOQueueUpdate
    <b346>   DW_AT_const_value : 3
 <3><b347>: Abbrev Number: 31 (DW_TAG_enumerator)
    <b348>   DW_AT_name        : (indirect string, offset: 0x1d54): EpochCmdVarinst
    <b34c>   DW_AT_const_value : 4
 <3><b34d>: Abbrev Number: 31 (DW_TAG_enumerator)
    <b34e>   DW_AT_name        : (indirect string, offset: 0x1759): EpochCmdLoopStart
    <b352>   DW_AT_const_value : 5
 <3><b353>: Abbrev Number: 31 (DW_TAG_enumerator)
    <b354>   DW_AT_name        : (indirect string, offset: 0x2dbb): EpochCmdLoopEnd
    <b358>   DW_AT_const_value : 6
 <3><b359>: Abbrev Number: 31 (DW_TAG_enumerator)
    <b35a>   DW_AT_name        : (indirect string, offset: 0x1d8): EpochCmdEndProgram
    <b35e>   DW_AT_const_value : 15
 <3><b35f>: Abbrev Number: 0
 <2><b360>: Abbrev Number: 27 (DW_TAG_variable)
    <b361>   DW_AT_name        : (indirect string, offset: 0x19ef): EPOCH_Q_WRPTR_OFFSET
    <b365>   DW_AT_decl_file   : 13
    <b366>   DW_AT_decl_line   : 98
    <b367>   DW_AT_decl_column : 35
    <b368>   DW_AT_type        : <0xad92>
    <b36c>   DW_AT_declaration : 1
    <b36c>   DW_AT_const_value : 4
    <b36d>   DW_AT_const_expr  : 1
 <2><b36d>: Abbrev Number: 27 (DW_TAG_variable)
    <b36e>   DW_AT_name        : (indirect string, offset: 0x2116): EPOCH_Q_RDPTR_OFFSET
    <b372>   DW_AT_decl_file   : 13
    <b373>   DW_AT_decl_line   : 99
    <b374>   DW_AT_decl_column : 35
    <b375>   DW_AT_type        : <0xad92>
    <b379>   DW_AT_declaration : 1
    <b379>   DW_AT_const_value : 0
    <b37a>   DW_AT_const_expr  : 1
 <2><b37a>: Abbrev Number: 27 (DW_TAG_variable)
    <b37b>   DW_AT_name        : (indirect string, offset: 0x9f0): EPOCH_Q_SLOTS_OFFSET
    <b37f>   DW_AT_decl_file   : 13
    <b380>   DW_AT_decl_line   : 100
    <b381>   DW_AT_decl_column : 35
    <b382>   DW_AT_type        : <0xad92>
    <b386>   DW_AT_declaration : 1
    <b386>   DW_AT_const_value : 32
    <b387>   DW_AT_const_expr  : 1
 <2><b387>: Abbrev Number: 26 (DW_TAG_variable)
    <b388>   DW_AT_name        : (indirect string, offset: 0x3dc): EPOCH_TABLE_ENTRY_SIZE_BYTES
    <b38c>   DW_AT_decl_file   : 13
    <b38d>   DW_AT_decl_line   : 102
    <b38e>   DW_AT_decl_column : 35
    <b38f>   DW_AT_type        : <0xad92>
    <b393>   DW_AT_declaration : 1
    <b393>   DW_AT_const_value : 8224
    <b395>   DW_AT_const_expr  : 1
 <2><b395>: Abbrev Number: 27 (DW_TAG_variable)
    <b396>   DW_AT_name        : (indirect string, offset: 0x1375): QUEUE_UPDATE_BLOB_NUM_ENTRIES
    <b39a>   DW_AT_decl_file   : 13
    <b39b>   DW_AT_decl_line   : 103
    <b39c>   DW_AT_decl_column : 35
    <b39d>   DW_AT_type        : <0xad92>
    <b3a1>   DW_AT_declaration : 1
    <b3a1>   DW_AT_const_value : 120
    <b3a2>   DW_AT_const_expr  : 1
 <2><b3a2>: Abbrev Number: 26 (DW_TAG_variable)
    <b3a3>   DW_AT_name        : (indirect string, offset: 0x181e): QUEUE_UPDATE_BLOB_SIZE_BYTES
    <b3a7>   DW_AT_decl_file   : 13
    <b3a8>   DW_AT_decl_line   : 104
    <b3a9>   DW_AT_decl_column : 35
    <b3aa>   DW_AT_type        : <0xad92>
    <b3ae>   DW_AT_declaration : 1
    <b3ae>   DW_AT_const_value : 960
    <b3b0>   DW_AT_const_expr  : 1
 <2><b3b0>: Abbrev Number: 29 (DW_TAG_variable)
    <b3b1>   DW_AT_name        : (indirect string, offset: 0x19bc): DRAM_EPOCH_METADATA_BASE
    <b3b5>   DW_AT_decl_file   : 13
    <b3b6>   DW_AT_decl_line   : 106
    <b3b7>   DW_AT_decl_column : 35
    <b3b8>   DW_AT_type        : <0xad92>
    <b3bc>   DW_AT_declaration : 1
    <b3bc>   DW_AT_const_value : 0x700000
    <b3c0>   DW_AT_const_expr  : 1
 <2><b3c0>: Abbrev Number: 29 (DW_TAG_variable)
    <b3c1>   DW_AT_name        : (indirect string, offset: 0xa51): DRAM_EPOCH_METADATA_LIMIT
    <b3c5>   DW_AT_decl_file   : 13
    <b3c6>   DW_AT_decl_line   : 107
    <b3c7>   DW_AT_decl_column : 35
    <b3c8>   DW_AT_type        : <0xad92>
    <b3cc>   DW_AT_declaration : 1
    <b3cc>   DW_AT_const_value : 0x800000
    <b3d0>   DW_AT_const_expr  : 1
 <2><b3d0>: Abbrev Number: 29 (DW_TAG_variable)
    <b3d1>   DW_AT_name        : (indirect string, offset: 0x10c7): EPOCH_TABLE_DRAM_ADDR
    <b3d5>   DW_AT_decl_file   : 13
    <b3d6>   DW_AT_decl_line   : 109
    <b3d7>   DW_AT_decl_column : 35
    <b3d8>   DW_AT_type        : <0xad92>
    <b3dc>   DW_AT_declaration : 1
    <b3dc>   DW_AT_const_value : 0x70f100
    <b3e0>   DW_AT_const_expr  : 1
 <2><b3e0>: Abbrev Number: 26 (DW_TAG_variable)
    <b3e1>   DW_AT_name        : (indirect string, offset: 0x27e1): EPOCH_ALLOC_QUEUE_SYNC_SLOTS
    <b3e5>   DW_AT_decl_file   : 13
    <b3e6>   DW_AT_decl_line   : 110
    <b3e7>   DW_AT_decl_column : 35
    <b3e8>   DW_AT_type        : <0xad92>
    <b3ec>   DW_AT_declaration : 1
    <b3ec>   DW_AT_const_value : 256
    <b3ee>   DW_AT_const_expr  : 1
 <2><b3ee>: Abbrev Number: 29 (DW_TAG_variable)
    <b3ef>   DW_AT_name        : (indirect string, offset: 0x1641): EPOCH_ALLOC_QUEUE_SYNC_ADDR
    <b3f3>   DW_AT_decl_file   : 13
    <b3f4>   DW_AT_decl_line   : 111
    <b3f5>   DW_AT_decl_column : 35
    <b3f6>   DW_AT_type        : <0xad92>
    <b3fa>   DW_AT_declaration : 1
    <b3fa>   DW_AT_const_value : 0x70d100
    <b3fe>   DW_AT_const_expr  : 1
 <2><b3fe>: Abbrev Number: 0
 <1><b3ff>: Abbrev Number: 32 (DW_TAG_variable)
    <b400>   DW_AT_specification: <0xb2c4>
 <1><b404>: Abbrev Number: 32 (DW_TAG_variable)
    <b405>   DW_AT_specification: <0xb2d2>
 <1><b409>: Abbrev Number: 32 (DW_TAG_variable)
    <b40a>   DW_AT_specification: <0xb2df>
 <1><b40e>: Abbrev Number: 32 (DW_TAG_variable)
    <b40f>   DW_AT_specification: <0xb2ec>
 <1><b413>: Abbrev Number: 32 (DW_TAG_variable)
    <b414>   DW_AT_specification: <0xb2f9>
 <1><b418>: Abbrev Number: 32 (DW_TAG_variable)
    <b419>   DW_AT_specification: <0xb306>
 <1><b41d>: Abbrev Number: 32 (DW_TAG_variable)
    <b41e>   DW_AT_specification: <0xb313>
 <1><b422>: Abbrev Number: 33 (DW_TAG_array_type)
    <b423>   DW_AT_type        : <0xad97>
    <b427>   DW_AT_sibling     : <0xb432>
 <2><b42b>: Abbrev Number: 34 (DW_TAG_subrange_type)
    <b42c>   DW_AT_type        : <0xad3b>
    <b430>   DW_AT_upper_bound : 4
 <2><b431>: Abbrev Number: 0
 <1><b432>: Abbrev Number: 32 (DW_TAG_variable)
    <b433>   DW_AT_specification: <0xb360>
 <1><b437>: Abbrev Number: 32 (DW_TAG_variable)
    <b438>   DW_AT_specification: <0xb36d>
 <1><b43c>: Abbrev Number: 32 (DW_TAG_variable)
    <b43d>   DW_AT_specification: <0xb37a>
 <1><b441>: Abbrev Number: 32 (DW_TAG_variable)
    <b442>   DW_AT_specification: <0xb387>
 <1><b446>: Abbrev Number: 32 (DW_TAG_variable)
    <b447>   DW_AT_specification: <0xb395>
 <1><b44b>: Abbrev Number: 32 (DW_TAG_variable)
    <b44c>   DW_AT_specification: <0xb3a2>
 <1><b450>: Abbrev Number: 32 (DW_TAG_variable)
    <b451>   DW_AT_specification: <0xb3b0>
 <1><b455>: Abbrev Number: 32 (DW_TAG_variable)
    <b456>   DW_AT_specification: <0xb3c0>
 <1><b45a>: Abbrev Number: 32 (DW_TAG_variable)
    <b45b>   DW_AT_specification: <0xb3d0>
 <1><b45f>: Abbrev Number: 32 (DW_TAG_variable)
    <b460>   DW_AT_specification: <0xb3e0>
 <1><b464>: Abbrev Number: 32 (DW_TAG_variable)
    <b465>   DW_AT_specification: <0xb3ee>
 <1><b469>: Abbrev Number: 35 (DW_TAG_variable)
    <b46a>   DW_AT_name        : (indirect string, offset: 0x535): EPOCH_INFO_ADDR
    <b46e>   DW_AT_decl_file   : 14
    <b46f>   DW_AT_decl_line   : 12
    <b470>   DW_AT_decl_column : 16
    <b471>   DW_AT_type        : <0xada3>
    <b475>   DW_AT_const_value : 0x23080
 <1><b479>: Abbrev Number: 35 (DW_TAG_variable)
    <b47a>   DW_AT_name        : (indirect string, offset: 0x531): ETH_EPOCH_INFO_ADDR
    <b47e>   DW_AT_decl_file   : 14
    <b47f>   DW_AT_decl_line   : 15
    <b480>   DW_AT_decl_column : 16
    <b481>   DW_AT_type        : <0xada3>
    <b485>   DW_AT_const_value : 0x20080
 <1><b489>: Abbrev Number: 36 (DW_TAG_variable)
    <b48a>   DW_AT_name        : (indirect string, offset: 0x2e5e): EPOCH_Q_BASE
    <b48e>   DW_AT_decl_file   : 14
    <b48f>   DW_AT_decl_line   : 21
    <b490>   DW_AT_decl_column : 16
    <b491>   DW_AT_type        : <0xada3>
    <b495>   DW_AT_const_value : 28672
 <1><b497>: Abbrev Number: 36 (DW_TAG_variable)
    <b498>   DW_AT_name        : (indirect string, offset: 0x2e5a): ETH_EPOCH_Q_BASE
    <b49c>   DW_AT_decl_file   : 14
    <b49d>   DW_AT_decl_line   : 22
    <b49e>   DW_AT_decl_column : 16
    <b49f>   DW_AT_type        : <0xada3>
    <b4a3>   DW_AT_const_value : 36864
 <1><b4a5>: Abbrev Number: 18 (DW_TAG_variable)
    <b4a6>   DW_AT_name        : (indirect string, offset: 0x2178): EPOCH_MAX_INPUTS
    <b4aa>   DW_AT_decl_file   : 14
    <b4ab>   DW_AT_decl_line   : 28
    <b4ac>   DW_AT_decl_column : 16
    <b4ad>   DW_AT_type        : <0xada3>
    <b4b1>   DW_AT_const_value : 24
 <1><b4b2>: Abbrev Number: 18 (DW_TAG_variable)
    <b4b3>   DW_AT_name        : (indirect string, offset: 0x1311): EPOCH_MAX_OUTPUTS
    <b4b7>   DW_AT_decl_file   : 14
    <b4b8>   DW_AT_decl_line   : 29
    <b4b9>   DW_AT_decl_column : 16
    <b4ba>   DW_AT_type        : <0xada3>
    <b4be>   DW_AT_const_value : 16
 <1><b4bf>: Abbrev Number: 18 (DW_TAG_variable)
    <b4c0>   DW_AT_name        : (indirect string, offset: 0x2868): EPOCH_MAX_OUTPUTS_ETH
    <b4c4>   DW_AT_decl_file   : 14
    <b4c5>   DW_AT_decl_line   : 30
    <b4c6>   DW_AT_decl_column : 16
    <b4c7>   DW_AT_type        : <0xada3>
    <b4cb>   DW_AT_const_value : 24
 <1><b4cc>: Abbrev Number: 18 (DW_TAG_variable)
    <b4cd>   DW_AT_name        : (indirect string, offset: 0x227d): EPOCH_MAX_OUTPUT_FORKS
    <b4d1>   DW_AT_decl_file   : 14
    <b4d2>   DW_AT_decl_line   : 31
    <b4d3>   DW_AT_decl_column : 16
    <b4d4>   DW_AT_type        : <0xada3>
    <b4d8>   DW_AT_const_value : 16
 <1><b4d9>: Abbrev Number: 18 (DW_TAG_variable)
    <b4da>   DW_AT_name        : (indirect string, offset: 0x143a): EPOCH_MAX_NUM_TILE_SIZES
    <b4de>   DW_AT_decl_file   : 14
    <b4df>   DW_AT_decl_line   : 32
    <b4e0>   DW_AT_decl_column : 16
    <b4e1>   DW_AT_type        : <0xada3>
    <b4e5>   DW_AT_const_value : 8
 <1><b4e6>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <b4e7>   DW_AT_name        : (indirect string, offset: 0x5dc): datacopy_stream_type_t
    <b4eb>   DW_AT_encoding    : 7	(unsigned)
    <b4ec>   DW_AT_byte_size   : 1
    <b4ed>   DW_AT_type        : <0xad53>
    <b4f1>   DW_AT_decl_file   : 14
    <b4f2>   DW_AT_decl_line   : 34
    <b4f3>   DW_AT_decl_column : 6
    <b4f4>   DW_AT_sibling     : <0xb50b>
 <2><b4f8>: Abbrev Number: 31 (DW_TAG_enumerator)
    <b4f9>   DW_AT_name        : (indirect string, offset: 0x25a5): NONE
    <b4fd>   DW_AT_const_value : 0
 <2><b4fe>: Abbrev Number: 31 (DW_TAG_enumerator)
    <b4ff>   DW_AT_name        : (indirect string, offset: 0x1243): UNPACKER
    <b503>   DW_AT_const_value : 1
 <2><b504>: Abbrev Number: 31 (DW_TAG_enumerator)
    <b505>   DW_AT_name        : (indirect string, offset: 0x1245): PACKER
    <b509>   DW_AT_const_value : 2
 <2><b50a>: Abbrev Number: 0
 <1><b50b>: Abbrev Number: 36 (DW_TAG_variable)
    <b50c>   DW_AT_name        : (indirect string, offset: 0x1163): DRAM_POLLING_CTRL_BASE
    <b510>   DW_AT_decl_file   : 14
    <b511>   DW_AT_decl_line   : 69
    <b512>   DW_AT_decl_column : 16
    <b513>   DW_AT_type        : <0xada3>
    <b517>   DW_AT_const_value : 20544
 <1><b519>: Abbrev Number: 36 (DW_TAG_variable)
    <b51a>   DW_AT_name        : (indirect string, offset: 0x115f): ETH_DRAM_POLLING_CTRL_BASE
    <b51e>   DW_AT_decl_file   : 14
    <b51f>   DW_AT_decl_line   : 70
    <b520>   DW_AT_decl_column : 16
    <b521>   DW_AT_type        : <0xada3>
    <b525>   DW_AT_const_value : 36896
 <1><b527>: Abbrev Number: 35 (DW_TAG_variable)
    <b528>   DW_AT_name        : (indirect string, offset: 0x2a01): EPOCH_RUNTIME_CONFIG_B
    <b52c>   DW_AT_decl_file   : 14
    <b52d>   DW_AT_decl_line   : 78
    <b52e>   DW_AT_decl_column : 16
    <b52f>   DW_AT_type        : <0xada3>
    <b533>   DW_AT_const_value : 0x23000
 <1><b537>: Abbrev Number: 35 (DW_TAG_variable)
    <b538>   DW_AT_name        : (indirect string, offset: 0x29fd): ETH_EPOCH_RUNTIME_CONFIG_B
    <b53c>   DW_AT_decl_file   : 14
    <b53d>   DW_AT_decl_line   : 79
    <b53e>   DW_AT_decl_column : 16
    <b53f>   DW_AT_type        : <0xada3>
    <b543>   DW_AT_const_value : 0x20000
 <1><b547>: Abbrev Number: 7 (DW_TAG_structure_type)
    <b548>   DW_AT_name        : (indirect string, offset: 0x167c): scatter_pipe_blob_t
    <b54c>   DW_AT_byte_size   : 8
    <b54d>   DW_AT_decl_file   : 14
    <b54e>   DW_AT_decl_line   : 86
    <b54f>   DW_AT_decl_column : 8
    <b550>   DW_AT_sibling     : <0xb56f>
 <2><b554>: Abbrev Number: 8 (DW_TAG_member)
    <b555>   DW_AT_name        : (indirect string, offset: 0x2d74): scatter_blob_base_addr
    <b559>   DW_AT_decl_file   : 14
    <b55a>   DW_AT_decl_line   : 87
    <b55b>   DW_AT_decl_column : 14
    <b55c>   DW_AT_type        : <0xad97>
    <b560>   DW_AT_data_member_location: 0
 <2><b561>: Abbrev Number: 8 (DW_TAG_member)
    <b562>   DW_AT_name        : (indirect string, offset: 0x2726): start_scatter_blob_num_cfg_regs
    <b566>   DW_AT_decl_file   : 14
    <b567>   DW_AT_decl_line   : 88
    <b568>   DW_AT_decl_column : 14
    <b569>   DW_AT_type        : <0xad97>
    <b56d>   DW_AT_data_member_location: 4
 <2><b56e>: Abbrev Number: 0
 <1><b56f>: Abbrev Number: 2 (DW_TAG_typedef)
    <b570>   DW_AT_name        : (indirect string, offset: 0x167c): scatter_pipe_blob_t
    <b574>   DW_AT_decl_file   : 14
    <b575>   DW_AT_decl_line   : 91
    <b576>   DW_AT_decl_column : 36
    <b577>   DW_AT_type        : <0xb547>
 <1><b57b>: Abbrev Number: 7 (DW_TAG_structure_type)
    <b57c>   DW_AT_name        : (indirect string, offset: 0x15c6): scatter_pipe_state_t
    <b580>   DW_AT_byte_size   : 16
    <b581>   DW_AT_decl_file   : 14
    <b582>   DW_AT_decl_line   : 96
    <b583>   DW_AT_decl_column : 8
    <b584>   DW_AT_sibling     : <0xb5bd>
 <2><b588>: Abbrev Number: 8 (DW_TAG_member)
    <b589>   DW_AT_name        : (indirect string, offset: 0x22e0): curr_unroll
    <b58d>   DW_AT_decl_file   : 14
    <b58e>   DW_AT_decl_line   : 97
    <b58f>   DW_AT_decl_column : 12
    <b590>   DW_AT_type        : <0xad97>
    <b594>   DW_AT_data_member_location: 0
 <2><b595>: Abbrev Number: 8 (DW_TAG_member)
    <b596>   DW_AT_name        : (indirect string, offset: 0xb91): max_unroll
    <b59a>   DW_AT_decl_file   : 14
    <b59b>   DW_AT_decl_line   : 98
    <b59c>   DW_AT_decl_column : 12
    <b59d>   DW_AT_type        : <0xad97>
    <b5a1>   DW_AT_data_member_location: 4
 <2><b5a2>: Abbrev Number: 8 (DW_TAG_member)
    <b5a3>   DW_AT_name        : (indirect string, offset: 0xf92): unused0
    <b5a7>   DW_AT_decl_file   : 14
    <b5a8>   DW_AT_decl_line   : 99
    <b5a9>   DW_AT_decl_column : 12
    <b5aa>   DW_AT_type        : <0xad97>
    <b5ae>   DW_AT_data_member_location: 8
 <2><b5af>: Abbrev Number: 8 (DW_TAG_member)
    <b5b0>   DW_AT_name        : (indirect string, offset: 0x1bb7): unroll_blobs
    <b5b4>   DW_AT_decl_file   : 14
    <b5b5>   DW_AT_decl_line   : 100
    <b5b6>   DW_AT_decl_column : 35
    <b5b7>   DW_AT_type        : <0xb5bd>
    <b5bb>   DW_AT_data_member_location: 12
 <2><b5bc>: Abbrev Number: 0
 <1><b5bd>: Abbrev Number: 37 (DW_TAG_pointer_type)
    <b5be>   DW_AT_byte_size   : 4
    <b5bf>   DW_AT_type        : <0xb56f>
 <1><b5c3>: Abbrev Number: 2 (DW_TAG_typedef)
    <b5c4>   DW_AT_name        : (indirect string, offset: 0x15c6): scatter_pipe_state_t
    <b5c8>   DW_AT_decl_file   : 14
    <b5c9>   DW_AT_decl_line   : 103
    <b5ca>   DW_AT_decl_column : 37
    <b5cb>   DW_AT_type        : <0xb57b>
 <1><b5cf>: Abbrev Number: 7 (DW_TAG_structure_type)
    <b5d0>   DW_AT_name        : (indirect string, offset: 0x2f70): dram_io_scatter_state_t
    <b5d4>   DW_AT_byte_size   : 32
    <b5d5>   DW_AT_decl_file   : 14
    <b5d6>   DW_AT_decl_line   : 108
    <b5d7>   DW_AT_decl_column : 8
    <b5d8>   DW_AT_sibling     : <0xb645>
 <2><b5dc>: Abbrev Number: 8 (DW_TAG_member)
    <b5dd>   DW_AT_name        : (indirect string, offset: 0xf9a): unused1
    <b5e1>   DW_AT_decl_file   : 14
    <b5e2>   DW_AT_decl_line   : 109
    <b5e3>   DW_AT_decl_column : 12
    <b5e4>   DW_AT_type        : <0xad97>
    <b5e8>   DW_AT_data_member_location: 0
 <2><b5e9>: Abbrev Number: 8 (DW_TAG_member)
    <b5ea>   DW_AT_name        : (indirect string, offset: 0x1eb5): scatter_offsets_size
    <b5ee>   DW_AT_decl_file   : 14
    <b5ef>   DW_AT_decl_line   : 110
    <b5f0>   DW_AT_decl_column : 12
    <b5f1>   DW_AT_type        : <0xad97>
    <b5f5>   DW_AT_data_member_location: 4
 <2><b5f6>: Abbrev Number: 8 (DW_TAG_member)
    <b5f7>   DW_AT_name        : (indirect string, offset: 0x3200): scatter_chunk_size_bytes
    <b5fb>   DW_AT_decl_file   : 14
    <b5fc>   DW_AT_decl_line   : 111
    <b5fd>   DW_AT_decl_column : 12
    <b5fe>   DW_AT_type        : <0xad97>
    <b602>   DW_AT_data_member_location: 8
 <2><b603>: Abbrev Number: 8 (DW_TAG_member)
    <b604>   DW_AT_name        : (indirect string, offset: 0x2797): q_slot_size_bytes
    <b608>   DW_AT_decl_file   : 14
    <b609>   DW_AT_decl_line   : 112
    <b60a>   DW_AT_decl_column : 12
    <b60b>   DW_AT_type        : <0xad97>
    <b60f>   DW_AT_data_member_location: 12
 <2><b610>: Abbrev Number: 8 (DW_TAG_member)
    <b611>   DW_AT_name        : (indirect string, offset: 0x3791): scatter_chunk_size_tiles
    <b615>   DW_AT_decl_file   : 14
    <b616>   DW_AT_decl_line   : 113
    <b617>   DW_AT_decl_column : 12
    <b618>   DW_AT_type        : <0xad97>
    <b61c>   DW_AT_data_member_location: 16
 <2><b61d>: Abbrev Number: 8 (DW_TAG_member)
    <b61e>   DW_AT_name        : (indirect string, offset: 0xfa2): unused2
    <b622>   DW_AT_decl_file   : 14
    <b623>   DW_AT_decl_line   : 114
    <b624>   DW_AT_decl_column : 12
    <b625>   DW_AT_type        : <0xad97>
    <b629>   DW_AT_data_member_location: 20
 <2><b62a>: Abbrev Number: 8 (DW_TAG_member)
    <b62b>   DW_AT_name        : (indirect string, offset: 0xfaa): unused3
    <b62f>   DW_AT_decl_file   : 14
    <b630>   DW_AT_decl_line   : 115
    <b631>   DW_AT_decl_column : 12
    <b632>   DW_AT_type        : <0xad97>
    <b636>   DW_AT_data_member_location: 24
 <2><b637>: Abbrev Number: 8 (DW_TAG_member)
    <b638>   DW_AT_name        : (indirect string, offset: 0x495b): scatter_offsets
    <b63c>   DW_AT_decl_file   : 14
    <b63d>   DW_AT_decl_line   : 116
    <b63e>   DW_AT_decl_column : 36
    <b63f>   DW_AT_type        : <0xb645>
    <b643>   DW_AT_data_member_location: 28
 <2><b644>: Abbrev Number: 0
 <1><b645>: Abbrev Number: 37 (DW_TAG_pointer_type)
    <b646>   DW_AT_byte_size   : 4
    <b647>   DW_AT_type        : <0xb299>
 <1><b64b>: Abbrev Number: 7 (DW_TAG_structure_type)
    <b64c>   DW_AT_name        : (indirect string, offset: 0x28a4): dram_io_state_t
    <b650>   DW_AT_byte_size   : 96
    <b651>   DW_AT_decl_file   : 14
    <b652>   DW_AT_decl_line   : 124
    <b653>   DW_AT_decl_column : 8
    <b654>   DW_AT_sibling     : <0xb89c>
 <2><b658>: Abbrev Number: 38 (DW_TAG_union_type)
    <b659>   DW_AT_byte_size   : 8
    <b65a>   DW_AT_decl_file   : 14
    <b65b>   DW_AT_decl_line   : 151
    <b65c>   DW_AT_decl_column : 9
    <b65d>   DW_AT_sibling     : <0xb6c1>
 <3><b661>: Abbrev Number: 20 (DW_TAG_structure_type)
    <b662>   DW_AT_byte_size   : 8
    <b663>   DW_AT_decl_file   : 14
    <b664>   DW_AT_decl_line   : 152
    <b665>   DW_AT_decl_column : 12
    <b666>   DW_AT_sibling     : <0xb69f>
 <4><b66a>: Abbrev Number: 8 (DW_TAG_member)
    <b66b>   DW_AT_name        : (indirect string, offset: 0x4a4): wr_lrd_ptr_autoinc
    <b66f>   DW_AT_decl_file   : 14
    <b670>   DW_AT_decl_line   : 153
    <b671>   DW_AT_decl_column : 16
    <b672>   DW_AT_type        : <0xad75>
    <b676>   DW_AT_data_member_location: 0
 <4><b677>: Abbrev Number: 8 (DW_TAG_member)
    <b678>   DW_AT_name        : (indirect string, offset: 0xfa2): unused2
    <b67c>   DW_AT_decl_file   : 14
    <b67d>   DW_AT_decl_line   : 154
    <b67e>   DW_AT_decl_column : 16
    <b67f>   DW_AT_type        : <0xad75>
    <b683>   DW_AT_data_member_location: 2
 <4><b684>: Abbrev Number: 8 (DW_TAG_member)
    <b685>   DW_AT_name        : (indirect string, offset: 0xd72): wr_queue_update_stride
    <b689>   DW_AT_decl_file   : 14
    <b68a>   DW_AT_decl_line   : 155
    <b68b>   DW_AT_decl_column : 16
    <b68c>   DW_AT_type        : <0xad75>
    <b690>   DW_AT_data_member_location: 4
 <4><b691>: Abbrev Number: 8 (DW_TAG_member)
    <b692>   DW_AT_name        : (indirect string, offset: 0xfaa): unused3
    <b696>   DW_AT_decl_file   : 14
    <b697>   DW_AT_decl_line   : 156
    <b698>   DW_AT_decl_column : 16
    <b699>   DW_AT_type        : <0xad75>
    <b69d>   DW_AT_data_member_location: 6
 <4><b69e>: Abbrev Number: 0
 <3><b69f>: Abbrev Number: 20 (DW_TAG_structure_type)
    <b6a0>   DW_AT_byte_size   : 8
    <b6a1>   DW_AT_decl_file   : 14
    <b6a2>   DW_AT_decl_line   : 158
    <b6a3>   DW_AT_decl_column : 12
    <b6a4>   DW_AT_sibling     : <0xb6b6>
 <4><b6a8>: Abbrev Number: 8 (DW_TAG_member)
    <b6a9>   DW_AT_name        : (indirect string, offset: 0x479): dram_streaming_header_addr
    <b6ad>   DW_AT_decl_file   : 14
    <b6ae>   DW_AT_decl_line   : 159
    <b6af>   DW_AT_decl_column : 19
    <b6b0>   DW_AT_type        : <0xb25a>
    <b6b4>   DW_AT_data_member_location: 0
 <4><b6b5>: Abbrev Number: 0
 <3><b6b6>: Abbrev Number: 23 (DW_TAG_member)
    <b6b7>   DW_AT_type        : <0xb661>
 <3><b6bb>: Abbrev Number: 23 (DW_TAG_member)
    <b6bc>   DW_AT_type        : <0xb69f>
 <3><b6c0>: Abbrev Number: 0
 <2><b6c1>: Abbrev Number: 8 (DW_TAG_member)
    <b6c2>   DW_AT_name        : (indirect string, offset: 0x6af): rd_dram_rdptr
    <b6c6>   DW_AT_decl_file   : 14
    <b6c7>   DW_AT_decl_line   : 126
    <b6c8>   DW_AT_decl_column : 12
    <b6c9>   DW_AT_type        : <0xad75>
    <b6cd>   DW_AT_data_member_location: 0
 <2><b6ce>: Abbrev Number: 8 (DW_TAG_member)
    <b6cf>   DW_AT_name        : (indirect string, offset: 0x2ad8): rd_grd_ptr_autoinc
    <b6d3>   DW_AT_decl_file   : 14
    <b6d4>   DW_AT_decl_line   : 127
    <b6d5>   DW_AT_decl_column : 12
    <b6d6>   DW_AT_type        : <0xad75>
    <b6da>   DW_AT_data_member_location: 2
 <2><b6db>: Abbrev Number: 8 (DW_TAG_member)
    <b6dc>   DW_AT_name        : (indirect string, offset: 0x158f): rd_dram_wrptr
    <b6e0>   DW_AT_decl_file   : 14
    <b6e1>   DW_AT_decl_line   : 128
    <b6e2>   DW_AT_decl_column : 12
    <b6e3>   DW_AT_type        : <0xad75>
    <b6e7>   DW_AT_data_member_location: 4
 <2><b6e8>: Abbrev Number: 8 (DW_TAG_member)
    <b6e9>   DW_AT_name        : (indirect string, offset: 0xa6b): rd_gwr_ptr_autoinc
    <b6ed>   DW_AT_decl_file   : 14
    <b6ee>   DW_AT_decl_line   : 129
    <b6ef>   DW_AT_decl_column : 12
    <b6f0>   DW_AT_type        : <0xad75>
    <b6f4>   DW_AT_data_member_location: 6
 <2><b6f5>: Abbrev Number: 8 (DW_TAG_member)
    <b6f6>   DW_AT_name        : (indirect string, offset: 0x26ff): rd_dram_local_rdptr
    <b6fa>   DW_AT_decl_file   : 14
    <b6fb>   DW_AT_decl_line   : 130
    <b6fc>   DW_AT_decl_column : 12
    <b6fd>   DW_AT_type        : <0xad75>
    <b701>   DW_AT_data_member_location: 8
 <2><b702>: Abbrev Number: 8 (DW_TAG_member)
    <b703>   DW_AT_name        : (indirect string, offset: 0x13c9): rd_epoch_id_tag
    <b707>   DW_AT_decl_file   : 14
    <b708>   DW_AT_decl_line   : 131
    <b709>   DW_AT_decl_column : 12
    <b70a>   DW_AT_type        : <0xad75>
    <b70e>   DW_AT_data_member_location: 10
 <2><b70f>: Abbrev Number: 8 (DW_TAG_member)
    <b710>   DW_AT_name        : (indirect string, offset: 0x2e3c): rd_stride
    <b714>   DW_AT_decl_file   : 14
    <b715>   DW_AT_decl_line   : 132
    <b716>   DW_AT_decl_column : 12
    <b717>   DW_AT_type        : <0xad75>
    <b71b>   DW_AT_data_member_location: 12
 <2><b71c>: Abbrev Number: 8 (DW_TAG_member)
    <b71d>   DW_AT_name        : (indirect string, offset: 0x29ae): rd_flags
    <b721>   DW_AT_decl_file   : 14
    <b722>   DW_AT_decl_line   : 133
    <b723>   DW_AT_decl_column : 12
    <b724>   DW_AT_type        : <0xad75>
    <b728>   DW_AT_data_member_location: 14
 <2><b729>: Abbrev Number: 8 (DW_TAG_member)
    <b72a>   DW_AT_name        : (indirect string, offset: 0x2d35): rd_lrd_ptr_autoinc
    <b72e>   DW_AT_decl_file   : 14
    <b72f>   DW_AT_decl_line   : 134
    <b730>   DW_AT_decl_column : 12
    <b731>   DW_AT_type        : <0xad75>
    <b735>   DW_AT_data_member_location: 16
 <2><b736>: Abbrev Number: 8 (DW_TAG_member)
    <b737>   DW_AT_name        : (indirect string, offset: 0xf92): unused0
    <b73b>   DW_AT_decl_file   : 14
    <b73c>   DW_AT_decl_line   : 135
    <b73d>   DW_AT_decl_column : 12
    <b73e>   DW_AT_type        : <0xad75>
    <b742>   DW_AT_data_member_location: 18
 <2><b743>: Abbrev Number: 8 (DW_TAG_member)
    <b744>   DW_AT_name        : (indirect string, offset: 0x779): rd_queue_update_stride
    <b748>   DW_AT_decl_file   : 14
    <b749>   DW_AT_decl_line   : 136
    <b74a>   DW_AT_decl_column : 12
    <b74b>   DW_AT_type        : <0xad75>
    <b74f>   DW_AT_data_member_location: 20
 <2><b750>: Abbrev Number: 8 (DW_TAG_member)
    <b751>   DW_AT_name        : (indirect string, offset: 0xf9a): unused1
    <b755>   DW_AT_decl_file   : 14
    <b756>   DW_AT_decl_line   : 137
    <b757>   DW_AT_decl_column : 12
    <b758>   DW_AT_type        : <0xad75>
    <b75c>   DW_AT_data_member_location: 22
 <2><b75d>: Abbrev Number: 8 (DW_TAG_member)
    <b75e>   DW_AT_name        : (indirect string, offset: 0xe8c): dram_streaming_epoch_id
    <b762>   DW_AT_decl_file   : 14
    <b763>   DW_AT_decl_line   : 138
    <b764>   DW_AT_decl_column : 12
    <b765>   DW_AT_type        : <0xad97>
    <b769>   DW_AT_data_member_location: 24
 <2><b76a>: Abbrev Number: 8 (DW_TAG_member)
    <b76b>   DW_AT_name        : (indirect string, offset: 0x1ff5): dram_streaming_tag
    <b76f>   DW_AT_decl_file   : 14
    <b770>   DW_AT_decl_line   : 139
    <b771>   DW_AT_decl_column : 12
    <b772>   DW_AT_type        : <0xad97>
    <b776>   DW_AT_data_member_location: 28
 <2><b777>: Abbrev Number: 8 (DW_TAG_member)
    <b778>   DW_AT_name        : (indirect string, offset: 0x1732): wr_dram_rdptr
    <b77c>   DW_AT_decl_file   : 14
    <b77d>   DW_AT_decl_line   : 142
    <b77e>   DW_AT_decl_column : 12
    <b77f>   DW_AT_type        : <0xad75>
    <b783>   DW_AT_data_member_location: 32
 <2><b784>: Abbrev Number: 8 (DW_TAG_member)
    <b785>   DW_AT_name        : (indirect string, offset: 0x228): wr_grd_ptr_autoinc
    <b789>   DW_AT_decl_file   : 14
    <b78a>   DW_AT_decl_line   : 143
    <b78b>   DW_AT_decl_column : 12
    <b78c>   DW_AT_type        : <0xad75>
    <b790>   DW_AT_data_member_location: 34
 <2><b791>: Abbrev Number: 8 (DW_TAG_member)
    <b792>   DW_AT_name        : (indirect string, offset: 0x232b): wr_dram_wrptr
    <b796>   DW_AT_decl_file   : 14
    <b797>   DW_AT_decl_line   : 144
    <b798>   DW_AT_decl_column : 12
    <b799>   DW_AT_type        : <0xad75>
    <b79d>   DW_AT_data_member_location: 36
 <2><b79e>: Abbrev Number: 8 (DW_TAG_member)
    <b79f>   DW_AT_name        : (indirect string, offset: 0xef9): wr_gwr_ptr_autoinc
    <b7a3>   DW_AT_decl_file   : 14
    <b7a4>   DW_AT_decl_line   : 145
    <b7a5>   DW_AT_decl_column : 12
    <b7a6>   DW_AT_type        : <0xad75>
    <b7aa>   DW_AT_data_member_location: 38
 <2><b7ab>: Abbrev Number: 8 (DW_TAG_member)
    <b7ac>   DW_AT_name        : (indirect string, offset: 0x2ab6): wr_dram_local_rdptr
    <b7b0>   DW_AT_decl_file   : 14
    <b7b1>   DW_AT_decl_line   : 146
    <b7b2>   DW_AT_decl_column : 12
    <b7b3>   DW_AT_type        : <0xad75>
    <b7b7>   DW_AT_data_member_location: 40
 <2><b7b8>: Abbrev Number: 8 (DW_TAG_member)
    <b7b9>   DW_AT_name        : (indirect string, offset: 0xf0c): wr_epoch_id_tag
    <b7bd>   DW_AT_decl_file   : 14
    <b7be>   DW_AT_decl_line   : 147
    <b7bf>   DW_AT_decl_column : 12
    <b7c0>   DW_AT_type        : <0xad75>
    <b7c4>   DW_AT_data_member_location: 42
 <2><b7c5>: Abbrev Number: 8 (DW_TAG_member)
    <b7c6>   DW_AT_name        : (indirect string, offset: 0xa3b): wr_stride
    <b7ca>   DW_AT_decl_file   : 14
    <b7cb>   DW_AT_decl_line   : 148
    <b7cc>   DW_AT_decl_column : 12
    <b7cd>   DW_AT_type        : <0xad75>
    <b7d1>   DW_AT_data_member_location: 44
 <2><b7d2>: Abbrev Number: 8 (DW_TAG_member)
    <b7d3>   DW_AT_name        : (indirect string, offset: 0x284b): wr_flags
    <b7d7>   DW_AT_decl_file   : 14
    <b7d8>   DW_AT_decl_line   : 149
    <b7d9>   DW_AT_decl_column : 12
    <b7da>   DW_AT_type        : <0xad75>
    <b7de>   DW_AT_data_member_location: 46
 <2><b7df>: Abbrev Number: 39 (DW_TAG_member)
    <b7e0>   DW_AT_type        : <0xb658>
    <b7e4>   DW_AT_data_member_location: 48
 <2><b7e5>: Abbrev Number: 8 (DW_TAG_member)
    <b7e6>   DW_AT_name        : (indirect string, offset: 0x2c47): data_chunk_size_bytes
    <b7ea>   DW_AT_decl_file   : 14
    <b7eb>   DW_AT_decl_line   : 162
    <b7ec>   DW_AT_decl_column : 12
    <b7ed>   DW_AT_type        : <0xad97>
    <b7f1>   DW_AT_data_member_location: 56
 <2><b7f2>: Abbrev Number: 8 (DW_TAG_member)
    <b7f3>   DW_AT_name        : (indirect string, offset: 0x5b8): data_chunk_size_tiles
    <b7f7>   DW_AT_decl_file   : 14
    <b7f8>   DW_AT_decl_line   : 163
    <b7f9>   DW_AT_decl_column : 12
    <b7fa>   DW_AT_type        : <0xad75>
    <b7fe>   DW_AT_data_member_location: 60
 <2><b7ff>: Abbrev Number: 8 (DW_TAG_member)
    <b800>   DW_AT_name        : (indirect string, offset: 0x411d): dram_padding
    <b804>   DW_AT_decl_file   : 14
    <b805>   DW_AT_decl_line   : 164
    <b806>   DW_AT_decl_column : 11
    <b807>   DW_AT_type        : <0xad53>
    <b80b>   DW_AT_data_member_location: 62
 <2><b80c>: Abbrev Number: 8 (DW_TAG_member)
    <b80d>   DW_AT_name        : (indirect string, offset: 0xfb2): unused4
    <b811>   DW_AT_decl_file   : 14
    <b812>   DW_AT_decl_line   : 165
    <b813>   DW_AT_decl_column : 11
    <b814>   DW_AT_type        : <0xad53>
    <b818>   DW_AT_data_member_location: 63
 <2><b819>: Abbrev Number: 8 (DW_TAG_member)
    <b81a>   DW_AT_name        : (indirect string, offset: 0x95c): dram_buf_size_bytes
    <b81e>   DW_AT_decl_file   : 14
    <b81f>   DW_AT_decl_line   : 169
    <b820>   DW_AT_decl_column : 12
    <b821>   DW_AT_type        : <0xad97>
    <b825>   DW_AT_data_member_location: 64
 <2><b826>: Abbrev Number: 8 (DW_TAG_member)
    <b827>   DW_AT_name        : (indirect string, offset: 0xfe5): dram_buf_size_q_slots
    <b82b>   DW_AT_decl_file   : 14
    <b82c>   DW_AT_decl_line   : 170
    <b82d>   DW_AT_decl_column : 12
    <b82e>   DW_AT_type        : <0xad97>
    <b832>   DW_AT_data_member_location: 68
 <2><b833>: Abbrev Number: 8 (DW_TAG_member)
    <b834>   DW_AT_name        : (indirect string, offset: 0x2f62): dram_buf_addr
    <b838>   DW_AT_decl_file   : 14
    <b839>   DW_AT_decl_line   : 171
    <b83a>   DW_AT_decl_column : 15
    <b83b>   DW_AT_type        : <0xb25a>
    <b83f>   DW_AT_data_member_location: 72
 <2><b840>: Abbrev Number: 8 (DW_TAG_member)
    <b841>   DW_AT_name        : (indirect string, offset: 0x2ff7): dram_q_slot_size_tiles
    <b845>   DW_AT_decl_file   : 14
    <b846>   DW_AT_decl_line   : 172
    <b847>   DW_AT_decl_column : 12
    <b848>   DW_AT_type        : <0xad97>
    <b84c>   DW_AT_data_member_location: 80
 <2><b84d>: Abbrev Number: 8 (DW_TAG_member)
    <b84e>   DW_AT_name        : (indirect string, offset: 0x5b9b): reader_index
    <b852>   DW_AT_decl_file   : 14
    <b853>   DW_AT_decl_line   : 173
    <b854>   DW_AT_decl_column : 11
    <b855>   DW_AT_type        : <0xad53>
    <b859>   DW_AT_data_member_location: 84
 <2><b85a>: Abbrev Number: 8 (DW_TAG_member)
    <b85b>   DW_AT_name        : (indirect string, offset: 0x1938): total_readers
    <b85f>   DW_AT_decl_file   : 14
    <b860>   DW_AT_decl_line   : 174
    <b861>   DW_AT_decl_column : 11
    <b862>   DW_AT_type        : <0xad53>
    <b866>   DW_AT_data_member_location: 85
 <2><b867>: Abbrev Number: 8 (DW_TAG_member)
    <b868>   DW_AT_name        : (indirect string, offset: 0x1f23): dram_decoupled
    <b86c>   DW_AT_decl_file   : 14
    <b86d>   DW_AT_decl_line   : 175
    <b86e>   DW_AT_decl_column : 11
    <b86f>   DW_AT_type        : <0xad53>
    <b873>   DW_AT_data_member_location: 86
 <2><b874>: Abbrev Number: 8 (DW_TAG_member)
    <b875>   DW_AT_name        : (indirect string, offset: 0x311e): stride_wrap
    <b879>   DW_AT_decl_file   : 14
    <b87a>   DW_AT_decl_line   : 178
    <b87b>   DW_AT_decl_column : 11
    <b87c>   DW_AT_type        : <0xad53>
    <b880>   DW_AT_data_member_location: 87
 <2><b881>: Abbrev Number: 8 (DW_TAG_member)
    <b882>   DW_AT_name        : (indirect string, offset: 0x12bb): dram_io_scatter_state
    <b886>   DW_AT_decl_file   : 14
    <b887>   DW_AT_decl_line   : 179
    <b888>   DW_AT_decl_column : 46
    <b889>   DW_AT_type        : <0xb89c>
    <b88d>   DW_AT_data_member_location: 88
 <2><b88e>: Abbrev Number: 8 (DW_TAG_member)
    <b88f>   DW_AT_name        : (indirect string, offset: 0x553): next
    <b893>   DW_AT_decl_file   : 14
    <b894>   DW_AT_decl_line   : 180
    <b895>   DW_AT_decl_column : 38
    <b896>   DW_AT_type        : <0xb8a2>
    <b89a>   DW_AT_data_member_location: 92
 <2><b89b>: Abbrev Number: 0
 <1><b89c>: Abbrev Number: 37 (DW_TAG_pointer_type)
    <b89d>   DW_AT_byte_size   : 4
    <b89e>   DW_AT_type        : <0xb5cf>
 <1><b8a2>: Abbrev Number: 37 (DW_TAG_pointer_type)
    <b8a3>   DW_AT_byte_size   : 4
    <b8a4>   DW_AT_type        : <0xb64b>
 <1><b8a8>: Abbrev Number: 2 (DW_TAG_typedef)
    <b8a9>   DW_AT_name        : (indirect string, offset: 0x28a4): dram_io_state_t
    <b8ad>   DW_AT_decl_file   : 14
    <b8ae>   DW_AT_decl_line   : 183
    <b8af>   DW_AT_decl_column : 32
    <b8b0>   DW_AT_type        : <0xb64b>
 <1><b8b4>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <b8b5>   DW_AT_type        : <0xb8a8>
 <1><b8b9>: Abbrev Number: 40 (DW_TAG_structure_type)
    <b8ba>   DW_AT_byte_size   : 32
    <b8bb>   DW_AT_decl_file   : 14
    <b8bc>   DW_AT_decl_line   : 189
    <b8bd>   DW_AT_decl_column : 16
    <b8be>   DW_AT_linkage_name: (indirect string, offset: 0x1790): 27epoch_stream_dram_io_info_t
    <b8c2>   DW_AT_sibling     : <0xb9b3>
 <2><b8c6>: Abbrev Number: 38 (DW_TAG_union_type)
    <b8c7>   DW_AT_byte_size   : 2
    <b8c8>   DW_AT_decl_file   : 14
    <b8c9>   DW_AT_decl_line   : 196
    <b8ca>   DW_AT_decl_column : 8
    <b8cb>   DW_AT_sibling     : <0xb8e8>
 <3><b8cf>: Abbrev Number: 41 (DW_TAG_member)
    <b8d0>   DW_AT_name        : (indirect string, offset: 0xd53): scatter_list_indicies_per_tile
    <b8d4>   DW_AT_decl_file   : 14
    <b8d5>   DW_AT_decl_line   : 197
    <b8d6>   DW_AT_decl_column : 14
    <b8d7>   DW_AT_type        : <0xad75>
 <3><b8db>: Abbrev Number: 41 (DW_TAG_member)
    <b8dc>   DW_AT_name        : (indirect string, offset: 0x1cfc): c_dim_loop_num_rows
    <b8e0>   DW_AT_decl_file   : 14
    <b8e1>   DW_AT_decl_line   : 198
    <b8e2>   DW_AT_decl_column : 14
    <b8e3>   DW_AT_type        : <0xad75>
 <3><b8e7>: Abbrev Number: 0
 <2><b8e8>: Abbrev Number: 38 (DW_TAG_union_type)
    <b8e9>   DW_AT_byte_size   : 4
    <b8ea>   DW_AT_decl_file   : 14
    <b8eb>   DW_AT_decl_line   : 200
    <b8ec>   DW_AT_decl_column : 8
    <b8ed>   DW_AT_sibling     : <0xb90a>
 <3><b8f1>: Abbrev Number: 41 (DW_TAG_member)
    <b8f2>   DW_AT_name        : (indirect string, offset: 0x70c): scatter_list_indicies_per_input
    <b8f6>   DW_AT_decl_file   : 14
    <b8f7>   DW_AT_decl_line   : 201
    <b8f8>   DW_AT_decl_column : 14
    <b8f9>   DW_AT_type        : <0xad97>
 <3><b8fd>: Abbrev Number: 41 (DW_TAG_member)
    <b8fe>   DW_AT_name        : (indirect string, offset: 0x1cda): tilize_row_col_offset
    <b902>   DW_AT_decl_file   : 14
    <b903>   DW_AT_decl_line   : 202
    <b904>   DW_AT_decl_column : 14
    <b905>   DW_AT_type        : <0xad97>
 <3><b909>: Abbrev Number: 0
 <2><b90a>: Abbrev Number: 8 (DW_TAG_member)
    <b90b>   DW_AT_name        : (indirect string, offset: 0x2792): dram_q_slot_size_bytes
    <b90f>   DW_AT_decl_file   : 14
    <b910>   DW_AT_decl_line   : 190
    <b911>   DW_AT_decl_column : 12
    <b912>   DW_AT_type        : <0xad97>
    <b916>   DW_AT_data_member_location: 0
 <2><b917>: Abbrev Number: 8 (DW_TAG_member)
    <b918>   DW_AT_name        : (indirect string, offset: 0x5112): input_noc
    <b91c>   DW_AT_decl_file   : 14
    <b91d>   DW_AT_decl_line   : 191
    <b91e>   DW_AT_decl_column : 11
    <b91f>   DW_AT_type        : <0xad53>
    <b923>   DW_AT_data_member_location: 4
 <2><b924>: Abbrev Number: 8 (DW_TAG_member)
    <b925>   DW_AT_name        : (indirect string, offset: 0x40a0): output_noc
    <b929>   DW_AT_decl_file   : 14
    <b92a>   DW_AT_decl_line   : 192
    <b92b>   DW_AT_decl_column : 11
    <b92c>   DW_AT_type        : <0xad53>
    <b930>   DW_AT_data_member_location: 5
 <2><b931>: Abbrev Number: 8 (DW_TAG_member)
    <b932>   DW_AT_name        : (indirect string, offset: 0x2339): dram_output_no_push
    <b936>   DW_AT_decl_file   : 14
    <b937>   DW_AT_decl_line   : 193
    <b938>   DW_AT_decl_column : 11
    <b939>   DW_AT_type        : <0xad53>
    <b93d>   DW_AT_data_member_location: 6
 <2><b93e>: Abbrev Number: 8 (DW_TAG_member)
    <b93f>   DW_AT_name        : (indirect string, offset: 0x1393): has_multi_readers
    <b943>   DW_AT_decl_file   : 14
    <b944>   DW_AT_decl_line   : 194
    <b945>   DW_AT_decl_column : 11
    <b946>   DW_AT_type        : <0xad53>
    <b94a>   DW_AT_data_member_location: 7
 <2><b94b>: Abbrev Number: 8 (DW_TAG_member)
    <b94c>   DW_AT_name        : (indirect string, offset: 0x1e8c): scatter_list_stream_id
    <b950>   DW_AT_decl_file   : 14
    <b951>   DW_AT_decl_line   : 195
    <b952>   DW_AT_decl_column : 12
    <b953>   DW_AT_type        : <0xad75>
    <b957>   DW_AT_data_member_location: 8
 <2><b958>: Abbrev Number: 39 (DW_TAG_member)
    <b959>   DW_AT_type        : <0xb8c6>
    <b95d>   DW_AT_data_member_location: 10
 <2><b95e>: Abbrev Number: 39 (DW_TAG_member)
    <b95f>   DW_AT_type        : <0xb8e8>
    <b963>   DW_AT_data_member_location: 12
 <2><b964>: Abbrev Number: 8 (DW_TAG_member)
    <b965>   DW_AT_name        : (indirect string, offset: 0xe5d): dram_embeddings_row_shift
    <b969>   DW_AT_decl_file   : 14
    <b96a>   DW_AT_decl_line   : 204
    <b96b>   DW_AT_decl_column : 12
    <b96c>   DW_AT_type        : <0xad97>
    <b970>   DW_AT_data_member_location: 16
 <2><b971>: Abbrev Number: 8 (DW_TAG_member)
    <b972>   DW_AT_name        : (indirect string, offset: 0x519): epoch_q_slots_remaining
    <b976>   DW_AT_decl_file   : 14
    <b977>   DW_AT_decl_line   : 205
    <b978>   DW_AT_decl_column : 12
    <b979>   DW_AT_type        : <0xad97>
    <b97d>   DW_AT_data_member_location: 20
 <2><b97e>: Abbrev Number: 8 (DW_TAG_member)
    <b97f>   DW_AT_name        : (indirect string, offset: 0x11e6): dram_embeddings_row_tiles
    <b983>   DW_AT_decl_file   : 14
    <b984>   DW_AT_decl_line   : 206
    <b985>   DW_AT_decl_column : 12
    <b986>   DW_AT_type        : <0xad75>
    <b98a>   DW_AT_data_member_location: 24
 <2><b98b>: Abbrev Number: 8 (DW_TAG_member)
    <b98c>   DW_AT_name        : (indirect string, offset: 0x6efc): dram_writes_with_cmd_buf
    <b990>   DW_AT_decl_file   : 14
    <b991>   DW_AT_decl_line   : 207
    <b992>   DW_AT_decl_column : 11
    <b993>   DW_AT_type        : <0xad53>
    <b997>   DW_AT_data_member_location: 26
 <2><b998>: Abbrev Number: 8 (DW_TAG_member)
    <b999>   DW_AT_name        : (indirect string, offset: 0x2037): hw_tilize
    <b99d>   DW_AT_decl_file   : 14
    <b99e>   DW_AT_decl_line   : 208
    <b99f>   DW_AT_decl_column : 11
    <b9a0>   DW_AT_type        : <0xad53>
    <b9a4>   DW_AT_data_member_location: 27
 <2><b9a5>: Abbrev Number: 8 (DW_TAG_member)
    <b9a6>   DW_AT_name        : (indirect string, offset: 0x531a): dram_io_state
    <b9aa>   DW_AT_decl_file   : 14
    <b9ab>   DW_AT_decl_line   : 209
    <b9ac>   DW_AT_decl_column : 39
    <b9ad>   DW_AT_type        : <0xb9b3>
    <b9b1>   DW_AT_data_member_location: 28
 <2><b9b2>: Abbrev Number: 0
 <1><b9b3>: Abbrev Number: 37 (DW_TAG_pointer_type)
    <b9b4>   DW_AT_byte_size   : 4
    <b9b5>   DW_AT_type        : <0xb8b4>
 <1><b9b9>: Abbrev Number: 2 (DW_TAG_typedef)
    <b9ba>   DW_AT_name        : (indirect string, offset: 0x1792): epoch_stream_dram_io_info_t
    <b9be>   DW_AT_decl_file   : 14
    <b9bf>   DW_AT_decl_line   : 210
    <b9c0>   DW_AT_decl_column : 3
    <b9c1>   DW_AT_type        : <0xb8b9>
 <1><b9c5>: Abbrev Number: 40 (DW_TAG_structure_type)
    <b9c6>   DW_AT_byte_size   : 160
    <b9c7>   DW_AT_decl_file   : 14
    <b9c8>   DW_AT_decl_line   : 216
    <b9c9>   DW_AT_decl_column : 16
    <b9ca>   DW_AT_linkage_name: (indirect string, offset: 0x2a74): 19epoch_stream_info_t
    <b9ce>   DW_AT_sibling     : <0xbcff>
 <2><b9d2>: Abbrev Number: 38 (DW_TAG_union_type)
    <b9d3>   DW_AT_byte_size   : 4
    <b9d4>   DW_AT_decl_file   : 14
    <b9d5>   DW_AT_decl_line   : 247
    <b9d6>   DW_AT_decl_column : 8
    <b9d7>   DW_AT_sibling     : <0xb9f4>
 <3><b9db>: Abbrev Number: 41 (DW_TAG_member)
    <b9dc>   DW_AT_name        : (indirect string, offset: 0x2251): skip_col_bytes
    <b9e0>   DW_AT_decl_file   : 14
    <b9e1>   DW_AT_decl_line   : 248
    <b9e2>   DW_AT_decl_column : 14
    <b9e3>   DW_AT_type        : <0xad97>
 <3><b9e7>: Abbrev Number: 41 (DW_TAG_member)
    <b9e8>   DW_AT_name        : (indirect string, offset: 0x1a04): pipe_scatter_output_loop_size
    <b9ec>   DW_AT_decl_file   : 14
    <b9ed>   DW_AT_decl_line   : 249
    <b9ee>   DW_AT_decl_column : 14
    <b9ef>   DW_AT_type        : <0xad97>
 <3><b9f3>: Abbrev Number: 0
 <2><b9f4>: Abbrev Number: 38 (DW_TAG_union_type)
    <b9f5>   DW_AT_byte_size   : 4
    <b9f6>   DW_AT_decl_file   : 14
    <b9f7>   DW_AT_decl_line   : 251
    <b9f8>   DW_AT_decl_column : 8
    <b9f9>   DW_AT_sibling     : <0xba16>
 <3><b9fd>: Abbrev Number: 41 (DW_TAG_member)
    <b9fe>   DW_AT_name        : (indirect string, offset: 0x25b6): skip_col_tile_row_bytes
    <ba02>   DW_AT_decl_file   : 14
    <ba03>   DW_AT_decl_line   : 252
    <ba04>   DW_AT_decl_column : 14
    <ba05>   DW_AT_type        : <0xad97>
 <3><ba09>: Abbrev Number: 41 (DW_TAG_member)
    <ba0a>   DW_AT_name        : (indirect string, offset: 0x2526): scatter_pipe_state
    <ba0e>   DW_AT_decl_file   : 14
    <ba0f>   DW_AT_decl_line   : 253
    <ba10>   DW_AT_decl_column : 38
    <ba11>   DW_AT_type        : <0xbcff>
 <3><ba15>: Abbrev Number: 0
 <2><ba16>: Abbrev Number: 38 (DW_TAG_union_type)
    <ba17>   DW_AT_byte_size   : 4
    <ba18>   DW_AT_decl_file   : 14
    <ba19>   DW_AT_decl_line   : 255
    <ba1a>   DW_AT_decl_column : 8
    <ba1b>   DW_AT_sibling     : <0xba3a>
 <3><ba1f>: Abbrev Number: 42 (DW_TAG_member)
    <ba20>   DW_AT_name        : (indirect string, offset: 0x2bf7): skip_col_row_bytes
    <ba24>   DW_AT_decl_file   : 14
    <ba25>   DW_AT_decl_line   : 256
    <ba27>   DW_AT_decl_column : 14
    <ba28>   DW_AT_type        : <0xad97>
 <3><ba2c>: Abbrev Number: 42 (DW_TAG_member)
    <ba2d>   DW_AT_name        : (indirect string, offset: 0x2e9a): scatter_idx
    <ba31>   DW_AT_decl_file   : 14
    <ba32>   DW_AT_decl_line   : 257
    <ba34>   DW_AT_decl_column : 14
    <ba35>   DW_AT_type        : <0xad97>
 <3><ba39>: Abbrev Number: 0
 <2><ba3a>: Abbrev Number: 43 (DW_TAG_union_type)
    <ba3b>   DW_AT_byte_size   : 4
    <ba3c>   DW_AT_decl_file   : 14
    <ba3d>   DW_AT_decl_line   : 259
    <ba3f>   DW_AT_decl_column : 8
    <ba40>   DW_AT_sibling     : <0xba5f>
 <3><ba44>: Abbrev Number: 42 (DW_TAG_member)
    <ba45>   DW_AT_name        : (indirect string, offset: 0x219b): skip_zcol_bytes
    <ba49>   DW_AT_decl_file   : 14
    <ba4a>   DW_AT_decl_line   : 260
    <ba4c>   DW_AT_decl_column : 14
    <ba4d>   DW_AT_type        : <0xad97>
 <3><ba51>: Abbrev Number: 42 (DW_TAG_member)
    <ba52>   DW_AT_name        : (indirect string, offset: 0x20a1): pipe_scatter_output_loop_count
    <ba56>   DW_AT_decl_file   : 14
    <ba57>   DW_AT_decl_line   : 261
    <ba59>   DW_AT_decl_column : 14
    <ba5a>   DW_AT_type        : <0xad97>
 <3><ba5e>: Abbrev Number: 0
 <2><ba5f>: Abbrev Number: 43 (DW_TAG_union_type)
    <ba60>   DW_AT_byte_size   : 4
    <ba61>   DW_AT_decl_file   : 14
    <ba62>   DW_AT_decl_line   : 263
    <ba64>   DW_AT_decl_column : 8
    <ba65>   DW_AT_sibling     : <0xba84>
 <3><ba69>: Abbrev Number: 42 (DW_TAG_member)
    <ba6a>   DW_AT_name        : (indirect string, offset: 0x1e78): skip_col_zrow_bytes
    <ba6e>   DW_AT_decl_file   : 14
    <ba6f>   DW_AT_decl_line   : 264
    <ba71>   DW_AT_decl_column : 14
    <ba72>   DW_AT_type        : <0xad97>
 <3><ba76>: Abbrev Number: 42 (DW_TAG_member)
    <ba77>   DW_AT_name        : (indirect string, offset: 0x298): num_iter_tiles
    <ba7b>   DW_AT_decl_file   : 14
    <ba7c>   DW_AT_decl_line   : 265
    <ba7e>   DW_AT_decl_column : 14
    <ba7f>   DW_AT_type        : <0xad97>
 <3><ba83>: Abbrev Number: 0
 <2><ba84>: Abbrev Number: 8 (DW_TAG_member)
    <ba85>   DW_AT_name        : (indirect string, offset: 0x210c): stream_id
    <ba89>   DW_AT_decl_file   : 14
    <ba8a>   DW_AT_decl_line   : 220
    <ba8b>   DW_AT_decl_column : 12
    <ba8c>   DW_AT_type        : <0xad75>
    <ba90>   DW_AT_data_member_location: 0
 <2><ba91>: Abbrev Number: 8 (DW_TAG_member)
    <ba92>   DW_AT_name        : (indirect string, offset: 0x1350): producer_epoch_id
    <ba96>   DW_AT_decl_file   : 14
    <ba97>   DW_AT_decl_line   : 221
    <ba98>   DW_AT_decl_column : 12
    <ba99>   DW_AT_type        : <0xad75>
    <ba9d>   DW_AT_data_member_location: 2
 <2><ba9e>: Abbrev Number: 8 (DW_TAG_member)
    <ba9f>   DW_AT_name        : (indirect string, offset: 0x2189): epoch_start_phase
    <baa3>   DW_AT_decl_file   : 14
    <baa4>   DW_AT_decl_line   : 222
    <baa5>   DW_AT_decl_column : 12
    <baa6>   DW_AT_type        : <0xad75>
    <baaa>   DW_AT_data_member_location: 4
 <2><baab>: Abbrev Number: 8 (DW_TAG_member)
    <baac>   DW_AT_name        : (indirect string, offset: 0x213): datacopy_stream_type
    <bab0>   DW_AT_decl_file   : 14
    <bab1>   DW_AT_decl_line   : 223
    <bab2>   DW_AT_decl_column : 26
    <bab3>   DW_AT_type        : <0xb4e6>
    <bab7>   DW_AT_data_member_location: 6
 <2><bab8>: Abbrev Number: 8 (DW_TAG_member)
    <bab9>   DW_AT_name        : (indirect string, offset: 0x1d2f): datacopy_stream_id
    <babd>   DW_AT_decl_file   : 14
    <babe>   DW_AT_decl_line   : 224
    <babf>   DW_AT_decl_column : 12
    <bac0>   DW_AT_type        : <0xad53>
    <bac4>   DW_AT_data_member_location: 7
 <2><bac5>: Abbrev Number: 8 (DW_TAG_member)
    <bac6>   DW_AT_name        : (indirect string, offset: 0x1c51): epoch_num_tiles
    <baca>   DW_AT_decl_file   : 14
    <bacb>   DW_AT_decl_line   : 225
    <bacc>   DW_AT_decl_column : 12
    <bacd>   DW_AT_type        : <0xad97>
    <bad1>   DW_AT_data_member_location: 8
 <2><bad2>: Abbrev Number: 8 (DW_TAG_member)
    <bad3>   DW_AT_name        : (indirect string, offset: 0x18ab): tile_size_words
    <bad7>   DW_AT_decl_file   : 14
    <bad8>   DW_AT_decl_line   : 226
    <bad9>   DW_AT_decl_column : 12
    <bada>   DW_AT_type        : <0xad97>
    <bade>   DW_AT_data_member_location: 12
 <2><badf>: Abbrev Number: 8 (DW_TAG_member)
    <bae0>   DW_AT_name        : (indirect string, offset: 0x3b73): buf_size_tiles
    <bae4>   DW_AT_decl_file   : 14
    <bae5>   DW_AT_decl_line   : 227
    <bae6>   DW_AT_decl_column : 12
    <bae7>   DW_AT_type        : <0xad97>
    <baeb>   DW_AT_data_member_location: 16
 <2><baec>: Abbrev Number: 8 (DW_TAG_member)
    <baed>   DW_AT_name        : (indirect string, offset: 0x24b4): buf_full_size_bytes
    <baf1>   DW_AT_decl_file   : 14
    <baf2>   DW_AT_decl_line   : 228
    <baf3>   DW_AT_decl_column : 12
    <baf4>   DW_AT_type        : <0xad97>
    <baf8>   DW_AT_data_member_location: 20
 <2><baf9>: Abbrev Number: 8 (DW_TAG_member)
    <bafa>   DW_AT_name        : (indirect string, offset: 0x166e): buf_base_addr
    <bafe>   DW_AT_decl_file   : 14
    <baff>   DW_AT_decl_line   : 229
    <bb00>   DW_AT_decl_column : 12
    <bb01>   DW_AT_type        : <0xad97>
    <bb05>   DW_AT_data_member_location: 24
 <2><bb06>: Abbrev Number: 8 (DW_TAG_member)
    <bb07>   DW_AT_name        : (indirect string, offset: 0x1ea3): num_msgs_in_block
    <bb0b>   DW_AT_decl_file   : 14
    <bb0c>   DW_AT_decl_line   : 230
    <bb0d>   DW_AT_decl_column : 12
    <bb0e>   DW_AT_type        : <0xad75>
    <bb12>   DW_AT_data_member_location: 28
 <2><bb13>: Abbrev Number: 8 (DW_TAG_member)
    <bb14>   DW_AT_name        : (indirect string, offset: 0x17ae): start_phase_num_cfg_regs
    <bb18>   DW_AT_decl_file   : 14
    <bb19>   DW_AT_decl_line   : 231
    <bb1a>   DW_AT_decl_column : 11
    <bb1b>   DW_AT_type        : <0xad53>
    <bb1f>   DW_AT_data_member_location: 30
 <2><bb20>: Abbrev Number: 8 (DW_TAG_member)
    <bb21>   DW_AT_name        : (indirect string, offset: 0x2028): packer_operand
    <bb25>   DW_AT_decl_file   : 14
    <bb26>   DW_AT_decl_line   : 232
    <bb27>   DW_AT_decl_column : 11
    <bb28>   DW_AT_type        : <0xad53>
    <bb2c>   DW_AT_data_member_location: 31
 <2><bb2d>: Abbrev Number: 8 (DW_TAG_member)
    <bb2e>   DW_AT_name        : (indirect string, offset: 0x2ccf): msg_info_buf_start
    <bb32>   DW_AT_decl_file   : 14
    <bb33>   DW_AT_decl_line   : 233
    <bb34>   DW_AT_decl_column : 12
    <bb35>   DW_AT_type        : <0xad97>
    <bb39>   DW_AT_data_member_location: 32
 <2><bb3a>: Abbrev Number: 8 (DW_TAG_member)
    <bb3b>   DW_AT_name        : (indirect string, offset: 0x261a): blob_start_addr
    <bb3f>   DW_AT_decl_file   : 14
    <bb40>   DW_AT_decl_line   : 234
    <bb41>   DW_AT_decl_column : 12
    <bb42>   DW_AT_type        : <0xad97>
    <bb46>   DW_AT_data_member_location: 36
 <2><bb47>: Abbrev Number: 8 (DW_TAG_member)
    <bb48>   DW_AT_name        : (indirect string, offset: 0x2150): blob_size
    <bb4c>   DW_AT_decl_file   : 14
    <bb4d>   DW_AT_decl_line   : 235
    <bb4e>   DW_AT_decl_column : 12
    <bb4f>   DW_AT_type        : <0xad97>
    <bb53>   DW_AT_data_member_location: 40
 <2><bb54>: Abbrev Number: 8 (DW_TAG_member)
    <bb55>   DW_AT_name        : (indirect string, offset: 0x301b): num_iters_in_epoch
    <bb59>   DW_AT_decl_file   : 14
    <bb5a>   DW_AT_decl_line   : 236
    <bb5b>   DW_AT_decl_column : 12
    <bb5c>   DW_AT_type        : <0xad97>
    <bb60>   DW_AT_data_member_location: 44
 <2><bb61>: Abbrev Number: 8 (DW_TAG_member)
    <bb62>   DW_AT_name        : (indirect string, offset: 0x42f): epoch_iters_remaining
    <bb66>   DW_AT_decl_file   : 14
    <bb67>   DW_AT_decl_line   : 237
    <bb68>   DW_AT_decl_column : 12
    <bb69>   DW_AT_type        : <0xad97>
    <bb6d>   DW_AT_data_member_location: 48
 <2><bb6e>: Abbrev Number: 8 (DW_TAG_member)
    <bb6f>   DW_AT_name        : (indirect string, offset: 0x28ed): num_scatter_inner_loop
    <bb73>   DW_AT_decl_file   : 14
    <bb74>   DW_AT_decl_line   : 238
    <bb75>   DW_AT_decl_column : 12
    <bb76>   DW_AT_type        : <0xad97>
    <bb7a>   DW_AT_data_member_location: 52
 <2><bb7b>: Abbrev Number: 8 (DW_TAG_member)
    <bb7c>   DW_AT_name        : (indirect string, offset: 0x25aa): legacy_pack
    <bb80>   DW_AT_decl_file   : 14
    <bb81>   DW_AT_decl_line   : 239
    <bb82>   DW_AT_decl_column : 11
    <bb83>   DW_AT_type        : <0xad53>
    <bb87>   DW_AT_data_member_location: 56
 <2><bb88>: Abbrev Number: 8 (DW_TAG_member)
    <bb89>   DW_AT_name        : (indirect string, offset: 0x2944): eth_remote_fw_stream_id
    <bb8d>   DW_AT_decl_file   : 14
    <bb8e>   DW_AT_decl_line   : 240
    <bb8f>   DW_AT_decl_column : 11
    <bb90>   DW_AT_type        : <0xad53>
    <bb94>   DW_AT_data_member_location: 57
 <2><bb95>: Abbrev Number: 8 (DW_TAG_member)
    <bb96>   DW_AT_name        : (indirect string, offset: 0x10f7): num_mblock_buffering
    <bb9a>   DW_AT_decl_file   : 14
    <bb9b>   DW_AT_decl_line   : 241
    <bb9c>   DW_AT_decl_column : 12
    <bb9d>   DW_AT_type        : <0xad75>
    <bba1>   DW_AT_data_member_location: 58
 <2><bba2>: Abbrev Number: 8 (DW_TAG_member)
    <bba3>   DW_AT_name        : (indirect string, offset: 0x29b1): flags
    <bba7>   DW_AT_decl_file   : 14
    <bba8>   DW_AT_decl_line   : 243
    <bba9>   DW_AT_decl_column : 12
    <bbaa>   DW_AT_type        : <0xad97>
    <bbae>   DW_AT_data_member_location: 60
 <2><bbaf>: Abbrev Number: 8 (DW_TAG_member)
    <bbb0>   DW_AT_name        : (indirect string, offset: 0x2e3f): stride
    <bbb4>   DW_AT_decl_file   : 14
    <bbb5>   DW_AT_decl_line   : 244
    <bbb6>   DW_AT_decl_column : 12
    <bbb7>   DW_AT_type        : <0xad75>
    <bbbb>   DW_AT_data_member_location: 64
 <2><bbbc>: Abbrev Number: 8 (DW_TAG_member)
    <bbbd>   DW_AT_name        : (indirect string, offset: 0x6a1): total_strides
    <bbc1>   DW_AT_decl_file   : 14
    <bbc2>   DW_AT_decl_line   : 245
    <bbc3>   DW_AT_decl_column : 12
    <bbc4>   DW_AT_type        : <0xad75>
    <bbc8>   DW_AT_data_member_location: 66
 <2><bbc9>: Abbrev Number: 8 (DW_TAG_member)
    <bbca>   DW_AT_name        : (indirect string, offset: 0xed6): stride_offset_size_bytes
    <bbce>   DW_AT_decl_file   : 14
    <bbcf>   DW_AT_decl_line   : 246
    <bbd0>   DW_AT_decl_column : 12
    <bbd1>   DW_AT_type        : <0xad97>
    <bbd5>   DW_AT_data_member_location: 68
 <2><bbd6>: Abbrev Number: 39 (DW_TAG_member)
    <bbd7>   DW_AT_type        : <0xb9d2>
    <bbdb>   DW_AT_data_member_location: 72
 <2><bbdc>: Abbrev Number: 39 (DW_TAG_member)
    <bbdd>   DW_AT_type        : <0xb9f4>
    <bbe1>   DW_AT_data_member_location: 76
 <2><bbe2>: Abbrev Number: 39 (DW_TAG_member)
    <bbe3>   DW_AT_type        : <0xba16>
    <bbe7>   DW_AT_data_member_location: 80
 <2><bbe8>: Abbrev Number: 39 (DW_TAG_member)
    <bbe9>   DW_AT_type        : <0xba3a>
    <bbed>   DW_AT_data_member_location: 84
 <2><bbee>: Abbrev Number: 39 (DW_TAG_member)
    <bbef>   DW_AT_type        : <0xba5f>
    <bbf3>   DW_AT_data_member_location: 88
 <2><bbf4>: Abbrev Number: 44 (DW_TAG_member)
    <bbf5>   DW_AT_name        : (indirect string, offset: 0x9e5): c_dim_size
    <bbf9>   DW_AT_decl_file   : 14
    <bbfa>   DW_AT_decl_line   : 267
    <bbfc>   DW_AT_decl_column : 12
    <bbfd>   DW_AT_type        : <0xad75>
    <bc01>   DW_AT_data_member_location: 92
 <2><bc02>: Abbrev Number: 44 (DW_TAG_member)
    <bc03>   DW_AT_name        : (indirect string, offset: 0xf45): r_dim_size
    <bc07>   DW_AT_decl_file   : 14
    <bc08>   DW_AT_decl_line   : 268
    <bc0a>   DW_AT_decl_column : 12
    <bc0b>   DW_AT_type        : <0xad75>
    <bc0f>   DW_AT_data_member_location: 94
 <2><bc10>: Abbrev Number: 44 (DW_TAG_member)
    <bc11>   DW_AT_name        : (indirect string, offset: 0x9e4): zc_dim_size
    <bc15>   DW_AT_decl_file   : 14
    <bc16>   DW_AT_decl_line   : 269
    <bc18>   DW_AT_decl_column : 12
    <bc19>   DW_AT_type        : <0xad75>
    <bc1d>   DW_AT_data_member_location: 96
 <2><bc1e>: Abbrev Number: 44 (DW_TAG_member)
    <bc1f>   DW_AT_name        : (indirect string, offset: 0xf44): zr_dim_size
    <bc23>   DW_AT_decl_file   : 14
    <bc24>   DW_AT_decl_line   : 270
    <bc26>   DW_AT_decl_column : 12
    <bc27>   DW_AT_type        : <0xad75>
    <bc2b>   DW_AT_data_member_location: 98
 <2><bc2c>: Abbrev Number: 44 (DW_TAG_member)
    <bc2d>   DW_AT_name        : (indirect string, offset: 0x1125): unused0_fw
    <bc31>   DW_AT_decl_file   : 14
    <bc32>   DW_AT_decl_line   : 273
    <bc34>   DW_AT_decl_column : 12
    <bc35>   DW_AT_type        : <0xad97>
    <bc39>   DW_AT_data_member_location: 100
 <2><bc3a>: Abbrev Number: 44 (DW_TAG_member)
    <bc3b>   DW_AT_name        : (indirect string, offset: 0x251b): unused1_fw
    <bc3f>   DW_AT_decl_file   : 14
    <bc40>   DW_AT_decl_line   : 274
    <bc42>   DW_AT_decl_column : 12
    <bc43>   DW_AT_type        : <0xad97>
    <bc47>   DW_AT_data_member_location: 104
 <2><bc48>: Abbrev Number: 44 (DW_TAG_member)
    <bc49>   DW_AT_name        : (indirect string, offset: 0xf1c): unused2_fw
    <bc4d>   DW_AT_decl_file   : 14
    <bc4e>   DW_AT_decl_line   : 275
    <bc50>   DW_AT_decl_column : 12
    <bc51>   DW_AT_type        : <0xad97>
    <bc55>   DW_AT_data_member_location: 108
 <2><bc56>: Abbrev Number: 44 (DW_TAG_member)
    <bc57>   DW_AT_name        : (indirect string, offset: 0x2320): unused3_fw
    <bc5b>   DW_AT_decl_file   : 14
    <bc5c>   DW_AT_decl_line   : 276
    <bc5e>   DW_AT_decl_column : 12
    <bc5f>   DW_AT_type        : <0xad97>
    <bc63>   DW_AT_data_member_location: 112
 <2><bc64>: Abbrev Number: 44 (DW_TAG_member)
    <bc65>   DW_AT_name        : (indirect string, offset: 0xd2c): unused4_fw
    <bc69>   DW_AT_decl_file   : 14
    <bc6a>   DW_AT_decl_line   : 277
    <bc6c>   DW_AT_decl_column : 12
    <bc6d>   DW_AT_type        : <0xad97>
    <bc71>   DW_AT_data_member_location: 116
 <2><bc72>: Abbrev Number: 44 (DW_TAG_member)
    <bc73>   DW_AT_name        : (indirect string, offset: 0x21d7): unused5_fw
    <bc77>   DW_AT_decl_file   : 14
    <bc78>   DW_AT_decl_line   : 278
    <bc7a>   DW_AT_decl_column : 12
    <bc7b>   DW_AT_type        : <0xad97>
    <bc7f>   DW_AT_data_member_location: 120
 <2><bc80>: Abbrev Number: 44 (DW_TAG_member)
    <bc81>   DW_AT_name        : (indirect string, offset: 0xb9c): unused6_fw
    <bc85>   DW_AT_decl_file   : 14
    <bc86>   DW_AT_decl_line   : 279
    <bc88>   DW_AT_decl_column : 12
    <bc89>   DW_AT_type        : <0xad97>
    <bc8d>   DW_AT_data_member_location: 124
 <2><bc8e>: Abbrev Number: 44 (DW_TAG_member)
    <bc8f>   DW_AT_name        : (indirect string, offset: 0x2059): unused7_fw
    <bc93>   DW_AT_decl_file   : 14
    <bc94>   DW_AT_decl_line   : 280
    <bc96>   DW_AT_decl_column : 12
    <bc97>   DW_AT_type        : <0xad97>
    <bc9b>   DW_AT_data_member_location: 128
 <2><bc9c>: Abbrev Number: 44 (DW_TAG_member)
    <bc9d>   DW_AT_name        : (indirect string, offset: 0x154a): untilize_copy_iters
    <bca1>   DW_AT_decl_file   : 14
    <bca2>   DW_AT_decl_line   : 282
    <bca4>   DW_AT_decl_column : 11
    <bca5>   DW_AT_type        : <0xad53>
    <bca9>   DW_AT_data_member_location: 132
 <2><bcaa>: Abbrev Number: 44 (DW_TAG_member)
    <bcab>   DW_AT_name        : (indirect string, offset: 0x1543): log_2x_untilize_copy_iters
    <bcaf>   DW_AT_decl_file   : 14
    <bcb0>   DW_AT_decl_line   : 283
    <bcb2>   DW_AT_decl_column : 11
    <bcb3>   DW_AT_type        : <0xad53>
    <bcb7>   DW_AT_data_member_location: 133
 <2><bcb8>: Abbrev Number: 44 (DW_TAG_member)
    <bcb9>   DW_AT_name        : (indirect string, offset: 0xddd): num_dram_io_bufs
    <bcbd>   DW_AT_decl_file   : 14
    <bcbe>   DW_AT_decl_line   : 284
    <bcc0>   DW_AT_decl_column : 12
    <bcc1>   DW_AT_type        : <0xad75>
    <bcc5>   DW_AT_data_member_location: 134
 <2><bcc6>: Abbrev Number: 44 (DW_TAG_member)
    <bcc7>   DW_AT_name        : (indirect string, offset: 0x38a7): dram_io_info
    <bccb>   DW_AT_decl_file   : 14
    <bccc>   DW_AT_decl_line   : 285
    <bcce>   DW_AT_decl_column : 43
    <bccf>   DW_AT_type        : <0xbd05>
    <bcd3>   DW_AT_data_member_location: 136
 <2><bcd4>: Abbrev Number: 44 (DW_TAG_member)
    <bcd5>   DW_AT_name        : (indirect string, offset: 0xa2a): num_fork_streams
    <bcd9>   DW_AT_decl_file   : 14
    <bcda>   DW_AT_decl_line   : 286
    <bcdc>   DW_AT_decl_column : 12
    <bcdd>   DW_AT_type        : <0xad75>
    <bce1>   DW_AT_data_member_location: 140
 <2><bce2>: Abbrev Number: 44 (DW_TAG_member)
    <bce3>   DW_AT_name        : (indirect string, offset: 0x2e7f): scatter_order_size
    <bce7>   DW_AT_decl_file   : 14
    <bce8>   DW_AT_decl_line   : 287
    <bcea>   DW_AT_decl_column : 12
    <bceb>   DW_AT_type        : <0xad75>
    <bcef>   DW_AT_data_member_location: 142
 <2><bcf0>: Abbrev Number: 44 (DW_TAG_member)
    <bcf1>   DW_AT_name        : (indirect string, offset: 0xeef): fork_idxs
    <bcf5>   DW_AT_decl_file   : 14
    <bcf6>   DW_AT_decl_line   : 288
    <bcf8>   DW_AT_decl_column : 11
    <bcf9>   DW_AT_type        : <0xbd0b>
    <bcfd>   DW_AT_data_member_location: 144
 <2><bcfe>: Abbrev Number: 0
 <1><bcff>: Abbrev Number: 37 (DW_TAG_pointer_type)
    <bd00>   DW_AT_byte_size   : 4
    <bd01>   DW_AT_type        : <0xb5c3>
 <1><bd05>: Abbrev Number: 37 (DW_TAG_pointer_type)
